[
    {
        "url": "https://www.swisscom.ch/en/residential/mobile-subscription.html",
        "data": {
            "title": "Mobile phone subscriptions: from 34.95/mth | Swisscom",
            "description": "Top mobile & mobile phone subscriptions for Switzerland ✓ blue Mobile ✓Fast 5G network ✓ Save 50% with family discount ► Discover mobile phone subscriptions now",
            "body": "Mobile phone subscriptions: from 34.95/mth | SwisscomYou are currently registered as a business customer and are in the residential customers area.To see the offers for business customers, switch to the business customer area.Jump to contentJump to searchJump to page footerThe best network at the best price: The new «We are Family!» discountCall our sales hotlineOpening hours:Monday till Saturday 8.00 to 20.000800 555 155Mobile subscriptions50% «We are family!» discount. The best network at the best price.Mobile subscriptionsUnlimited on the best network in Switzerland from 34.95.Mobile subscriptionsThe latest smartphonesat the best price.Fast, unlimited, sustainable: with blue Mobile, you can be contacted anytime, anywhere.If you have multiple blue Mobile subscriptions in the same household, the «We are Family!» discount is for you.​Questions? We will be happy to advise you by phone at0800 555 155Which subscription is best for you? Find the perfect subscription in just a few steps.Start the digital subscription advisorAdvantages of Switzerland’s most popularmobile subscriptionsSwitzerland’s best networkAlways connected: with 99.99% 5G coverage, you can surf and stream at the fastest speeds.Even better valueWith the «We are Family!» discount, you will save every month if you have multiple mobile subscriptions in the same household.Stay safe onlineThe free Callfilter and Internet Guard help you navigate the digital world safely.Flexible mobile use abroadOur roaming packages give you complete peace of mind when surfing and making calls while travelling.Frequently asked questionsWhat mobile subscriptions are available at Swisscom?Swisscom offers three blue Mobile subscriptions as well as additional Kids, Basic, and Prepaid tariffs. The main difference between the blue Mobile subscriptions is in the amount of roaming they include. Each subscription includes lots of free extras.blue Mobile Sblue Mobile Mblue Mobile LSurfing, calls & SMS:Unlimited within CHSurfing, calls & SMS:Unlimited within CH, EU/UK100 MB/mth. outside EU/UKSurfing, calls & SMS:Unlimited within CH, EU/UKUnlimited calls to EU/UK, USA, CAN1 GB data/year outside EU/UKMulti Device option for 4 additional devicesSurfing speed: up to 100 Mbit/sSurfing speed: up to 1 Gbit/sSurfing speed: up to 2 Gbit/s5G included5G included5G includedIncluding climate contributionIncluding climate contributionIncluding climate contributionInternet Guard surf protectionInternet Guard surf protectionInternet Guard surf protectionCallfilter call blockerCallfilter call blockerCallfilter call blocker10 GB myCloud storage10 GB myCloud storage10 GB myCloud storageE-mail account with 1 GBE-mail account with 1 GBE-mail account with 1 GBFrom CHF 69.90/mth.From CHF 79.90/mth.From CHF 99.90/mth.Compare all mobile subscriptionsWhat are the benefits of Swisscom’s mobile subscriptions?Swisscom’s mobile subscriptions are the most popular and widely used in Switzerland. They offer unlimited use in Switzerland and Europe and can be flexibly adjusted with options. They use the best and largest mobile and 5G network in Switzerland. This makes maximum speeds possible at most locations throughout Switzerland. All subscriptions offer numerous other free extras, maximum security and excellent service.How can I switch my mobile phone subscription to Swisscom?If you would like to switch to Swisscom from another provider, select your blue Mobile subscription online, and your new smartphone if required. During the order process, simply enter the telephone number that you would like us to port for you. Porting your phone number is free of charge and will take just a few days to process. We take care of all the formalities and cover the early exit fees for your current contract, up to CHF 500.–.It’s so easy to switchWhat additional free services are included in Swisscom’s mobile subscriptions?With Swisscom’s mobile subscriptions, you benefit from numerous additional free services.Swisscom CockpitTheSwisscom Cockpitprovides an overview of the services included in the subscription and your current charges. You can connect and manage additional devices with your subscription, and purchase packages and options.My Swisscom service appWithMy Swisscom, you can check charges and bills, adjust your subscription settings, add or remove options flexibly, or request support at any time.Internet Guard surfing protectionFree protection from dangerous websites without installing additional software on the device. Each day, SwisscomInternet Guardautomatically blocks around 250,000 malware attacks on websites.Callfilter call blockerFree protection from unsolicited calls. You can block marketing calls as well as anonymous calls and adjust the settings easily in the My Swisscom App.myCloud online storageEnjoy 10 GB of free storage for photos and videos on SwisscommyCloud.Free e-mailGet a freeBluewin e-mail accountwith 1 GB of storage.What options and packages are available with Swisscom’s mobile subscriptions?The following options and packages can be added flexibly to Swisscom’s mobile subscriptions.AbroadWe have a range of call and data options for making calls to and within other countries, such as theInternational Callsoption and theIntercontinental Pack. In theSwisscom Cockpit, it is easy to keep track of your roaming costs at all times and purchase data packages.Service und securityWithblue Security & ServiceandMy Service Mobile, we offer appropriate options to give you, your device, and your data even better protection and to support you in an emergency.Multi DeviceTheMulti Device Optionlets you surf on up to 10 additional devices with your blue Mobile subscription and make calls with the same telephone number. blue Mobile L already includes 4 additional devices. Further Multi Device options are also available as flexible add-ons (for up to 10 additional devices).All mobile optionsCombine Internet and MobileSave for life with the Combi DiscountEnjoy Switzerland’s best network with our mobile phonesGo to all smartphonesInstead of 1'299.– only 349.–You save 950.–Instead of 949.– only 339.–You save 610.–Instead of 1'049.– only 799.–You save 250.–One subscription for all your devicesIt’s easy to use your subscription on your tablet, laptop, smartwatch, or in your car, too.Discover Multi DeviceWithout a subscription on the best networkCancel anytime and easily top up your credit: Our popular prepaid offers.Discover Prepaid offersLoyalty offer for existing customersDo you already have a Swisscom mobile subscription? Take advantage of attractive loyalty offers such as a 400 Swiss franc discount on a new smartphone when you extend your contract.Discover loyalty offersUsing your mobile abroadWith our roaming tariffs and the tariff advisor, you can travel abroad worry-free and stay reachable at all times.Learn more about roamingIt’s worth being with SwisscomThe best serviceAs the connect test winner, we’re always there for you online or in a Swisscom Shop.Climate contribution includedAs the world’s most sustainable telecommunications service provider, we are doing our bit for the environment.Swisscom BenefitsRegular gifts, attractive discounts and loyalty offers just for you.Direct accessMy Swisscomblue TV PlayerSwisscom ShopsSwisscom CommunityMy ServicePrice overviewmyCloudblue NewsOffers & promotionsSwisscom BenefitsHelp & ServicesData & billsBluewin E-MailNetwork & OutagesMobileInternet & WLANTVFixed networkApps & ServicesSecurityDevices & instructionsMobile, Internet & TVMobile subscriptionChildren subscriptionPrepaidInternet subscriptionTV subscriptionInternet & TV subscriptionFixed network subscriptionSecurity subscriptionAdditional offersSpeedtestInsurancesHousehold insuranceLegal protectionTravel insuranceLeisure insuranceRental guarantee insuranceEasy ProtectionEasy CyberDevicesSmartphonesSmartwatchesHeadphonesInternet-Box & WLAN-BoxTV-Box & accessoriesCases & CoversTabletsPowerbanksSmart HomeAccessoriesAbout SwisscomCompanyInvestorsSustainabilityNetworkNewsJobs & careersSwisscom newsletterDownload the My Swisscom appSwisscom FacebookSwisscom XSwisscom InstagramSwisscom YouTubeSwisscom LinkedInSwisscom TikTokLegal aspectsImprintContactData protection"
        }
    },
    {
        "url": "https://www.swisscom.ch/en/residential/mobile-subscription/youth-subscription-children-subscription.html",
        "data": {
            "title": "blue Kids: Mobile Plans for Kids & Young Adults  | Swisscom",
            "description": "Kids and young adult plans ✓ blue Kids Mobile Subscription & Prepaid Kids ✓ For all under 16 years ► Discover our mobile & smartwatch plans from Swisscom now!",
            "body": "blue Kids: Mobile Plans for Kids & Young Adults  | SwisscomYou are currently registered as a business customer and are in the residential customers area.To see the offers for business customers, switch to the business customer area.Jump to contentJump to searchJump to page footerCall our sales hotlineOpening hours:Monday till Saturday 8.00 to 20.000800 555 155Mobile subscriptions for children and young peopleContactable any time, anywhere: with blue Kids, children and young people under 18 can safely use Switzerland’s best network.If you have multiple blue Mobile subscriptions in the same household, you permanently save 50% with the «We are Family!» discount.​Questions? We will be happy to advise you by phone at0800 555 155Advantages of the popular blue Kids subscriptionsSwitzerland’s best networkAlways connected: with 99.99 % 5G coverage, your child can surf and stream at the fastest speeds.Even better valueThe ideal first subscription, even better when combined. If you have multiple Mobile subscriptions in the same household, the “We are Family!” discount is for you.Stay safe onlineThe free security features and Swisscom Campus media tips help you protect your child online.Tips for parentsWhen’s the right time for their first smartphone? And what should you bear in mind? The tips from Swisscom Campus will help your child take their first steps in the digital world.First smartphone tips(opens in new tab)The best device deals for your childThe right mobile phone for every Mobile subscription. For every age, need and budget.Go to all smartphonesFromorYou savewith blue Mobile LFromorYou savewith blue Mobile LFromorYou savewith Installment-SubscriptionFromorFromorFromorFromorFromorFromorblue Kids Watch subscription from 9.95/mth.For your first steps in the digital worldFrequently asked questionsWhat mobile subscriptions does Swisscom offer for children and young people?Swisscom offers two blue Kids Mobile subscriptions for children and young people under 18: blue Kids Mobile for smartphones and blue Kids Watch for smartwatches. The subscriptions include lots of free extras.These days, many children between the ages of 7 and 10 start their digital journey with a smartwatch.From the age of around 11, they move from a smartwatch to a mobile phone or are given a mobile phone to use alongside their smartwatch.blue Kids Mobileblue kids WatchSurfing, calls, SMS:Unlimited in Switzerland300 MB data, 30 min. callsand 30 SMS per month worldwideSurfing, calls, SMS:Unlimited in Switzerland300 MB data, 30 min. callsand 30 SMS per month worldwideSurfingspeed8GB/mth. with up to 100 Mbit/s, after that 256 Kbit/sSurfingspeed1GB/mth. with up to 10 Mbit/s, after that 256 Kbit/s5G included5G includedIncluding climate contributionIncluding climate contributionChargeable services blockedChargeable services blockedInternet Guard surfing protectionInternet Guard surfing protectionCallfilter call blockerCallfilter call blockerSwisscom Campus educational programmesSwisscom Campus educational programmes10 GB myCloud storage10 GB myCloud storage1 GB e-mail account1 GB e-mail account29.90/mth.14.95/mth. with the «We are Family!» discount19.90/mth.9.95/mth. with the «We are Family!» discountWhat are the benefits of Swisscom’s Kids Mobile subscriptions?Swisscom’s blue Kids Mobile subscriptions are among the most popular and widely used in Switzerland. They are optimally designed to meet the needs of children and parents. They permit control of costs, are climate neutral and use the best and largest mobile and 5G network in Switzerland. This makes maximum speeds possible at most locations throughout Switzerland. All subscriptions offer numerous other free extras, maximum security and excellent service.The benefits of blue Kids MobileWith unlimited calls and data within Switzerland, the child is able to contact their parents at any time without needing to worry about running out of credit or data.They can also share their location at any time.The subscription also comes with 8 GB of data for faster surfing; for streaming videos on long car journeys, for example.Also included with the subscription is a monthly allowance for use abroad. This means that you can also communicate with your child when on holiday via WhatsApp and see where they are.Multi Device: an additional SIM for one other device, such as a smartwatch, costs just 5.–/month.The benefits of blue Kids WatchWith the blue Kids Watch smartwatch subscription, your child can make unlimited calls with their watch.With the included data, children can also chat and use basic apps.With this option too, the child can always be contacted when abroad.Attractive discounts onmobile phone and smartphone deals(opens in new tab)When you take out a new subscription, you can enjoy attractive discounts on smartphones for children from Apple, Samsung, Oppo, Nokia and other brands. We also offerreconditioned second-hand devices(opens in new tab).How can I get the cheapest Mobile subscription for children and young people?If someone in your household already has a blue Mobile or Internet subscription, you will receive an ongoing 50% “We are Family!” Discount on your blue Kids subscriptions. You are thus guaranteed the cheapest Mobile subscription for your child.Remember that a household without an Internet subscription must always have a blue Mobile subscription in first place in “My Household” in My Swisscom in order for a Kids subscription to receive the 50% «We are Family!» Discount. No more than 3 blue Kids subscriptions per household can take advantage of the “We are Family!” Discount.The new «We are Family!» Discount replaces the previous Kids Discount of 5.–/mo. If you switch to a new blue Kids subscription, the previous Kids Discount will no longer apply. Add the new Kids subscription into “My Household” in My Swisscom in order to take advantage of the new discount.How the «We are Family!» Discount worksWhat additional free services are included with Swisscom’s mobile subscriptions for children and young people?With Swisscom’s mobile subscriptions for children and young people, you benefit from parental control functions and many other free additional services.Value-added services are blockedWith Swisscom’s children’s subscriptions, the use of chargeable services is deactivated as standard. There must be an explicit activation request.Parental control appSwisscom’s My Security app allows you to control screen time, the content filter and much more besides. It is available with the blue Security & Service option and protects you and your loved ones from viruses and hackers.Swisscom Campus educational programmesSwisscom Campus(opens in new tab)gives you access to a huge range of information, tips, instructions and resources to promote and safe and responsible use of digital media by children and young people.Internet Guard surfing protectionFree protection from dangerous websites without the need to install additional software on the device. Each day, Swisscom Internet Guard automatically blocks around 250,000 malware attacks on websites.Callfilter call blockerFree protection from unsolicited calls. You can block marketing calls as well as anonymous calls and adjust the settings easily in the My Swisscom app.myCloud online storageEnjoy 10 GB of free storage for photos and videos on SwisscommyCloud(opens in new tab).Free e-mailGet a freeBluewin e-mail account(opens in new tab)with 1 GB of storage.My Swisscom service appWithMy Swisscom(opens in new tab), you can check charges and bills, adjust your subscription settings, add or remove options flexibly or request support at any time.Swisscom CockpitTheSwisscom Cockpit(opens in new tab)provides an overview of the services included in the subscription and your current charges. You can connect and manage additional devices with your subscription and purchase packages and options.Why are there limits to surfing speeds for Kids Mobile subscriptions?The surfing speeds and data volumes included in the blue Kids Mobile subscriptions are more than adequate for normal usage. Children and young people generally use their smartwatches and smartphones on WLAN. Daily screen time should be controlled on an individual basis and should not exceed several hours per day over a longer period.With 8 GB of mobile data, your child can:Watch around 16 hours of YouTube videos in very high quality (720px). With apps such as the blue TV app, you can download series and films via WLAN and watch offline to save data.Spend approx. 48 hours on Instagram.Spend approx. 26 hours on TikTok.Make approx. 24 hours of WhatsApp video calls.Listen to approx. 160 hours of music (on Spotify for example). Downloading the music onto your device via WLAN is even better.By comparison, apps such as the SBB app, calendar or weather apps use very little data.More tips on how 8 GB is enough for surfingWhat options and packages are available with Swisscom’s blue Kids Mobile subscriptions?The blue Kids Mobile and blue Kids Watch subscriptions include the Roaming Safety Pack for use abroad. This has inclusive worldwide allowances.Worldwide roaming per month:30 minutes of calls30 SMS300 MB dataThis means that your child is contactable by phone in an emergency even when abroad. Please note, however, that your child should avoid video streaming, gaming and video calls so as not to use up the included data volume too soon.If you use up the included allowance, additional data packages can be purchased in the Swisscom Cockpit.Go to Swisscom Cockpit(opens in new tab)Go to roaming packages(opens in new tab)This might also interest youAdded protection with My SecurityWith the My Security app, you can set time limits and content filters for your child to keep control of the apps and websites they use.Discover My SecurityOn the best network without a subscriptionStay connected at all times: With Prepaid Kids, your child can make free calls to 5 phone numbers and can surf the internet unlimited.Learn more about PrepaidAdded protection with My SecurityWith the My Security app, you can set time limits and content filters for your child to keep control of the apps and websites they use.Discover My SecurityOn the best network without a subscriptionStay connected at all times: With Prepaid Kids, your child can make free calls to 5 phone numbers and can surf the internet unlimited.Learn more about PrepaidIt’s worth being with SwisscomThe best serviceAs the connect test winner, we’re always there for you online or in a Swisscom Shop.Climate contribution includedAs the world’s most sustainable telecommunications service provider, we are doing our bit for the environment.Swisscom BenefitsRegular gifts, attractive discounts and loyalty offers just for you.Direct accessMy Swisscomblue TV PlayerSwisscom ShopsSwisscom CommunityMy ServicePrice overviewmyCloudblue NewsOffers & promotionsSwisscom BenefitsHelp & ServicesData & billsBluewin E-MailNetwork & OutagesMobileInternet & WLANTVFixed networkApps & ServicesSecurityDevices & instructionsMobile, Internet & TVMobile subscriptionChildren subscriptionPrepaidInternet subscriptionTV subscriptionInternet & TV subscriptionFixed network subscriptionSecurity subscriptionAdditional offersSpeedtestInsurancesHousehold insuranceLegal protectionTravel insuranceLeisure insuranceRental guarantee insuranceEasy ProtectionEasy CyberDevicesSmartphonesSmartwatchesHeadphonesInternet-Box & WLAN-BoxTV-Box & accessoriesCases & CoversTabletsPowerbanksSmart HomeAccessoriesAbout SwisscomCompanyInvestorsSustainabilityNetworkNewsJobs & careersSwisscom newsletterDownload the My Swisscom appSwisscom FacebookSwisscom XSwisscom InstagramSwisscom YouTubeSwisscom LinkedInSwisscom TikTokLegal aspectsImprintContactData protection"
        }
    },
    {
        "url": "https://www.swisscom.ch/en/residential/help/mobile.html",
        "data": {
            "title": "Mobile – Help | Swisscom",
            "description": "Here you will find instructions, tips and answers to common questions about the Mobile. Discover our comprehensive Mobile help section.",
            "body": "Mobile – Help | SwisscomJump to contentJump to searchJump to page footerHelp with your mobile phonePlaceholder TeaserBeschreibungstextMy LinkPlaceholder TeaserBeschreibungstextMy LinkUsing your mobile phone: instructions​Setting up a new mobile​Setting up COMBOX®/listening to messages​1 subscription for several devices​Blocking/ordering/activating eSIM​SMS services 444Get the «We are Family!» discountFix mobile faults​Top up prepaid credit (Cockpit)​​Roaming: charges from abroad​Buying a mobile phone & extending contracts​SMS filter against smishing(opens in new tab)​Blocking unsolicited calls​Mobile phone repair​Forgotten PIN/PUK​Lost/stolen mobile phone​​Mobile protection: Easy Protection​Payment and parental controls​Current error messagesCan't find what you're looking for? Ask theSwisscom Community(opens in new tab), use the search function orget in touchwith us.Direct accessMy Swisscomblue TV PlayerSwisscom ShopsSwisscom CommunityMy ServicePrice overviewmyCloudblue NewsOffers & promotionsSwisscom BenefitsHelp & ServicesData & billsBluewin E-MailNetwork & OutagesMobileInternet & WLANTVFixed networkApps & ServicesSecurityDevices & instructionsMobile, Internet & TVMobile subscriptionChildren subscriptionPrepaidInternet subscriptionTV subscriptionInternet & TV subscriptionFixed network subscriptionSecurity subscriptionAdditional offersSpeedtestInsurancesHousehold insuranceLegal protectionTravel insuranceLeisure insuranceRental guarantee insuranceEasy ProtectionEasy CyberDevicesSmartphonesSmartwatchesHeadphonesInternet-Box & WLAN-BoxTV-Box & accessoriesCases & CoversTabletsPowerbanksSmart HomeAccessoriesAbout SwisscomCompanyInvestorsSustainabilityNetworkNewsJobs & careersSwisscom newsletterDownload the My Swisscom appSwisscom FacebookSwisscom XSwisscom InstagramSwisscom YouTubeSwisscom LinkedInSwisscom TikTokLegal aspectsImprintContactData protection"
        }
    },
    {
        "url": "https://www.swisscom.ch/en/residential/mobile-subscription/prepaid.html",
        "data": {
            "title": "Prepaid: Mobile Tariffs & Prepaid Cards  | Swisscom",
            "description": "Swisscom prepaid tariffs ✓ Top up credit & full cost control ✓ From CHF 0.– ✓ Individually expandable ► Find a prepaid subscription now & surf!",
            "body": "Prepaid: Mobile Tariffs & Prepaid Cards  | SwisscomYou are currently registered as a business customer and are in the residential customers area.To see the offers for business customers, switch to the business customer area.Jump to contentJump to searchJump to page footerFree activation worth 19.90Call our sales hotlineOpening hours:Monday till Saturday 8.00 to 20.000800 555 155On the best network, without subscriptionExtend flexibly without subscriptionMobile and 5G network test winnerSubscription & network including climate contributionSwitch from prepaid to subscription: 50% discount for two yearsFind out moreOur prepaid offersOrder a prepaid basic tariff now and expand it later with attractive additional packages if required.Prepaid basic tariffWith the prepaid SIM card and the prepaid basic tariff, you can make calls at a rate per minute and surf the mobile Swisscom network without fixed costs.Calling: 0.29 per min.Max. 3 minutes per call pay for calls up to two hours. The first 120 minutes on all mobile and landline calls within Switzerland and FL cost a maximum of 87 centimes per call (3 minutes x 0.29 centimes/min). Each additional hour costs 60 centimes. Value-added services and special numbers are excluded.SMS: 0.15 per SMSCostable SMS services are excluded.Surfing: 2.– per dayThe charging of the daily flat rate only takes effect if more than 10 KB are transferred in one day. If 10 GB are reached within 30 days, the connection speed will be reduced to 128 kbit/s. Important: Data transfers can take place in the background, e.g. synchronisations or automatic updates. These can be deactivated on the mobile phone.One-time costs (starting credit): 20.–When you activate a new prepaid, you pay a one-time fee of 20.–, which serves as a starting credit. This means your prepaid subscription is ready to use straight away. You can immediately make calls and surf.More detailsPrice for 30 days0.–Top up credit in the cockpitYou can check your credit balance, top up and order additional packages at any time in Cockpit. Access to cockpit.swisscom.ch is free worldwide and can also be accessed with a credit balance of CHF 0.Further top-up options for prepaidTop-up options for prepaidTop-up optionWhere?Further informationCockpitWith your prepaid smartphone atcockpit.swisscom.ch(opens in new tab)Swisscom ShopIn a local Swisscom Shop:Find a ShopPayment possible with all major credit cards, TWINT or Swisscom invoice.My SwisscomOnline in the Customer Center.Go to Swisscom loginPayment possible with all major credit cards, TWINT or Swisscom invoice.Post officeAt the nearest post office or online.Find a post office(opens in new tab)Go to the Swiss Post online shop(opens in new tab)PostFinanceAt a Swiss Post cash machine or using the PostFinance app.Find Swiss Post cash machinen(opens in new tab)Go to PostFinance app(opens in new tab)SBBAt SBB ticket machines at the station or online.Go to SBB(opens in new tab)VouchersPrepaid vouchers (vouchers with prepaid credit) can be purchased at kiosks, petrol stations and retail outlets, for example..Vouchers can be redeemed by SMS to 444 or in the cockpit. Further information can be found in the Redeeming vouchers section.Prepaid voucher points of salePoints of saleWhereAdditional informationCoopAt all Coop branches, fuel stations, Interdiscount and FustDetails(opens in new tab)MigrosAt all Migros branches and petrol stationsDetails(opens in new tab)DennerAt the Denner checkoutDetails(opens in new tab)KioskAt all k kiosksDetails(opens in new tab)Petrol stationsAt various petrol stations across SwitzerlandRedeem vouchersRedeem voucher by SMS to 444Top up your own number: Send an SMS with the textVOUCHER [14-digit Value PIN]to 444 to top up your own number.Top up another number: Send an SMS with the textVOUCHER [14-digit number sequence] [external number 07x1234567]to 444 (remove star)Redeem voucher via CockpitGo to cockpit.swisscom.ch, click on the + next to the credit balance and then on \"Redeem voucher\". You can then enter the voucher code to top up the amount.Redeem voucher directly hereClick on the \"Top up credit directly here\" button above. Enter the telephone number you wish to top up, select \"Redeem voucher\" and then enter the voucher code. After entering the captcha, click on continue and you can confirm the top-up.With a mobile subscriptionGive prepaid credit as a gift: You can load money onto the desired prepaid mobile phone in the cockpit.In the cockpitGo to the Swisscom Cockpit with your prepaid mobile phone. Enter your desired amount and select \"Swisscom bill\" as the payment method.Prepaid credit advanceDo you need a prepaid advance? If you have less than 10.– of credit, we can help you with a 5.– advance. Only for customers over 18.Order advanceSend a free SMS with the word ADVANCE to 444. You will receive a credit of 5.–. When you next top up your credit, we will bill you 5.50 for the advance and the service charge.Notification of advanceIf your prepaid credit drops below 3.–, you will receive an automatic SMS informing you about the advance option.Expand your prepaid basic tariff with attractive additional packages.These packages are only valid in Switzerland.BestsellerPrepaid Plus30 days unlimited surfing (128 kbit/s) and text messaging.Show details5.–Select packageFor all under 18Prepaid Kids30 days of unlimited surfing (500MB high speed, then 128 kbit/s) and free calls and text messages to 5 numbers of your choice.Show details9.90/ For 30 daysSelect package24h Speed+5 GB surfing at the maximum available speed - valid for 24 hours.5.–/ Price for 24 hoursSelect packageEverything is unlimited for a certain period of timePrepaid Flat 77 days unlimited surfing, calling and texting within Switzerland.Show details20.–/ One-off priceSelect packagePrepaid Flat 3030 days unlimited surfing, calling and texting within Switzerland.Show details65.–/ One-off priceSelect packagePrepaid Flat 9090 days unlimited surfing, calling and texting within Switzerland.Show details150.–/ One-off priceSelect packageEven more data for your prepaid500 MB data500 MB surfing at speeds of up to 50 Mbit/s.6.90/ Price for 30 daysSelect package2 GB data2 GB surfing at speeds of up to 50 Mbit/s19.90/ Price for 30 daysSelect package5 GB data5 GB surfing at speeds of up to 50 Mbit/s.34.90/ Price for 30 daysSelect packagePackages for abroadEasily find the right package for your trip abroad in the tariff check.To the tariff enquiry(opens in new tab)The benefits of Swisscom PrepaidFreedom, flexibility and controlWith Swisscom Prepaid, you enjoy the freedom to terminate your subscription at any time or switch without any follow-up costs. With our packages, you can flexibly expand your Prepaid with flat rates. So you always have full control over your costs.Mobile and 5G network test winnerOurmobile and 5G networkhas won more awards than any other Swiss network. Our test-winning service offers the best coverage, maximum speed and the best connection quality. That’s why blue Mobile is Switzerland’s number 1.Service test winnerEnjoy the best customer service with Swisscom. Whether you’re on the hotline, visiting one of over 100 Swisscom Shops or using theSwisscom Cockpit(opens in new tab): you can check and top up credit, adjust options, block SIM cards, and much more besides – at any time.Sustainability: climate contribution includedWe are making a contribution to climate protection by minimising our CO2 emissions and investing in certified climate protection projects for the remaining CO2 emissions. Find out more atwww.swisscom.ch/climate-contribution.Make the most of the Combi DiscountWith the Combi Discount, you enjoy an additional 500 MB of high-speed surfing per month on prepaid plus and Kids. To take advantage of this offer, you will need an Internet subscription in your household.Internet Guard surfing protectionFree protection from dangerous websites without installing additional software on the device. Each day, Swisscom Internet Guard automatically blocks around 250,000 malware attacks on websites.Frequently asked questionsHow can I check my credit?You can check your credit any time free of charge in the Cockpit using your prepaid mobile or by sending an SMS.In the CockpitYou can view your credit balance atcockpit.swisscom.chat any time. You can use your prepaid mobile to accesscockpit.swisscom.chfree of charge worldwide, even if you have no credit left.Via SMSTextSTATUSto444. You will receive an SMS with your current remaining credit.Do prepaid credits expire?Prepaid credit will expire in the following cases, meaning the SIM card will be void and the number will revert to Swisscom:If you port your number (switch your existing phone number to another provider)If you fail to use the card for 12 monthsIf you misuse the prepaid serviceWhat happens if the prepaid SIM is not used?If the prepaid service is not used for 12 months, the SIM card or eSIM profile becomes invalid, the remaining prepaid credit lapses and the number reverts to Swisscom without compensation in accordance with the General Terms and Conditions for Mobile Prepaid Services.Non-use comprises all activities that do not result in a change (reduction or increase) to the prepaid credit, e.g.:Switching on the mobile deviceIncoming text messagesUsage (calls, text messages, mobile data communication) that does not result in a reduction to the prepaid credit in the specific case (e.g. because it is covered by a paid-for package (option))Use comprises all activities that result in a change (reduction or increase) to the prepaid credit in each specific case, e.g.:Topping up prepaid creditPurchasing packages/optionsUsage (outgoing calls, sending text messages, mobile data communications) that results in a reduction to the prepaid credit in the specific caseHow many prepaid numbers are allowed per person?A maximum of five prepaid numbers are permitted per person. A purchase or registration of a prepaid SIM can be refused if there are indications of future misuse or if the customeralready has five prepaid SIMs.Can a prepaid number be resold?No, the resale of the prepaid number is not permitted. Swisscom makes them available to the customer exclusively for their own use. The phone numbers do not become the property of the customer and may not be sold to third parties. Swisscom may withdraw or change phone numbers without compensation in the event of an intended or completed sale.blue KidsMobile subscriptions for children and young people under 18.Discover blue KidsReady for the connected worldSwisscom is committed to reducing CO2 emissions and supporting climate protection projects.For years, we have been teaching young and old how to use digital media and devices.Our way of saying thank you! The new loyalty programme.Direct accessMy Swisscomblue TV PlayerSwisscom ShopsSwisscom CommunityMy ServicePrice overviewmyCloudblue NewsOffers & promotionsSwisscom BenefitsHelp & ServicesData & billsBluewin E-MailNetwork & OutagesMobileInternet & WLANTVFixed networkApps & ServicesSecurityDevices & instructionsMobile, Internet & TVMobile subscriptionChildren subscriptionPrepaidInternet subscriptionTV subscriptionInternet & TV subscriptionFixed network subscriptionSecurity subscriptionAdditional offersSpeedtestInsurancesHousehold insuranceLegal protectionTravel insuranceLeisure insuranceRental guarantee insuranceEasy ProtectionEasy CyberDevicesSmartphonesSmartwatchesHeadphonesInternet-Box & WLAN-BoxTV-Box & accessoriesCases & CoversTabletsPowerbanksSmart HomeAccessoriesAbout SwisscomCompanyInvestorsSustainabilityNetworkNewsJobs & careersSwisscom newsletterDownload the My Swisscom appSwisscom FacebookSwisscom XSwisscom InstagramSwisscom YouTubeSwisscom LinkedInSwisscom TikTokLegal aspectsImprintContactData protection"
        }
    },
    {
        "url": "https://www.sunrise.ch/en/mobile/mobile-subscription",
        "data": {
            "title": "Mobile Subscriptions - Best Plans in Switzerland | Sunrise",
            "description": "Discover Sunrise mobile plans with unlimited 5G and top coverage. • Switch now from 29.90/mth and choose the perfect plan to fit your needs.",
            "body": "Mobile Subscriptions - Best Plans in Switzerland | SunrisePrivateBusinessPropertiesHelpShop finderSunrise MomentsSunrise mailSunrise cockpitENInternet & TVSUBSCRIPTIONSInternetInternet & TVData SIM / Extra SIMSAVE NOWSamsung TV giftedMySports – 6 months for freeHappy Women's Day: AirPods Max giftedRecommend Sunrise and earn up to 220.–MORE INFORMATIONSmart WiFi Extender​Sunrise TVSports PackagesConnect AppTV App & IPTVLandline TelephonyCyber SecuritySpeed UpgradeSunrise PayMobileSUBSCRIPTIONSMobileSunrise Young – for everyone under 27Data SIM / Extra SIMPrepaidRoamingOptionsSAVE NOWSwiss Travel+ mobile subscriptionHappy Women's Day: AirPods Max giftedRecommend Sunrise and earn up to 220.–MORE INFORMATION5G NetworkWi-Fi CallingCyber SecurityChange my Sunrise subscriptionSunrise PayCombi subscriptionDevicesDEVICESSmartphonesWorld of AppleWorld of SamsungTabletsSmartwatchesAccessoriesHOME & ENTERTAINMENTTVs & projectorsComputersGamingHIGHLIGHTSNew: iPhone 16eFlex Premium BundleSmart UpgradeFlex UpgradeBuybackSunrise PayYoungTop DealsSales HotlineMy SunriseENMy SunriseInternet & TVSubscriptionsInternetInternet & TVData SIM / Extra SIMSave nowSamsung TV giftedMySports – 6 months for freeHappy Women's Day: AirPods Max giftedRecommend Sunrise and earn up to 220.–More InformationSmart WiFi Extender​Sunrise TVSports PackagesConnect AppTV App & IPTVLandline TelephonyCyber SecuritySpeed UpgradeSunrise PayMobileSubscriptionsMobileSunrise Young – for everyone under 27Data SIM / Extra SIMPrepaidRoamingOptionsSave nowSwiss Travel+ mobile subscriptionHappy Women's Day: AirPods Max giftedRecommend Sunrise and earn up to 220.–More Information5G NetworkWi-Fi CallingCyber SecurityChange my Sunrise subscriptionSunrise PayCombi subscriptionDevicesDevicesSmartphonesWorld of AppleWorld of SamsungTabletsSmartwatchesAccessoriesHome & EntertainmentTVs & projectorsComputersGamingHighlightsNew: iPhone 16eFlex Premium BundleSmart UpgradeFlex UpgradeBuybackSunrise PayYoungTop DealsPrivateBusinessPropertiesHelpShop finderSunrise MomentsSunrise mailSunrise cockpitLog in to My Sunrise for exclusive dealsLog inSwiss Travel+ mobile subscriptionUNLIMITED IN CH + 8 EU COUNTRIES+3 GB in 38 European countries, USA, and CanadaSwitch to Sunrise nowKeep your existing number or choose a new one in the next step. We take care of the rest.Offer terms and conditionsFor Up Mobile M, L and XLIncluded for free:Activation fee (worth 59.90) and SIM card24 months minimum contract:After 24 months, you will pay the standard price and the subscription automatically converts into an open-ended contract with a 60-day notice period.Cancellation:Requires a 60-day notice. If cancelled before the end of the 24 months, monthly base fees for the remaining period must be paid in full.For Swiss Travel+Included for free:Activation fee (worth 59.90) and SIM cardNo minimum contract periodCancellation:Can be cancelled with a 60-day notice period to the end of any month.Change my current Sunrise subscriptionYour benefits with SunriseSurf and call abroadstress free with our roaming options50% offeach additional Up Mobile subscriptionExclusive discounts and VIP accesson events with Sunrise MomentsAward-winning networkrated as «Outstanding» for the 9th year in a rowWe handle the switch for youOrderSimply order online and, if desired, keep your old phone number - We'll cancel your old contract for you.Find out moreActivationWe'll send you a confirmation and your new SIM card, activated on the transfer date.Welcome on BoardIt's that easy! Start surfing and making calls on our top-notch, award-winning network from the transfer date.COMBINE WITH INTERNET & ENJOY THE BENEFITSTo the bundleOutstanding networkBEST MOBILE TELEPHONY, MOST RELIABLE DATA CONNECTIONSFrequently asked questionsI want to change my provider. How can I keep my current mobile number?Here are the five steps required to keep your number. It only takes two minutes!1. Enter three details about your current contract2. We’ll handle the processing3. You get a confirmation by SMS or email4. Authorise us to cancel your current contract5. You take your number with you on the notified dayMore detailsNeed help with the details of your current mobile subscription?Simply text INFO to 503 for freeand find out:From which date your free number transfer is availableWhich fees apply in case of an immediate transferWho is the legal owner of your current mobile subscriptionI already have a mobile subscription from UPC and would like to sign up for another Up Mobile subscription. Can I take advantage of this offer?Yes, this offer is valid for new subscriptions. If you’d like to change your existing UPC mobile subscription, then call us on0800 66 88 66so that we can provide you with personal advice.Which countries are included?Swiss Travel+Unlimited data and calls in:Switzerland, Germany, Italy, France, Spain (incl. Canary Islands and Balearic Islands), Portugal (incl. Madeira and Azores), Austria, Liechtenstein and Greece. Overseas territories of the countries listed are excluded.3 GB data per month in:Åland Islands, Andorra, Belgium, Bulgaria, Canada, Croatia, Cyprus, Czech Republic, Denmark, Estonia, Faroe Islands, Finland, Gibraltar, Greenland, Guernsey, Hungary, Iceland, Ireland, Isle of Man, Jersey, Latvia, Lithuania, Luxembourg, Malta, Monaco, Netherlands, Norway, Poland, Puerto Rico, Romania, San Marino, Sweden, Slovakia, Slovenia, Svalbard and Jan Mayen, Turkey, United Kingdom, United States (USA). Overseas territories of the countries listed are excluded.Up Mobile L and XLUnlimited data and calls in:Åland Islands, Andorra, Austria, Belgium, Bulgaria, Croatia, Cyprus, Czech Republic, Denmark, Estonia, Faroe Islands, Finland, France, Germany, Gibraltar, Greece, Greenland, Guernsey, Hungary, Iceland, Ireland, Isle of Man, Italy, Jersey, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Norway, Netherlands, Poland, Portugal (incl. Madeira, Azores), Romania, San Marino, Slovakia, Slovenia, Spain (incl. Canary Islands, Balearic Islands), Svalbard and Jan Mayen, Sweden, Turkey, United Kingdom, and Vatican City. Overseas territories of the countries listed are excluded.Are there any roaming-data packages for other countries that are not included?Yes, you can benefit from our attractive roaming-data packages. For more information, please visitsunrise.ch/en/roaming.Is there a family discount?Yes, when you purchase a mobile subscription, you’ll receive a permanent 50% discount on each additional Up Mobile subscription.Is there an activation fee?No, the activation fee of 59.90 is waived when purchasing online.What is surf protect?Surf protect is included free of charge with Up Mobile M, L and XL and offers protection while surfing the mobile network. The application checks whether websites pose a threat and prevents malware from being transmitted.What is an eSIM and how does it work?The eSIM replaces the physical SIM card and simply lets you use other phone numbers with the same smartphone (dual SIM mode).An eSIM chip is permanently integrated into your device and receives all the information you need from your eSIM profile.Still have questions?Go to Help CenterSunrise onAbout SunriseCompanyAbout usMediaInvestor RelationsSustainabilityJobs & CareersLocationsDirect accessWhy Sunrise?Combo discountMy SunriseNetwork coverage mapMy billSwitching to SunriseBlogSunrise CommunityDiscover SunrisePromotions and dealsconnect mobile and 5G network testDevicesWorld of AppleAward winning digital TVRoaming - use your mobile phone abroadSunrise affiliate program (German)Recommend SunriseContactSales hotline: 0800 707 504Other contact optionsShop finderSunrise on©2025Sunrise GmbHSitemapData privacyLegal mattersImprintSitemapData privacyLegal mattersImprint©2025Sunrise GmbH"
        }
    },
    {
        "url": "https://www.sunrise.ch/en/mobile/prepaid",
        "data": {
            "title": "Sunrise Prepaid Plans | Unlimited Data with No Contract",
            "description": "Enjoy maximum freedom with Sunrise Prepaid plans. • Unlimited data and easy top-ups starting from CHF 0, no long-term commitment required.",
            "body": "Sunrise Prepaid Plans | Unlimited Data with No ContractPrivateBusinessPropertiesHelpShop finderSunrise MomentsSunrise mailSunrise cockpitENInternet & TVSUBSCRIPTIONSInternetInternet & TVData SIM / Extra SIMSAVE NOWSamsung TV giftedMySports – 6 months for freeHappy Women's Day: AirPods Max giftedRecommend Sunrise and earn up to 220.–MORE INFORMATIONSmart WiFi Extender​Sunrise TVSports PackagesConnect AppTV App & IPTVLandline TelephonyCyber SecuritySpeed UpgradeSunrise PayMobileSUBSCRIPTIONSMobileSunrise Young – for everyone under 27Data SIM / Extra SIMPrepaidRoamingOptionsSAVE NOWSwiss Travel+ mobile subscriptionHappy Women's Day: AirPods Max giftedRecommend Sunrise and earn up to 220.–MORE INFORMATION5G NetworkWi-Fi CallingCyber SecurityChange my Sunrise subscriptionSunrise PayCombi subscriptionDevicesDEVICESSmartphonesWorld of AppleWorld of SamsungTabletsSmartwatchesAccessoriesHOME & ENTERTAINMENTTVs & projectorsComputersGamingHIGHLIGHTSNew: iPhone 16eFlex Premium BundleSmart UpgradeFlex UpgradeBuybackSunrise PayYoungTop DealsSales HotlineMy SunriseENMy SunriseInternet & TVSubscriptionsInternetInternet & TVData SIM / Extra SIMSave nowSamsung TV giftedMySports – 6 months for freeHappy Women's Day: AirPods Max giftedRecommend Sunrise and earn up to 220.–More InformationSmart WiFi Extender​Sunrise TVSports PackagesConnect AppTV App & IPTVLandline TelephonyCyber SecuritySpeed UpgradeSunrise PayMobileSubscriptionsMobileSunrise Young – for everyone under 27Data SIM / Extra SIMPrepaidRoamingOptionsSave nowSwiss Travel+ mobile subscriptionHappy Women's Day: AirPods Max giftedRecommend Sunrise and earn up to 220.–More Information5G NetworkWi-Fi CallingCyber SecurityChange my Sunrise subscriptionSunrise PayCombi subscriptionDevicesDevicesSmartphonesWorld of AppleWorld of SamsungTabletsSmartwatchesAccessoriesHome & EntertainmentTVs & projectorsComputersGamingHighlightsNew: iPhone 16eFlex Premium BundleSmart UpgradeFlex UpgradeBuybackSunrise PayYoungTop DealsPrivateBusinessPropertiesHelpShop finderSunrise MomentsSunrise mailSunrise cockpitLog in to My Sunrise for exclusive dealsLog inNo bindingMAXIMUM FREEDOM WITH  PREPAIDDiscover our new prepaid offers nowOptions and packagesOverview of all available products and extensions for prepaid new registrationsDiscoverSunrise CockpitAt any time, you can buy options for Switzerland or abroad, check your balance, or top up your Prepaid. You have worldwide free access via your mobile phone, even if the current balance is 0 CHF.DiscoverDiscover My Sunrise!The online customer service for your prepaid product. Top up, block, cost control, or purchase options with just a few clicks.To My SunriseTop-up creditSimply top up your prepaid credits or for other Sunrise prepaid customers online or discover other top-up options.Top-up nowFrequently asked questionsWhere can I get a Sunrise prepaid SIM?To apply for a Sunrise Prepaid SIM, you have to register. For this we need an official ID or passport. Choose the prepaid plan that best suits your needs. The Sunrise Prepaid SIM costs CHF 19.90 once, which must be paid during the registration process. For this they get CHF 20 starting credit on their prepaid SIM.How do I check my Sunrise Prepaid balance?You can check your Sunrise Prepaid balance by dialing *121# from your mobile phone.Can I keep my current phone number when switching to Sunrise Prepaid?Yes, you can keep your current phone number when switching to Sunrise Prepaid. You need to request an unblock for number portability. This works very simply, write an SMS with the text \"YES\" to 499. As soon as you receive a confirmation via SMS, Sunrise can contact your current network provider to request the number. As a rule, a prepaid number porting takes between 5-10 days. You will be informed by us.How do I add credit to my Sunrise Prepaid account?You can save your credit card inMy Sunriseso that you can benefit from simplified prepaid top-up in the future. We also offer top-ups via Twint. Do you already know theMy Sunrise appbelow?How can I activate my prepaid tariff?Find more information about theactivation and theSunrise Cockpithere.Can I use my prepaid number abroad?Yes, you can use your Sunrise prepaid number abroad too. Attractive Sunrise roaming packages are available atcockpit.sunrise.ch(free access worldwide).How can I cancel my prepaid number?Sunrise prepaid doesn’t need to be cancelled because there’s no base monthly fee for you to pay. If no mobile data has been used, no calls have been made and no SMS have been sent in the last 17 months, Sunrise will automatically cancel your prepaid number. The remaining credit will be lost and the phone number will be returned to Sunrise without any compensation. We’ll send you several e-mails before we cancel your prepaid number.I’ve lost my prepaid SIM, can I order a new one?You can order a replacement SIM for free inMy Sunriseunder «SIM & Devices».To allow us to send you the new SIM, you need to top up your prepaid balance by a minimum of CHF 20.– in the next 48 hours, regardless of your current calling time credit. The replacement SIM is free and all of the top-up amount will be credited to your prepaid balance. You will of course keep your existing prepaid number. A replacement SIM can also be activated in aSunrise shop. An official ID card is required.Losing your prepaid credit balanceThe prepaid credit balance will expire if:• The number hasn’t been used for 17 months. Examples of usage include topping up the credit balance, making calls, using mobile data or sending SMS. In addition, after the 17 months, the phone number will be cleared to be reassigned.• The phone number is ported to another provider.• The prepaid services are used in a way that breaches the contract.Before the credit is lost or the phone number deactivated, you’ll receive reminders by e-mail. You should therefore make sure that the e-mail address you’ve provided inMy Sunriseis up-to-date.Still have questions?Go to Help CenterSunrise onAbout SunriseCompanyAbout usMediaInvestor RelationsSustainabilityJobs & CareersLocationsDirect accessWhy Sunrise?Combo discountMy SunriseNetwork coverage mapMy billSwitching to SunriseBlogSunrise CommunityDiscover SunrisePromotions and dealsconnect mobile and 5G network testDevicesWorld of AppleAward winning digital TVRoaming - use your mobile phone abroadSunrise affiliate program (German)Recommend SunriseContactSales hotline: 0800 707 504Other contact optionsShop finderSunrise on©2025Sunrise GmbHSitemapData privacyLegal mattersImprintSitemapData privacyLegal mattersImprint©2025Sunrise GmbH"
        }
    },
    {
        "url": "https://www.sunrise.ch/en/mobile/mobile-data",
        "data": {
            "title": "5G Mobile Data Plans – On the Go & at Home | Sunrise",
            "description": "Enjoy fast 5G mobile internet for laptops, tablets, or smartwatches. • Sunrise data plans with or without a mobile subscription.",
            "body": "5G Mobile Data Plans – On the Go & at Home | SunrisePrivateBusinessPropertiesHelpShop finderSunrise MomentsSunrise mailSunrise cockpitENInternet & TVSUBSCRIPTIONSInternetInternet & TVData SIM / Extra SIMSAVE NOWSamsung TV giftedMySports – 6 months for freeHappy Women's Day: AirPods Max giftedRecommend Sunrise and earn up to 220.–MORE INFORMATIONSmart WiFi Extender​Sunrise TVSports PackagesConnect AppTV App & IPTVLandline TelephonyCyber SecuritySpeed UpgradeSunrise PayMobileSUBSCRIPTIONSMobileSunrise Young – for everyone under 27Data SIM / Extra SIMPrepaidRoamingOptionsSAVE NOWSwiss Travel+ mobile subscriptionHappy Women's Day: AirPods Max giftedRecommend Sunrise and earn up to 220.–MORE INFORMATION5G NetworkWi-Fi CallingCyber SecurityChange my Sunrise subscriptionSunrise PayCombi subscriptionDevicesDEVICESSmartphonesWorld of AppleWorld of SamsungTabletsSmartwatchesAccessoriesHOME & ENTERTAINMENTTVs & projectorsComputersGamingHIGHLIGHTSNew: iPhone 16eFlex Premium BundleSmart UpgradeFlex UpgradeBuybackSunrise PayYoungTop DealsSales HotlineMy SunriseENMy SunriseInternet & TVSubscriptionsInternetInternet & TVData SIM / Extra SIMSave nowSamsung TV giftedMySports – 6 months for freeHappy Women's Day: AirPods Max giftedRecommend Sunrise and earn up to 220.–More InformationSmart WiFi Extender​Sunrise TVSports PackagesConnect AppTV App & IPTVLandline TelephonyCyber SecuritySpeed UpgradeSunrise PayMobileSubscriptionsMobileSunrise Young – for everyone under 27Data SIM / Extra SIMPrepaidRoamingOptionsSave nowSwiss Travel+ mobile subscriptionHappy Women's Day: AirPods Max giftedRecommend Sunrise and earn up to 220.–More Information5G NetworkWi-Fi CallingCyber SecurityChange my Sunrise subscriptionSunrise PayCombi subscriptionDevicesDevicesSmartphonesWorld of AppleWorld of SamsungTabletsSmartwatchesAccessoriesHome & EntertainmentTVs & projectorsComputersGamingHighlightsNew: iPhone 16eFlex Premium BundleSmart UpgradeFlex UpgradeBuybackSunrise PayYoungTop DealsPrivateBusinessPropertiesHelpShop finderSunrise MomentsSunrise mailSunrise cockpitULTRA-FAST INTERNET FOR WHEN YOU’RE ON THE GOOnline only: Free activation worth 29.90Do you prefer to visit us in our shop?Shop finderSuitable devicesSmartwatchFind the smartwatch that matches your style and stay connected at all times, even without your phone.Discover nowWiFi RouterDiscover our WiFi routers for your plug-and-play home-WiFi network or hotspot on the go. Perfect for We Connect WiFi.Discover nowTablet or LaptopOur selection of tablets will give your passengers the best entertainment on your next road trip. Perfect for We Connect surf.Discover nowYou deserve an outstanding netwokOUTSTANDING NETWORK AND BEST CUSTOMER SERVICEFrequently asked questionsWhat are the terms of the promotion?We Connect watch: CHF 7.50/month (instead of CHF 10.–/month) and We Connect Wi-Fi: CHF 30.–/month (instead of CHF 60.–/month) for 24 months, then the regular price. Minimum contract period of 24 months. Activation fee waived. Subject to change.I already have a mobile subscription from UPC. Can I take advantage of this offer?Yes, this offer is valid for new subscriptions. If you would like to adjust your existing UPC mobile subscription, call us at0800 663 366so that we can provide personal advice.Which countries do you mean by «almost all of Europe»?For \"almost all of Europe\", the following European countries are included: Åland Islands, Andorra, Austria, Belgium, Bulgaria, Croatia, Cyprus, Czech Republic, Denmark, Estonia, Faroe Islands, Finland, France, Germany, Gibraltar, Greece, Greenland, Guernsey, Hungary, Iceland, Ireland, Isle of Man, Italy, Jersey, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Norway, Netherlands, Poland, Portugal (incl. Madeira, Azores), Romania, San Marino, Slovakia, Slovenia, Spain (incl. Canary Islands, Balearic Islands), Svalbard and Jan Mayen, Sweden, Turkey, United Kingdom, and Vatican City.It's that easy to bring your mobile number to SunriseKeep your number in five easy steps, it only takes you 2 minutes!1. Enter three details about your current contract2. We take care of all the handling3. You get a confirmation by SMS or email4. Authorise us to cancel your current contract5. You take your number with you on the appointed dayMore detailsNeed help with the details of your current contract?Simply text INFO to 503 for freeand find out:as of when you can take your number with you free of chargewhich fees apply in case of an immediate transferwho is the legal owner of your current contractStill have questions?Go to Help CenterSunrise onAbout SunriseCompanyAbout usMediaInvestor RelationsSustainabilityJobs & CareersLocationsDirect accessWhy Sunrise?Combo discountMy SunriseNetwork coverage mapMy billSwitching to SunriseBlogSunrise CommunityDiscover SunrisePromotions and dealsconnect mobile and 5G network testDevicesWorld of AppleAward winning digital TVRoaming - use your mobile phone abroadSunrise affiliate program (German)Recommend SunriseContactSales hotline: 0800 707 504Other contact optionsShop finderSunrise on©2025Sunrise GmbHSitemapData privacyLegal mattersImprintSitemapData privacyLegal mattersImprint©2025Sunrise GmbH"
        }
    },
    {
        "url": "https://www.sunrise.ch/en/mobile/young",
        "data": {
            "title": "Sunrise Young – Mobile Subscriptions for Under-27s | Best Plans",
            "description": "Save up to 25% with Sunrise Young plans for everyone under 27. • Get unlimited data starting from CHF 30.95/mth, with no minimum contract duration.",
            "body": "Sunrise Young – Mobile Subscriptions for Under-27s | Best PlansPrivateBusinessPropertiesHelpShop finderSunrise MomentsSunrise mailSunrise cockpitENInternet & TVSUBSCRIPTIONSInternetInternet & TVData SIM / Extra SIMSAVE NOWSamsung TV giftedMySports – 6 months for freeHappy Women's Day: AirPods Max giftedRecommend Sunrise and earn up to 220.–MORE INFORMATIONSmart WiFi Extender​Sunrise TVSports PackagesConnect AppTV App & IPTVLandline TelephonyCyber SecuritySpeed UpgradeSunrise PayMobileSUBSCRIPTIONSMobileSunrise Young – for everyone under 27Data SIM / Extra SIMPrepaidRoamingOptionsSAVE NOWSwiss Travel+ mobile subscriptionHappy Women's Day: AirPods Max giftedRecommend Sunrise and earn up to 220.–MORE INFORMATION5G NetworkWi-Fi CallingCyber SecurityChange my Sunrise subscriptionSunrise PayCombi subscriptionDevicesDEVICESSmartphonesWorld of AppleWorld of SamsungTabletsSmartwatchesAccessoriesHOME & ENTERTAINMENTTVs & projectorsComputersGamingHIGHLIGHTSNew: iPhone 16eFlex Premium BundleSmart UpgradeFlex UpgradeBuybackSunrise PayYoungTop DealsSales HotlineMy SunriseENMy SunriseInternet & TVSubscriptionsInternetInternet & TVData SIM / Extra SIMSave nowSamsung TV giftedMySports – 6 months for freeHappy Women's Day: AirPods Max giftedRecommend Sunrise and earn up to 220.–More InformationSmart WiFi Extender​Sunrise TVSports PackagesConnect AppTV App & IPTVLandline TelephonyCyber SecuritySpeed UpgradeSunrise PayMobileSubscriptionsMobileSunrise Young – for everyone under 27Data SIM / Extra SIMPrepaidRoamingOptionsSave nowSwiss Travel+ mobile subscriptionHappy Women's Day: AirPods Max giftedRecommend Sunrise and earn up to 220.–More Information5G NetworkWi-Fi CallingCyber SecurityChange my Sunrise subscriptionSunrise PayCombi subscriptionDevicesDevicesSmartphonesWorld of AppleWorld of SamsungTabletsSmartwatchesAccessoriesHome & EntertainmentTVs & projectorsComputersGamingHighlightsNew: iPhone 16eFlex Premium BundleSmart UpgradeFlex UpgradeBuybackSunrise PayYoungTop DealsPrivateBusinessPropertiesHelpShop finderSunrise MomentsSunrise mailSunrise cockpitLog in to My Sunrise for exclusive dealsLog in50% off the Half-Fare Card•Up to 25% off festivals and events•No contract commitmentWant more connection?Switch to Sunrise Young now:Change my current Sunrise subscriptionAll the key details50% off Half FareSunrise Young gives you 50% off theHalf Fare Travelcard.25% off on festivals and eventsPresales, VIP tickets and up to 25% off festivals and eventsComplete flexibilityWant to switch between subscriptions at any time, with no contractual obligation?Keep your numberTell us your current number at the checkout and we’ll do the rest.Secure surfing with surf protectThe surf protect option included checks whether websites pose a threat to prevent malware being transmitted.Outstanding mobile networkDid you know that the Sunrise network has been rated «outstanding» for the eighth time in a row?Other benefitsFrequently asked questionsHow can I keep my current mobile number?Here are the five steps required to keep your number. It only takes two minutes!1. Enter three details about your current contract2. We take care of all the handling3. You get a confirmation by SMS or email4. Authorise us to cancel your current contract5. You take your number with you on the appointed dayMore detailsNeed help with the details of your current contract?Simply text INFO to 503 for freeand find out:as of when you can take your number with you free of chargewhich fees apply in case of an immediate transferwho is the legal owner of your current contractWho can benefit from an Up Mobile Young subscription?Everyone under the age of 27.What happens when you turn 27?The Young subscription expires on the customer’s 27th birthday and is then automatically changed to an Up Mobile subscription with similar services, but possibly a higher price and different terms and conditions, at the end of the month following a period of 60 days.How do I redeem the Half Fare Travelcard discount?Renew your option onMy Sunriseone week before it expires. We'll send you the Rail Check in the post and you can then redeem it at a staffed public-transport ticket office.I already have a mobile subscription from UPC. Can I take advantage of this offer?Yes, this offer is valid for new subscriptions. If you would like to adjust your existing UPC mobile subscription, call us at0800 663 366so that we can provide personal advice.Which countries do you mean by «almost all of Europe»?For \"almost all of Europe\", the following European countries are included: Åland Islands, Andorra, Austria, Belgium, Bulgaria, Croatia, Cyprus, Czech Republic, Denmark, Estonia, Faroe Islands, Finland, France, Germany, Gibraltar, Greece, Greenland, Guernsey, Hungary, Iceland, Ireland, Isle of Man, Italy, Jersey, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Norway, Netherlands, Poland, Portugal (incl. Madeira, Azores), Romania, San Marino, Slovakia, Slovenia, Spain (incl. Canary Islands, Balearic Islands), Svalbard and Jan Mayen, Sweden, Turkey, United Kingdom, and Vatican City. Overseas territories of the countries listed are excluded.Mobile phone subscription at half price and without contractual obligation: what's the catch?There's no catch for you! The \"Up Mobile Young\" subscriptions cost only half the regular price of \"Up Mobile\", excluding Up Mobile S Young. On top of that, you are not tied to a minimum contract term and can cancel at any time with 60 days' notice to the end of any month.Still have questions?Go to Help CenterSunrise onAbout SunriseCompanyAbout usMediaInvestor RelationsSustainabilityJobs & CareersLocationsDirect accessWhy Sunrise?Combo discountMy SunriseNetwork coverage mapMy billSwitching to SunriseBlogSunrise CommunityDiscover SunrisePromotions and dealsconnect mobile and 5G network testDevicesWorld of AppleAward winning digital TVRoaming - use your mobile phone abroadSunrise affiliate program (German)Recommend SunriseContactSales hotline: 0800 707 504Other contact optionsShop finderSunrise on©2025Sunrise GmbHSitemapData privacyLegal mattersImprintSitemapData privacyLegal mattersImprint©2025Sunrise GmbH"
        }
    },
    {
        "url": "https://www.sunrise.ch/en/mobile/mobile-subscription-airpodsmax",
        "data": {
            "title": "Mobile Subscriptions - Best Plans in Switzerland | Sunrise",
            "description": "Discover Sunrise mobile plans with unlimited 5G and top coverage. • Switch now from 29.90/mth and choose the perfect plan to fit your needs.",
            "body": "Mobile Subscriptions - Best Plans in Switzerland | SunrisePrivateBusinessPropertiesHelpShop finderSunrise MomentsSunrise mailSunrise cockpitENInternet & TVSUBSCRIPTIONSInternetInternet & TVData SIM / Extra SIMSAVE NOWSamsung TV giftedMySports – 6 months for freeHappy Women's Day: AirPods Max giftedRecommend Sunrise and earn up to 220.–MORE INFORMATIONSmart WiFi Extender​Sunrise TVSports PackagesConnect AppTV App & IPTVLandline TelephonyCyber SecuritySpeed UpgradeSunrise PayMobileSUBSCRIPTIONSMobileSunrise Young – for everyone under 27Data SIM / Extra SIMPrepaidRoamingOptionsSAVE NOWSwiss Travel+ mobile subscriptionHappy Women's Day: AirPods Max giftedRecommend Sunrise and earn up to 220.–MORE INFORMATION5G NetworkWi-Fi CallingCyber SecurityChange my Sunrise subscriptionSunrise PayCombi subscriptionDevicesDEVICESSmartphonesWorld of AppleWorld of SamsungTabletsSmartwatchesAccessoriesHOME & ENTERTAINMENTTVs & projectorsComputersGamingHIGHLIGHTSNew: iPhone 16eFlex Premium BundleSmart UpgradeFlex UpgradeBuybackSunrise PayYoungTop DealsSales HotlineMy SunriseENMy SunriseInternet & TVSubscriptionsInternetInternet & TVData SIM / Extra SIMSave nowSamsung TV giftedMySports – 6 months for freeHappy Women's Day: AirPods Max giftedRecommend Sunrise and earn up to 220.–More InformationSmart WiFi Extender​Sunrise TVSports PackagesConnect AppTV App & IPTVLandline TelephonyCyber SecuritySpeed UpgradeSunrise PayMobileSubscriptionsMobileSunrise Young – for everyone under 27Data SIM / Extra SIMPrepaidRoamingOptionsSave nowSwiss Travel+ mobile subscriptionHappy Women's Day: AirPods Max giftedRecommend Sunrise and earn up to 220.–More Information5G NetworkWi-Fi CallingCyber SecurityChange my Sunrise subscriptionSunrise PayCombi subscriptionDevicesDevicesSmartphonesWorld of AppleWorld of SamsungTabletsSmartwatchesAccessoriesHome & EntertainmentTVs & projectorsComputersGamingHighlightsNew: iPhone 16eFlex Premium BundleSmart UpgradeFlex UpgradeBuybackSunrise PayYoungTop DealsPrivateBusinessPropertiesHelpShop finderSunrise MomentsSunrise mailSunrise cockpitLog in to My Sunrise for exclusive dealsLog inHappy Women's DayYOU DESERVE MORE THAN FLOWERSWith Up Mobile L from 60.95/monthSwitch to Sunrise nowChoose your mobile plan and take advantage of our special offer now to get the Apple AirPods Max as a gift.Terms and conditions for AirPods Max OfferWith a new subscription to Up Mobile L or XL (60.95/month, minimum contract period 24 months) or Up Home L or XL (73.20/month, minimum contract period 36 months), Apple AirPods Max in colors Starlight, Midnight or Purple worth 499.– are included.Offer valid while supplies last. Activation fee excluded. Subject to changes.Highlights AirPods Max:The ultimate over-ear personal listening experience — now in fresh new colors.High-fidelity sound. Exhilarating audio with deep bass, expansive mids, and crisp highs.Pro-level Active Noise Cancellation.1Removes unwanted noise so you can immerse yourself in the music.Over-ear design. From canopy to cushion, built for unequaled fit and comfort.USB‑C. Charging is fast and easy with the one‑cable convenience of USB‑C.Change my current Sunrise subscriptionYour benefits with SunriseSurf and call abroadstress free with our roaming options50% offeach additional Up Mobile subscriptionExclusive discounts and VIP accesson events with Sunrise MomentsAward-winning networkrated as «Outstanding» for the 9th year in a rowWe handle the switch for youOrderSimply order online and, if desired, keep your old phone number - We'll cancel your old contract for you.Find out moreActivationWe'll send you a confirmation and your new SIM card, activated on the transfer date.Welcome on BoardIt's that easy! Start surfing and making calls on our top-notch, award-winning network from the transfer date.COMBINE WITH INTERNET & ENJOY THE BENEFITSTo the bundleOutstanding networkBEST MOBILE TELEPHONY, MOST RELIABLE DATA CONNECTIONSFrequently asked questionsI want to change my provider. How can I keep my current mobile number?Here are the five steps required to keep your number. It only takes two minutes!1. Enter three details about your current contract2. We’ll handle the processing3. You get a confirmation by SMS or email4. Authorise us to cancel your current contract5. You take your number with you on the notified dayMore detailsNeed help with the details of your current mobile subscription?Simply text INFO to 503 for freeand find out:From which date your free number transfer is availableWhich fees apply in case of an immediate transferWho is the legal owner of your current mobile subscriptionI already have a mobile subscription from UPC and would like to sign up for another Up Mobile subscription. Can I take advantage of this offer?Yes, this offer is valid for new subscriptions. If you’d like to change your existing UPC mobile subscription, then call us on0800 66 88 66so that we can provide you with personal advice.Which countries are included?Swiss Travel+Unlimited data and calls in:Switzerland, Germany, Italy, France, Spain (incl. Canary Islands and Balearic Islands), Portugal (incl. Madeira and Azores), Austria, Liechtenstein and Greece. Overseas territories of the countries listed are excluded.3 GB data per month in:Åland Islands, Andorra, Belgium, Bulgaria, Canada, Croatia, Cyprus, Czech Republic, Denmark, Estonia, Faroe Islands, Finland, Gibraltar, Greenland, Guernsey, Hungary, Iceland, Ireland, Isle of Man, Jersey, Latvia, Lithuania, Luxembourg, Malta, Monaco, Netherlands, Norway, Poland, Puerto Rico, Romania, San Marino, Sweden, Slovakia, Slovenia, Svalbard and Jan Mayen, Turkey, United Kingdom, United States (USA). Overseas territories of the countries listed are excluded.Up Mobile L and XLUnlimited data and calls in:Åland Islands, Andorra, Austria, Belgium, Bulgaria, Croatia, Cyprus, Czech Republic, Denmark, Estonia, Faroe Islands, Finland, France, Germany, Gibraltar, Greece, Greenland, Guernsey, Hungary, Iceland, Ireland, Isle of Man, Italy, Jersey, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Norway, Netherlands, Poland, Portugal (incl. Madeira, Azores), Romania, San Marino, Slovakia, Slovenia, Spain (incl. Canary Islands, Balearic Islands), Svalbard and Jan Mayen, Sweden, Turkey, United Kingdom, and Vatican City. Overseas territories of the countries listed are excluded.Are there any roaming-data packages for other countries that are not included?Yes, you can benefit from our attractive roaming-data packages. For more information, please visitsunrise.ch/en/roaming.Is there a family discount?Yes, when you purchase a mobile subscription, you’ll receive a permanent 50% discount on each additional Up Mobile subscription.Is there an activation fee?No, the activation fee of 59.90 is waived when purchasing online.What is surf protect?Surf protect is included free of charge with Up Mobile M, L and XL and offers protection while surfing the mobile network. The application checks whether websites pose a threat and prevents malware from being transmitted.What is an eSIM and how does it work?The eSIM replaces the physical SIM card and simply lets you use other phone numbers with the same smartphone (dual SIM mode).An eSIM chip is permanently integrated into your device and receives all the information you need from your eSIM profile.Still have questions?Go to Help CenterSunrise onAbout SunriseCompanyAbout usMediaInvestor RelationsSustainabilityJobs & CareersLocationsDirect accessWhy Sunrise?Combo discountMy SunriseNetwork coverage mapMy billSwitching to SunriseBlogSunrise CommunityDiscover SunrisePromotions and dealsconnect mobile and 5G network testDevicesWorld of AppleAward winning digital TVRoaming - use your mobile phone abroadSunrise affiliate program (German)Recommend SunriseContactSales hotline: 0800 707 504Other contact optionsShop finderSunrise on©2025Sunrise GmbHSitemapData privacyLegal mattersImprintSitemapData privacyLegal mattersImprint©2025Sunrise GmbH"
        }
    },
    {
        "url": "https://www.sunrise.ch/en/mobile/5g-network",
        "data": {
            "title": "5G Network | Sunrise",
            "description": "Sunrise offers you the best 5G coverage.",
            "body": "5G Network | SunrisePrivateBusinessPropertiesHelpShop finderSunrise MomentsSunrise mailSunrise cockpitENInternet & TVSUBSCRIPTIONSInternetInternet & TVData SIM / Extra SIMSAVE NOWSamsung TV giftedMySports – 6 months for freeHappy Women's Day: AirPods Max giftedRecommend Sunrise and earn up to 220.–MORE INFORMATIONSmart WiFi Extender​Sunrise TVSports PackagesConnect AppTV App & IPTVLandline TelephonyCyber SecuritySpeed UpgradeSunrise PayMobileSUBSCRIPTIONSMobileSunrise Young – for everyone under 27Data SIM / Extra SIMPrepaidRoamingOptionsSAVE NOWSwiss Travel+ mobile subscriptionHappy Women's Day: AirPods Max giftedRecommend Sunrise and earn up to 220.–MORE INFORMATION5G NetworkWi-Fi CallingCyber SecurityChange my Sunrise subscriptionSunrise PayCombi subscriptionDevicesDEVICESSmartphonesWorld of AppleWorld of SamsungTabletsSmartwatchesAccessoriesHOME & ENTERTAINMENTTVs & projectorsComputersGamingHIGHLIGHTSNew: iPhone 16eFlex Premium BundleSmart UpgradeFlex UpgradeBuybackSunrise PayYoungTop DealsSales HotlineMy SunriseENMy SunriseInternet & TVSubscriptionsInternetInternet & TVData SIM / Extra SIMSave nowSamsung TV giftedMySports – 6 months for freeHappy Women's Day: AirPods Max giftedRecommend Sunrise and earn up to 220.–More InformationSmart WiFi Extender​Sunrise TVSports PackagesConnect AppTV App & IPTVLandline TelephonyCyber SecuritySpeed UpgradeSunrise PayMobileSubscriptionsMobileSunrise Young – for everyone under 27Data SIM / Extra SIMPrepaidRoamingOptionsSave nowSwiss Travel+ mobile subscriptionHappy Women's Day: AirPods Max giftedRecommend Sunrise and earn up to 220.–More Information5G NetworkWi-Fi CallingCyber SecurityChange my Sunrise subscriptionSunrise PayCombi subscriptionDevicesDevicesSmartphonesWorld of AppleWorld of SamsungTabletsSmartwatchesAccessoriesHome & EntertainmentTVs & projectorsComputersGamingHighlightsNew: iPhone 16eFlex Premium BundleSmart UpgradeFlex UpgradeBuybackSunrise PayYoungTop DealsPrivateBusinessPropertiesHelpShop finderSunrise MomentsSunrise mailSunrise cockpitAll about our high-speed networkSUNRISE OFFERS YOU THE BEST 5G COVERAGEWhat is 5G?5G makes mobile data up to 100x faster. Perfect for surfing, streaming and cloud gaming, for example. But there's much more to it than that - discover all the benefits now.5G benefits at a glanceUltra-fast response timesAccess the content of your favorite apps immediately - without waiting!Maximum speedDownload your favorite movies in seconds and enjoy them anywhere.Expanded capacityWith 5G, you and your family can stream at the same time - without losing speed.Sunrise 5G coverage in SwitzerlandSunrise has the most deployed 5G network in the country.As a result, our 5G internet services also enable ultra-fast connections for homes and businesses in areas where there is no fiber connection.The Sunrise 5G universe5G at homeGigabit internet is available now in even more areas.Check availability5G on the goData subscriptions tailored for your SIM-enabled devices.Discover our offers5G devicesCheck out the latest 5G devices for the highest speeds.Discover our devicesPrepaid 5GFind your perfect prepaid offer with 5G high-speed.Discover our offersHave more questions?Go to Help CenterSunrise onAbout SunriseCompanyAbout usMediaInvestor RelationsSustainabilityJobs & CareersLocationsDirect accessWhy Sunrise?Combo discountMy SunriseNetwork coverage mapMy billSwitching to SunriseBlogSunrise CommunityDiscover SunrisePromotions and dealsconnect mobile and 5G network testDevicesWorld of AppleAward winning digital TVRoaming - use your mobile phone abroadSunrise affiliate program (German)Recommend SunriseContactSales hotline: 0800 707 504Other contact optionsShop finderSunrise on©2025Sunrise GmbHSitemapData privacyLegal mattersImprintSitemapData privacyLegal mattersImprint©2025Sunrise GmbH"
        }
    },
    {
        "url": "https://www.sunrise.ch/en/mobile/wifi-calling",
        "data": {
            "title": "WiFi Calling: Better reception in enclosed spaces | Sunrise",
            "description": "Wi-Fi Calling improves your mobile phone reception in enclosed spaces by using a WLAN connection.",
            "body": "WiFi Calling: Better reception in enclosed spaces | SunrisePrivateBusinessPropertiesHelpShop finderSunrise MomentsSunrise mailSunrise cockpitENInternet & TVSUBSCRIPTIONSInternetInternet & TVData SIM / Extra SIMSAVE NOWSamsung TV giftedMySports – 6 months for freeHappy Women's Day: AirPods Max giftedRecommend Sunrise and earn up to 220.–MORE INFORMATIONSmart WiFi Extender​Sunrise TVSports PackagesConnect AppTV App & IPTVLandline TelephonyCyber SecuritySpeed UpgradeSunrise PayMobileSUBSCRIPTIONSMobileSunrise Young – for everyone under 27Data SIM / Extra SIMPrepaidRoamingOptionsSAVE NOWSwiss Travel+ mobile subscriptionHappy Women's Day: AirPods Max giftedRecommend Sunrise and earn up to 220.–MORE INFORMATION5G NetworkWi-Fi CallingCyber SecurityChange my Sunrise subscriptionSunrise PayCombi subscriptionDevicesDEVICESSmartphonesWorld of AppleWorld of SamsungTabletsSmartwatchesAccessoriesHOME & ENTERTAINMENTTVs & projectorsComputersGamingHIGHLIGHTSNew: iPhone 16eFlex Premium BundleSmart UpgradeFlex UpgradeBuybackSunrise PayYoungTop DealsSales HotlineMy SunriseENMy SunriseInternet & TVSubscriptionsInternetInternet & TVData SIM / Extra SIMSave nowSamsung TV giftedMySports – 6 months for freeHappy Women's Day: AirPods Max giftedRecommend Sunrise and earn up to 220.–More InformationSmart WiFi Extender​Sunrise TVSports PackagesConnect AppTV App & IPTVLandline TelephonyCyber SecuritySpeed UpgradeSunrise PayMobileSubscriptionsMobileSunrise Young – for everyone under 27Data SIM / Extra SIMPrepaidRoamingOptionsSave nowSwiss Travel+ mobile subscriptionHappy Women's Day: AirPods Max giftedRecommend Sunrise and earn up to 220.–More Information5G NetworkWi-Fi CallingCyber SecurityChange my Sunrise subscriptionSunrise PayCombi subscriptionDevicesDevicesSmartphonesWorld of AppleWorld of SamsungTabletsSmartwatchesAccessoriesHome & EntertainmentTVs & projectorsComputersGamingHighlightsNew: iPhone 16eFlex Premium BundleSmart UpgradeFlex UpgradeBuybackSunrise PayYoungTop DealsPrivateBusinessPropertiesHelpShop finderSunrise MomentsSunrise mailSunrise cockpitSunrise Wi-Fi CallingDO YOU WANT BETTER RECEPTION? WE HAVE THE SOLUTIONWith Wi-Fi Calling, you can make good-quality calls even when there’s limited mobile receptionBetter reception indoorsMake calls and send SMS as usual – without the need to download any other appsNo additional costsFrequently asked questionsWhat is Wi-Fi Calling?Wi-Fi Calling allows you to make calls via an existing Wi-Fi network, regardless of whether you’ve got mobile reception, and that can improve the call quality, while also keeping you available in areas with poor mobile reception, for example.Enabling Wi-Fi Calling on an Apple deviceHow to enable Wi-Fi Calling on an Apple device in just a few steps:Go to the main menu on your iPhone or iPad and open «Settings».Scroll down and tap «Phone».Then select «Wi-Fi Calls».This should give you the option to enable Wi-Fi calls. If you’re using more than one SIM, select which SIM you want to use to make Wi-Fi calls.Swipe the switch to the right to enable it.You may receive a confirmation or an activation message that you’ll need to confirm. Simply follow the instructions on the screen.There may be small differences depending on what device you’re using and the software it’s running on.Did it not work or is your model not listed? No problem, you’ll find step-by-step instructions underHelp and Support.Enabling Wi-Fi Calling on a Samsung deviceFollow these steps to enable Wi-Fi Calling on a Samsung mobile:Open the phone app and tap the icon for more options (three vertical dots at the top right).Tap on Settings.Scroll to Wi-Fi Calls and enable the slider.You can enable Wi-Fi Calls via quick access as well. To do this, swipe down from the top of the screen and tap the Wi-Fi Calling icon.There may be small differences depending on what device you’re using and the software it’s running on.Did it not work or is your model not listed? No problem, you’ll find step-by-step instructions underHelp and Support.Wi-Fi Calling abroad?Currently, Wi-Fi Calling can only be used on Wi-Fi networks in Switzerland (no roaming available).How much does Wi-Fi Calling cost?Calls and SMS will be billed at your current rate.Wi-Fi Calling isn’t workingThere are a number of reasons why Wi-Fi Calling may not be working. Here are some possible solutions to the problem:- Check your Wi-Fi connection and make sure the Wi-Fi network you’re connected to is working. Also check whether other devices are able to establish a connection to the Wi-Fi.- Is Wi-Fi Calling enabled? Make sure Wi-Fi Calling is enabled in your device settings.- Check whether your device supports Wi-Fi Calling as older devices in particular may not support it. You’ll find a selection of current devices that support Wi-Fi Calling here. (Link to the here)- Update your device software and make sure you’ve installed the latest version of the software. Sometimes Wi-Fi Calling features are introduced or enhanced in software updates, so a software update may fix the problem.For more support, please visit ourHelp and Supportpage. In thefactsheetalso contains important information.More questions?Visit our Help CenterMore information about the Sunrise networkSunrise 5G coverageYour coverage on the Sunrise mobile broadband network in Switzerland.Go to mapDiscover My SunriseControl your costs, manage all your products and activate options.Go to My SunriseOur awardsHere's what independent experts say about Sunrise.Learn moreSunrise onAbout SunriseCompanyAbout usMediaInvestor RelationsSustainabilityJobs & CareersLocationsDirect accessWhy Sunrise?Combo discountMy SunriseNetwork coverage mapMy billSwitching to SunriseBlogSunrise CommunityDiscover SunrisePromotions and dealsconnect mobile and 5G network testDevicesWorld of AppleAward winning digital TVRoaming - use your mobile phone abroadSunrise affiliate program (German)Recommend SunriseContactSales hotline: 0800 707 504Other contact optionsShop finderSunrise on©2025Sunrise GmbHSitemapData privacyLegal mattersImprintSitemapData privacyLegal mattersImprint©2025Sunrise GmbH"
        }
    },
    {
        "url": "https://www.sunrise.ch/en/mobile/flex-premium-bundle",
        "data": {
            "title": "Flex Premium Bundle | Sunrise",
            "description": "Always have the latest mobile and pay half the subscription price – forever",
            "body": "Flex Premium Bundle | SunrisePrivateBusinessPropertiesHelpShop finderSunrise MomentsSunrise mailSunrise cockpitENInternet & TVSUBSCRIPTIONSInternetInternet & TVData SIM / Extra SIMSAVE NOWSamsung TV giftedMySports – 6 months for freeHappy Women's Day: AirPods Max giftedRecommend Sunrise and earn up to 220.–MORE INFORMATIONSmart WiFi Extender​Sunrise TVSports PackagesConnect AppTV App & IPTVLandline TelephonyCyber SecuritySpeed UpgradeSunrise PayMobileSUBSCRIPTIONSMobileSunrise Young – for everyone under 27Data SIM / Extra SIMPrepaidRoamingOptionsSAVE NOWSwiss Travel+ mobile subscriptionHappy Women's Day: AirPods Max giftedRecommend Sunrise and earn up to 220.–MORE INFORMATION5G NetworkWi-Fi CallingCyber SecurityChange my Sunrise subscriptionSunrise PayCombi subscriptionDevicesDEVICESSmartphonesWorld of AppleWorld of SamsungTabletsSmartwatchesAccessoriesHOME & ENTERTAINMENTTVs & projectorsComputersGamingHIGHLIGHTSNew: iPhone 16eFlex Premium BundleSmart UpgradeFlex UpgradeBuybackSunrise PayYoungTop DealsSales HotlineMy SunriseENMy SunriseInternet & TVSubscriptionsInternetInternet & TVData SIM / Extra SIMSave nowSamsung TV giftedMySports – 6 months for freeHappy Women's Day: AirPods Max giftedRecommend Sunrise and earn up to 220.–More InformationSmart WiFi Extender​Sunrise TVSports PackagesConnect AppTV App & IPTVLandline TelephonyCyber SecuritySpeed UpgradeSunrise PayMobileSubscriptionsMobileSunrise Young – for everyone under 27Data SIM / Extra SIMPrepaidRoamingOptionsSave nowSwiss Travel+ mobile subscriptionHappy Women's Day: AirPods Max giftedRecommend Sunrise and earn up to 220.–More Information5G NetworkWi-Fi CallingCyber SecurityChange my Sunrise subscriptionSunrise PayCombi subscriptionDevicesDevicesSmartphonesWorld of AppleWorld of SamsungTabletsSmartwatchesAccessoriesHome & EntertainmentTVs & projectorsComputersGamingHighlightsNew: iPhone 16eFlex Premium BundleSmart UpgradeFlex UpgradeBuybackSunrise PayYoungTop DealsPrivateBusinessPropertiesHelpShop finderSunrise MomentsSunrise mailSunrise cockpitFlex Premium BundleAlways the latest smartphone, half the subscription price – foreverFor everyone, existing and new customers.Always have the latest mobileWith Flex Upgrade, exchange your phone anytime.Find out more50% off your subscription, foreverHalf price on Up Mobile M, L, or XL.Find out moreDamage and theft insuranceAdditional for iPhone: AppleCare Services and iCloud+ included.Find out moreCreate your personal bundleSelect your subscription and device from the dropdown menu.For existing customers: Migrate your subscription in the next step and get a 50% lifetime discount on your Up Mobile with the Flex Premium Bundle.Conditions for the Flex Premium BundleConditions for Up MobileThe 50% discount on the base fee of the mobile subscription is granted on the condition that an active device plan with the Flex Upgrade option is maintained.The 50% discount will expire if (i) the device plan is terminated or the device is fully paid off and not replaced with a new device plan, and/or (ii) the Flex Upgrade option is terminated.The mobile subscription has a minimum contract duration of 24 months. If the subscription is terminated before the end of the minimum term, additional costs will apply.Conditions for the Device Plan with Smart UpgradeGet the iPhone with a 25% Smart Upgrade discount. The reduced price is then paid off in 24 monthly installments with a down payment of 1.-. If the iPhone is not exchanged after 24 months but kept, the remaining amount equivalent to the initially deducted Smart Upgrade discount must be paid. Upon request, this amount can be paid in 12 monthly installments.If the old iPhone is returned after 24 months and a new device plan is activated, the remaining amount does not need to be paid. The installment payment is interest- and fee-free.The conditions and further information about Smart Upgrade can be found atsunrise.ch/smartupgrade.Conditions for Flex UpgradeWith the Flex Upgrade option, it is possible to switch iPhones or replace a device plan with a new one at any time. It does not matter whether a cheaper or more expensive iPhone model is chosen. The monthly fee for Flex Upgrade depends on the price of the iPhone.The option includes damage and theft insurance for the smartphone, Apple Care services, and 50GB of iCloud.The Flex Upgrade option must be activated within 28 days of purchasing the device plan. After this period, the option can no longer be activated, resulting in the loss of the 50% discount on the mobile subscription.The conditions and further information about Flex Upgrade can be found atsunrise.ch/flex-upgrade.Flex Upgrade Bundle PriceThe indicated bundle price applies to a duration of 24 months. If the iPhone is exchanged using the Smart Upgrade or Flex Upgrade option during or after the 24-month period, the device plan installments and the price for Flex Upgrade may change depending on the value of the new device.If the Smart Upgrade option is not used after 24 months and the device is not exchanged, the remaining amount of the device plan becomes due. The bundle price is then reduced by removing the device plan installments, and the discount on the mobile subscription is forfeited.Additional conditionsFlex and Smart Upgrade customers who renew their device plan through one of the programs can also benefit from the Flex Premium Bundle. The condition is to have a mobile subscription with Up Mobile M, L, or XL. If another or older mobile subscription is already in place, migration to Up Mobile M, L, or XL is required.Promotion: Twice the memory spaceGet the latest Samsung and benefit from more storage for your money – with these unbeatable offers:Samsung Galaxy S25 512GB: Only 899.- instead of 999.- (100.- discount)Samsung Galaxy S25+ 512GB: Only 1049.- instead of 1149.- (100.- discount)Samsung Galaxy S25 Ultra 512GB: Only 1299.- instead of 1399.- (100.- discount)Samsung Galaxy S25 Ultra 1TB: Only 1399.- instead of 1599.- (200.- discount)Get the offer by March 16, 2025.Top price and many benefitsComparison to other providers using the example of the iPhone 16 Pro¹Price for iPhone 16 Pro 256 GB + Up Mobile L without Flex Premium Bundle (without Smart Upgrade and Flex Upgrade): 93.80/month for 24 months²The terms and conditions atsunrise.ch/smartupgradeapply³100 MB/mth. in World 1, World 2, Rest of the WorldCompare the latest offers from Swisscom and Salt on their websites.Frequently asked questionsGeneral InformationWho benefits from the Flex Premium Bundle and can existing customers also benefit?In principle, both new and existing customers can benefit. The conditions are:A mobile subscription with Up Mobile M, L, or XL. If you already have another or older mobile subscription, you must migrate to Up Mobile M, L, or XL. Any existing discounts will be removed and replaced with a new 50% discount on Up Mobile M, L, or XL. The only exclusions are customers who are in an ongoing contract with a promotion from which they have benefited from a gift (e.g., Samsung TV), welcome discount/cashback, or device plan promotion.A new device plan.The Flex Upgrade option.Can I, as an existing Flex or Smart Upgrade customer, also benefit from the Flex Premium Bundle?Flex and Smart Upgrade customers who renew their device plan with one of the programmes can also benefit from the Flex Premium Bundle. The condition is a mobile subscription with Up Mobile M, L, or XL. If you already have another or older mobile subscription, you must migrate to Up Mobile M, L, or XL.PricingHow is the price of the Flex Premium Bundle composed?The price of the Flex Premium Bundle is composed of the following components:Up Mobile M, L, or XL:Your mobile subscription with a 50% discount.Device plan:Either a 24-month device plan or Smart Upgrade.Flex Upgrade:Variable price depending on the smartphone - from CHF 7.50 per month.Can I already benefit from the Flex Premium Bundle if the smartphone is not in stock?Yes, the Flex Premium Bundle is activated immediately with your order, regardless of whether the smartphone is available. You benefit immediately or from the end of the month from a 50% discount on your Up Mobile subscription. As soon as the smartphone is delivered, we will charge you the monthly rate for the device and Flex Upgrade. From this point, you have 24 months to renew your device plan to continue benefiting from the Flex Premium Bundle.How long do I get the subscription at half price?The 50% discount on Up Mobile M, L, or XL is guaranteed as long as the subscription and an associated device plan with Flex Upgrade are active. If Flex Upgrade is cancelled or the device plan is fully paid off, the 50% discount also expires. As soon as the smartphone is delivered, we will charge you the monthly rate for the device and Flex Upgrade. From this point, you have 24 months to renew your device plan to continue benefiting from the Flex Premium Bundle.Flex Upgrade and Smart UpgradeCan I continue to benefit from the Flex Premium Bundle if I activate Flex Upgrade within 28 days of purchasing my smartphone?Yes, you can continue to benefit from the Flex Premium Bundle if you activate Flex Upgrade within 28 days of receiving your smartphone by phone or in one of our shops.What happens to the Flex Premium Bundle if I choose to finance the remaining amount over an additional 12 months in month 24 with Smart Upgrade?If you choose to extend your device plan to 36 months with Smart Upgrade, you will continue to benefit from the Flex Premium Bundle. At the latest, at the end of month 36, the device plan must be renewed, otherwise, you will lose the benefits of the Flex Premium Bundle.Device Change and RenewalCan I switch to a more expensive or cheaper device? What happens to my instalments?With the Flex Premium Bundle, you have the freedom to choose. You can switch to a cheaper or more expensive device. The monthly device price and the Flex Upgrade fee are calculated based on the sale price (without discounts) of the new device.What happens if I renew my device plan with the Flex Premium Bundle?Renewal with Flex Upgrade:Your current device plan will be cancelled and all outstanding payments (including the final instalment in the case of Smart Upgrade) will be waived.A new device plan will be created, and you will benefit again from the Flex Premium Bundle.You must return your old device within 14 days of receiving the new device to a Sunrise shop or send it back with the prepaid return package. Otherwise, all outstanding payments of the device plan (including the final instalment in the case of Smart Upgrade) will be charged to you.The device plan renewal process cannot be cancelled or reversed.Early or full repayment:You can pay off your device in full or early and choose a new device plan.You will benefit again from the Flex Premium Bundle.In both cases, the Flex Premium Bundle is renewed with a 24-month contract commitment.Repair and ExchangeAre repairs with Flex Upgrade free of charge / what is the excess?For repairs, an excess of CHF 50.- to CHF 150.- is charged, depending on the sale price (without discounts) of your device:Device price up to CHF 899: CHF 50.-Device price from CHF 900 to 1399: CHF 100.-Device price from CHF 1400 to 2500: CHF 150.-The amount will be charged on your next Sunrise bill. Detailed information can be foundhere.Can I exchange my smartphone with Flex Upgrade if it is damaged?In case of damage, you have the choice: upgrade to a new device of your choice or have your current device repaired or replaced by the insurance. iPhones can be repaired via AppleCare Services. In all cases, CHF 50.- to CHF 150.- will be charged, depending on the sale price (without discounts) of your device:Device price up to CHF 899: CHF 50.-Device price from CHF 900 to 1399: CHF 100.-Device price from CHF 1400 to 2500: CHF 150.-Detailed information can be foundhere.What happens in case of theft with Flex Upgrade?In case of theft, you have the choice: upgrade to a new device of your choice, in which case a new device plan will be installed and you will benefit again from the Flex Premium Bundle, or have your current device replaced by the insurance. In both cases, CHF 50.- to CHF 150.- will be charged, depending on the sale price (without discounts) of your device:Device price up to CHF 899: CHF 50.-Device price from CHF 900 to 1399: CHF 100.-Device price from CHF 1400 to 2500: CHF 150.-Detailed information can be foundhere.Still have questions?Go to Help CenterSunrise onAbout SunriseCompanyAbout usMediaInvestor RelationsSustainabilityJobs & CareersLocationsDirect accessWhy Sunrise?Combo discountMy SunriseNetwork coverage mapMy billSwitching to SunriseBlogSunrise CommunityDiscover SunrisePromotions and dealsconnect mobile and 5G network testDevicesWorld of AppleAward winning digital TVRoaming - use your mobile phone abroadSunrise affiliate program (German)Recommend SunriseContactSales hotline: 0800 707 504Other contact optionsShop finderSunrise on©2025Sunrise GmbHSitemapData privacyLegal mattersImprintSitemapData privacyLegal mattersImprint©2025Sunrise GmbH"
        }
    },
    {
        "url": "https://www.sunrise.ch/en/general/sunrise-products/connect-mobilnetz-test",
        "data": {
            "title": "Connect Mobilnetz Test",
            "description": "Connect Mobilnetz Test",
            "body": "Connect Mobilnetz TestPrivateBusinessPropertiesHelpShop finderSunrise MomentsSunrise mailSunrise cockpitENInternet & TVSUBSCRIPTIONSInternetInternet & TVData SIM / Extra SIMSAVE NOWSamsung TV giftedMySports – 6 months for freeHappy Women's Day: AirPods Max giftedRecommend Sunrise and earn up to 220.–MORE INFORMATIONSmart WiFi Extender​Sunrise TVSports PackagesConnect AppTV App & IPTVLandline TelephonyCyber SecuritySpeed UpgradeSunrise PayMobileSUBSCRIPTIONSMobileSunrise Young – for everyone under 27Data SIM / Extra SIMPrepaidRoamingOptionsSAVE NOWSwiss Travel+ mobile subscriptionHappy Women's Day: AirPods Max giftedRecommend Sunrise and earn up to 220.–MORE INFORMATION5G NetworkWi-Fi CallingCyber SecurityChange my Sunrise subscriptionSunrise PayCombi subscriptionDevicesDEVICESSmartphonesWorld of AppleWorld of SamsungTabletsSmartwatchesAccessoriesHOME & ENTERTAINMENTTVs & projectorsComputersGamingHIGHLIGHTSNew: iPhone 16eFlex Premium BundleSmart UpgradeFlex UpgradeBuybackSunrise PayYoungTop DealsSales HotlineMy SunriseENInternet & TVSubscriptionsInternetInternet & TVData SIM / Extra SIMSave nowSamsung TV giftedMySports – 6 months for freeHappy Women's Day: AirPods Max giftedRecommend Sunrise and earn up to 220.–More InformationSmart WiFi Extender​Sunrise TVSports PackagesConnect AppTV App & IPTVLandline TelephonyCyber SecuritySpeed UpgradeSunrise PayMobileSubscriptionsMobileSunrise Young – for everyone under 27Data SIM / Extra SIMPrepaidRoamingOptionsSave nowSwiss Travel+ mobile subscriptionHappy Women's Day: AirPods Max giftedRecommend Sunrise and earn up to 220.–More Information5G NetworkWi-Fi CallingCyber SecurityChange my Sunrise subscriptionSunrise PayCombi subscriptionDevicesDevicesSmartphonesWorld of AppleWorld of SamsungTabletsSmartwatchesAccessoriesHome & EntertainmentTVs & projectorsComputersGamingHighlightsNew: iPhone 16eFlex Premium BundleSmart UpgradeFlex UpgradeBuybackSunrise PayYoungTop DealsPrivateBusinessPropertiesHelpShop finderSunrise MomentsSunrise mailSunrise cockpitONCE AGAIN «OUTSTANDING»Best mobile services. Most reliable data connections.The award-winning Sunrise mobile network offers the highest quality. The Sunrise mobile network has been awarded the rating «outstanding» nine times in a rowIt’s the most important and most recognised mobile-network comparison – the connect mobile network test. In its latest edition (issue 01/2025), the telecom journal has again rated the Sunrise mobile network «OUTSTANDING». According to connect, Sunrise offers the best mobile services, the most reliable data connections, the largest 5G network* and the highest-quality coverage in Switzerland. With 973 out of a maximum of 1,000 points, the Sunrise mobile network is one of the top ten mobile networks in the world according to connect.*When it comes to the specific 5G frequencies, without Dynamic Spectrum Sharing (DSS).The connect mobile network test (issue 01/2025) shows:Best mobile servicesSunrise wins in the «Voice» category, offering the best mobile services in Switzerland, with the shortest call-connection times and the best voice-transmission quality.Most reliable data connectionsWhen it comes to the quality of data connections that customers use every single day, Sunrise received the highest score. Sunrise also offers the highest-quality mobile broadband coverage.Outstanding network for many yearsThe top performance and quality of the Sunrise mobile network are no coincidence. Sunrise invests continuously in the development of its network, which is the only network in Switzerland to have been rated «OUTSTANDING» nine times in a row.Top 10 worldwideMobile networks around the world are tested to the connect standard. The Sunrise mobile network’s quality and performance place it in the top ten globally.Largest 5G networkSunrise remains at the forefront and continues to offer the largest 5G network* in Switzerland.12«The fastest and most reliable connections provide the backbone for daily digital life – for business and people. The superior quality of the Sunrise network has been recognised once again. We’re the only Swiss provider to have raised our game at the highest level, winning in important categories. This puts us in the top ten of the best and highest-performing mobile networks in the world.»​André Krause, CEO Sunrise​Results from Connect MeasurementsWant to know more  about the connect mobile network test?You’ll find the online reporthere, or you can read the report as a PDF.View reportThe Sunrise 5G networkSunrise provides 79% of the Swiss population with high-speed 5G (up to 2 Gbit/s) and over 99% of the Swiss population with basic 5G (up to 1 Gbit/s). An up-to-date coverage map with a location and address search function can be found here.Check availabilityAll you need to know about 5GLearn moreSunrise onAbout SunriseCompanyAbout usMediaInvestor RelationsSustainabilityJobs & CareersLocationsDirect accessWhy Sunrise?Combo discountMy SunriseNetwork coverage mapMy billSwitching to SunriseBlogSunrise CommunityDiscover SunrisePromotions and dealsconnect mobile and 5G network testDevicesWorld of AppleAward winning digital TVRoaming - use your mobile phone abroadSunrise affiliate program (German)Recommend SunriseContactSales hotline: 0800 707 504Other contact optionsShop finderSunrise on©2025Sunrise GmbHSitemapData privacyLegal mattersImprintSitemapData privacyLegal mattersImprint©2025Sunrise GmbH"
        }
    },
    {
        "url": "https://www.sunrise.ch/en/blog/2025/kick-off-2025-the-top-three-games-for-your-smartphone",
        "data": {
            "title": "Kick-off 2025: the top three games for your smartphone",
            "description": "Whether waiting or commuting, a good mobile game is the perfect pastime. Discover our top 3 games for Apple and Android devices this year!",
            "body": "Kick-off 2025: the top three games for your smartphonePrivateBusinessPropertiesHelpShop finderSunrise MomentsSunrise mailSunrise cockpitENInternet & TVSUBSCRIPTIONSInternetInternet & TVData SIM / Extra SIMSAVE NOWSamsung TV giftedEasy Internet from 49.90/monthRecommend Sunrise and earn up to 220.–MORE INFORMATIONSmart WiFi Extender​Sunrise TVSports PackagesConnect AppTV App & IPTVLandline TelephonyCyber SecuritySpeed UpgradeSunrise PayMobileSUBSCRIPTIONSMobileSunrise Young – for everyone under 27Data SIM / Extra SIMPrepaidRoamingOptionsSAVE NOWSwiss Travel+ mobile subscriptionRecommend Sunrise and earn up to 220.–MORE INFORMATION5G NetworkWi-Fi CallingCyber SecurityChange my Sunrise subscriptionSunrise PayCombi subscriptionDevicesDEVICESSmartphonesWorld of AppleWorld of SamsungTabletsSmartwatchesAccessoriesHOME & ENTERTAINMENTTVs & projectorsComputersGamingHIGHLIGHTSNew: iPhone 16eApple DaysFlex Premium BundleSmart UpgradeFlex UpgradeBuybackSunrise PayYoungTop DealsSales HotlineMy SunriseENMy SunriseInternet & TVSubscriptionsInternetInternet & TVData SIM / Extra SIMSave nowSamsung TV giftedEasy Internet from 49.90/monthRecommend Sunrise and earn up to 220.–More InformationSmart WiFi Extender​Sunrise TVSports PackagesConnect AppTV App & IPTVLandline TelephonyCyber SecuritySpeed UpgradeSunrise PayMobileSubscriptionsMobileSunrise Young – for everyone under 27Data SIM / Extra SIMPrepaidRoamingOptionsSave nowSwiss Travel+ mobile subscriptionRecommend Sunrise and earn up to 220.–More Information5G NetworkWi-Fi CallingCyber SecurityChange my Sunrise subscriptionSunrise PayCombi subscriptionDevicesDevicesSmartphonesWorld of AppleWorld of SamsungTabletsSmartwatchesAccessoriesHome & EntertainmentTVs & projectorsComputersGamingHighlightsNew: iPhone 16eApple DaysFlex Premium BundleSmart UpgradeFlex UpgradeBuybackSunrise PayYoungTop DealsPrivateBusinessPropertiesHelpShop finderSunrise MomentsSunrise mailSunrise cockpitBack to blog overviewKick-off 2025: the top three games for your smartphoneWhether you’re waiting for an appointment or commuting on the train, there’s no better way to while away the time than playing a fun game on your mobile. If you’re bored of all the old ones and looking for something new in 2025, we’ve got you covered, with our top three games for Apple and Android devices.Roger Sieber, netfabrix GmbHFebruary 27, 2025.2 minutes read3rd place: Three Kingdoms Heroes (Apple Arcade)https://apps.apple.com/ch/app/three-kingdoms-heroes/id6448407603Category:StrategyDeveloper:Koei Tecmo GamesIn «Three Kingdoms Heroes», you’re a Chinese warlord from a distant past and going into battle. In turn-based duels, you have to manage your troops on an open battlefield. The basics are simple. But as with chess, and this game mirrors it in the soldiers’ various moves and assaults, it only becomes apparent as you play just how profound and tactical the whole thing actually is. In short: if you’re in the mood for relatively short, yet still authentic tactical battles in a Far Eastern setting, then we can highly recommend «Three Kingdoms Heroes»!2nd place: Cassette Beastshttps://apps.apple.com/ch/app/cassette-beasts/id6736517805https://play.google.com/store/search?q=Cassette%20Beasts&c=apps&hl=de_CHCategory:Pokémon-likeDeveloper:Raw FuryFancy a game like «Pokémon», but with a new twist? Then check out «Cassette Beasts»! You land on a mysterious island and make some friends just in time, moments before monsters attack you. You can catch and store them on old-school cassette tapes, so you can transform into them later if you want.«Cassette Beasts» offers the familiar «Pokémon» formula in a brand-new setting, with new ideas and more tactical options in combat. If you like «Pokémon» gameplay but are looking for some variety, you’ve come to the right place.1st place: Trials of Mana+ (Apple Arcade)https://apps.apple.com/ch/app/trials-of-mana/id6504607988Category:JRPG ClassicsDeveloper:Square EnixThe «Mana» series boasts a long and successful history. And while the first two parts were pretty successful and popular in Switzerland on the Game Boy and Super Nintendo, «Trials of Mana» wasn’t released in the West for almost a quarter of a century. Apple Arcade subscribers can now enjoy the spruced-up new edition presented in 3D.Typical of the genre, you set off on an epic adventure in which you choose three of six protagonists and experience a variety of adventures with them. Multiple play-throughs are well worth it. This is especially true for anyone who remembers the 90s, when «Trials of Mana+» used real-time combat game-play.While certain elements of the game could’ve been modernised, it seems like the developers wanted to retain the essence of the original and only modernise the presentation. Some might describe the game as a «blast from the past», and gamers with a yen for role-plays really mustn’t miss it. Our mobile game of the month!Link to YouTube video with the top 5 games to kick off 2025Recommended articlesSunrise onAbout SunriseCompanyAbout usMediaInvestor RelationsSustainabilityJobs & CareersLocationsDirect accessWhy Sunrise?Combo discountMy SunriseNetwork coverage mapMy billSwitching to SunriseBlogSunrise CommunityDiscover SunrisePromotions and dealsconnect mobile and 5G network testDevicesWorld of AppleAward winning digital TVRoaming - use your mobile phone abroadSunrise affiliate program (German)Recommend SunriseContactSales hotline: 0800 707 504Other contact optionsShop finderSunrise on©2025Sunrise GmbHSitemapData privacyLegal mattersImprintSitemapData privacyLegal mattersImprint©2025Sunrise GmbH"
        }
    },
    {
        "url": "https://www.sunrise.ch/en/mobile/roaming",
        "data": {
            "title": "Roaming | Sunrise",
            "description": "",
            "body": "Roaming | SunrisePrivateBusinessPropertiesHelpShop finderSunrise MomentsSunrise mailSunrise cockpitENInternet & TVSUBSCRIPTIONSInternetInternet & TVData SIM / Extra SIMSAVE NOWSamsung TV giftedMySports – 6 months for freeHappy Women's Day: AirPods Max giftedRecommend Sunrise and earn up to 220.–MORE INFORMATIONSmart WiFi Extender​Sunrise TVSports PackagesConnect AppTV App & IPTVLandline TelephonyCyber SecuritySpeed UpgradeSunrise PayMobileSUBSCRIPTIONSMobileSunrise Young – for everyone under 27Data SIM / Extra SIMPrepaidRoamingOptionsSAVE NOWSwiss Travel+ mobile subscriptionHappy Women's Day: AirPods Max giftedRecommend Sunrise and earn up to 220.–MORE INFORMATION5G NetworkWi-Fi CallingCyber SecurityChange my Sunrise subscriptionSunrise PayCombi subscriptionDevicesDEVICESSmartphonesWorld of AppleWorld of SamsungTabletsSmartwatchesAccessoriesHOME & ENTERTAINMENTTVs & projectorsComputersGamingHIGHLIGHTSNew: iPhone 16eFlex Premium BundleSmart UpgradeFlex UpgradeBuybackSunrise PayYoungTop DealsSales HotlineMy SunriseENMy SunriseInternet & TVSubscriptionsInternetInternet & TVData SIM / Extra SIMSave nowSamsung TV giftedMySports – 6 months for freeHappy Women's Day: AirPods Max giftedRecommend Sunrise and earn up to 220.–More InformationSmart WiFi Extender​Sunrise TVSports PackagesConnect AppTV App & IPTVLandline TelephonyCyber SecuritySpeed UpgradeSunrise PayMobileSubscriptionsMobileSunrise Young – for everyone under 27Data SIM / Extra SIMPrepaidRoamingOptionsSave nowSwiss Travel+ mobile subscriptionHappy Women's Day: AirPods Max giftedRecommend Sunrise and earn up to 220.–More Information5G NetworkWi-Fi CallingCyber SecurityChange my Sunrise subscriptionSunrise PayCombi subscriptionDevicesDevicesSmartphonesWorld of AppleWorld of SamsungTabletsSmartwatchesAccessoriesHome & EntertainmentTVs & projectorsComputersGamingHighlightsNew: iPhone 16eFlex Premium BundleSmart UpgradeFlex UpgradeBuybackSunrise PayYoungTop DealsPrivateBusinessPropertiesHelpShop finderSunrise MomentsSunrise mailSunrise cockpitTRAVEL WORRY-FREE WITH SUNRISETariffs for mobile use abroadChoose your destinationSurf, make calls and SMS abroad: See at a glance which services are included in your tariff, how much mobile use costs in the country of your choice and what savings options you have.CountryChoose your mobile subscriptionMobile subscription or prepaid tariffMobile subscription or prepaid tariffI don't know my tariffFor detailed information, see Product Factsheet.Regions and zonesRoaming tariffsSelect the country you will travel to get the roaming fares.Roaming packages and optionsSelect the country you will travel to get the roaming fares.The data package or option is valid not only in the selected country but also in the other countries of the same region or zone.Countries within the same region or zoneView standard roaming ratesLearn more about VoLTE roamingMobile subscriptions with roaming includedOffer terms and conditionsOffer valid for new Up Mobile L and XL ordersIncluded for free:Activation fee (worth 59.90) and SIM card24 months minimum contract:After 24 months, you will pay the standard price and the subscription automatically converts into an open-ended contract with a 60-day notice period.Cancellation:Requires a 60-day notice. If cancelled before the end of the 24 months, monthly base fees for the remaining period must be paid in full.How much internet data are you using?To give you some idea of how much data some standard online activities use, we have some examples below.100 MBAn hour spent scrolling through Facebook would use up about 100 MB of mobile data.40 MBYou will be using about 2MB+ of data per three minute song, amounting to around 40MB per hour.0.5 GBNetflix automatic data usage setting will allow you to watch about 2h video for 0.5 GB.2 to 4 MBUploading photos uses 2 to 4 MB. Posting videos on Instagram uses twice that much data.Frequently asked questionsHow can I keep my current mobile number?Here are the five steps required to keep your number. It only takes two minutes!1. Enter three details about your current contract2. We’ll handle the processing3. You get a confirmation by SMS or email4. Authorise us to cancel your current contract5. You take your number with you on the notified dayMore detailsNeed help with the details of your current mobile subscription?Simply text INFO to 503 for freeand find out:From which date your free number transfer is availableWhich fees apply in case of an immediate transferWho is the legal owner of your current mobile subscriptionI already have a mobile subscription from UPC and would like to sign up for another Up Mobile subscription. Can I take advantage of this offer?Yes, this offer is valid for new subscriptions. If you’d like to change your existing UPC mobile subscription, then call us on0800 66 88 66so that we can provide you with personal advice.Which countries are included?Swiss Travel+Unlimited data and calls in:Switzerland, Germany, Italy, France, Spain (incl. Canary Islands and Balearic Islands), Portugal (incl. Madeira and Azores), Austria, Liechtenstein and Greece. Overseas territories of the countries listed are excluded.3 GB data per month in:Åland Islands, Andorra, Belgium, Bulgaria, Canada, Croatia, Cyprus, Czech Republic, Denmark, Estonia, Faroe Islands, Finland, Gibraltar, Greenland, Guernsey, Hungary, Iceland, Ireland, Isle of Man, Jersey, Latvia, Lithuania, Luxembourg, Malta, Monaco, Netherlands, Norway, Poland, Puerto Rico, Romania, San Marino, Sweden, Slovakia, Slovenia, Svalbard and Jan Mayen, Turkey, United Kingdom, United States (USA). Overseas territories of the countries listed are excluded.Up Mobile LUnlimited data and calls in:Åland Islands, Andorra, Austria, Belgium, Bulgaria, Croatia, Cyprus, Czech Republic, Denmark, Estonia, Faroe Islands, Finland, France, Germany, Gibraltar, Greece, Greenland, Guernsey, Hungary, Iceland, Ireland, Isle of Man, Italy, Jersey, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Norway, Netherlands, Poland, Portugal (incl. Madeira, Azores), Romania, San Marino, Slovakia, Slovenia, Spain (incl. Canary Islands, Balearic Islands), Svalbard and Jan Mayen, Sweden, Turkey, United Kingdom, and Vatican City. Overseas territories of the countries listed are excluded.Up Mobile XLUnlimited data and calls in:Åland Islands, Andorra, Austria, Belgium, Bulgaria, Croatia, Cyprus, Czech Republic, Denmark, Estonia, Faroe Islands, Finland, France, Germany, Gibraltar, Greece, Greenland, Guernsey, Hungary, Iceland, Ireland, Isle of Man, Italy, Jersey, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Norway, Netherlands, Poland, Portugal (incl. Madeira, Azores), Romania, San Marino, Slovakia, Slovenia, Spain (incl. Canary Islands, Balearic Islands), Svalbard and Jan Mayen, Sweden, Turkey, United Kingdom, and Vatican City. Overseas territories of the countries listed are excluded.Unlimited calls from Switzerland to:Åland Islands, Andorra, Austria, Belgium, Bulgaria, Croatia, Cyprus, Czech Republic, Denmark, Estonia, Faroe Islands, Finland, France, Germany, Gibraltar, Greece, Greenland, Guernsey, Hungary, Iceland, Ireland, Isle of Man, Italy, Jersey, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Norway, Netherlands, Poland, Portugal (incl. Madeira, Azores), Romania, San Marino, Slovakia, Slovenia, Spain (incl. Canary Islands, Balearic Islands), Svalbard and Jan Mayen, Sweden, United Kingdom, and Vatican City. Overseas territories of the countries listed are excluded.Are there any roaming-data packages for other countries that are not included?Yes, you can benefit from our attractive roaming-data packages. For more information, please visitsunrise.ch/en/roaming.Is there a family discount?Yes, when you purchase a mobile subscription, you’ll receive a permanent 50% discount on each additional Up Mobile subscription.Is there an activation fee?Yes, Swiss Travel has a one-time activation fee of 59.90.For Up Mobile and Up Mobile Young, the activation fee is waived if you purchase online.What is surf protect?Surf protect is included free of charge with Up Mobile M, L and XL and offers protection while surfing the mobile network. The application checks whether websites pose a threat and prevents malware from being transmitted.What is an eSIM and how does it work?The eSIM replaces the physical SIM card and simply lets you use other phone numbers with the same smartphone (dual SIM mode).An eSIM chip is permanently integrated into your device and receives all the information you need from your eSIM profile.Still have questions?Go to Help CenterSunrise onAbout SunriseCompanyAbout usMediaInvestor RelationsSustainabilityJobs & CareersLocationsDirect accessWhy Sunrise?Combo discountMy SunriseNetwork coverage mapMy billSwitching to SunriseBlogSunrise CommunityDiscover SunrisePromotions and dealsconnect mobile and 5G network testDevicesWorld of AppleAward winning digital TVRoaming - use your mobile phone abroadSunrise affiliate program (German)Recommend SunriseContactSales hotline: 0800 707 504Other contact optionsShop finderSunrise on©2025Sunrise GmbHSitemapData privacyLegal mattersImprintSitemapData privacyLegal mattersImprint©2025Sunrise GmbH"
        }
    },
    {
        "url": "https://www.sunrise.ch/en/mobile/options/sunrise-pay",
        "data": {
            "title": "Sunrise Pay - Pay easily online with your Sunrise bill",
            "description": "Sunrise Pay makes your digital life easier, more convenient and secure - pay for online services together with your Sunrise bill and keep track of your monthly expenses, all in one place. ",
            "body": "Sunrise Pay - Pay easily online with your Sunrise billPrivateBusinessPropertiesHelpShop finderSunrise MomentsSunrise mailSunrise cockpitENInternet & TVSUBSCRIPTIONSInternetInternet & TVData SIM / Extra SIMSAVE NOWSamsung TV giftedMySports – 6 months for freeHappy Women's Day: AirPods Max giftedRecommend Sunrise and earn up to 220.–MORE INFORMATIONSmart WiFi Extender​Sunrise TVSports PackagesConnect AppTV App & IPTVLandline TelephonyCyber SecuritySpeed UpgradeSunrise PayMobileSUBSCRIPTIONSMobileSunrise Young – for everyone under 27Data SIM / Extra SIMPrepaidRoamingOptionsSAVE NOWSwiss Travel+ mobile subscriptionHappy Women's Day: AirPods Max giftedRecommend Sunrise and earn up to 220.–MORE INFORMATION5G NetworkWi-Fi CallingCyber SecurityChange my Sunrise subscriptionSunrise PayCombi subscriptionDevicesDEVICESSmartphonesWorld of AppleWorld of SamsungTabletsSmartwatchesAccessoriesHOME & ENTERTAINMENTTVs & projectorsComputersGamingHIGHLIGHTSNew: iPhone 16eFlex Premium BundleSmart UpgradeFlex UpgradeBuybackSunrise PayYoungTop DealsSales HotlineMy SunriseENMy SunriseInternet & TVSubscriptionsInternetInternet & TVData SIM / Extra SIMSave nowSamsung TV giftedMySports – 6 months for freeHappy Women's Day: AirPods Max giftedRecommend Sunrise and earn up to 220.–More InformationSmart WiFi Extender​Sunrise TVSports PackagesConnect AppTV App & IPTVLandline TelephonyCyber SecuritySpeed UpgradeSunrise PayMobileSubscriptionsMobileSunrise Young – for everyone under 27Data SIM / Extra SIMPrepaidRoamingOptionsSave nowSwiss Travel+ mobile subscriptionHappy Women's Day: AirPods Max giftedRecommend Sunrise and earn up to 220.–More Information5G NetworkWi-Fi CallingCyber SecurityChange my Sunrise subscriptionSunrise PayCombi subscriptionDevicesDevicesSmartphonesWorld of AppleWorld of SamsungTabletsSmartwatchesAccessoriesHome & EntertainmentTVs & projectorsComputersGamingHighlightsNew: iPhone 16eFlex Premium BundleSmart UpgradeFlex UpgradeBuybackSunrise PayYoungTop DealsPrivateBusinessPropertiesHelpShop finderSunrise MomentsSunrise mailSunrise cockpitWhat can you pay?Thousands of apps, games movies, music, services and online subscriptions.Who can pay?All Sunrise customers. Pay monthly through your Sunrise bill or deduct from your mobile phone balance.How can you pay?Select «Sunrise Pay» as a payment method, either through your device settings, in case of app stores, or on the partner's page.What's in it for you?An easier digital life - more convenient and more secure. With Sunrise Pay, you can have online purchases billed to your phone bill or deducted from your prepaid balance.ConvenientPay easily and keep track of your purchases and monthly expenses, all in one place.SecureNo need to enter credit card or bank details when making online purchases.No extra costsPay as many services as you like without additional costs. Sunrise Pay is completely free.Where you can use Sunrise PayStoresLifestyleEntertainmentApp StoreDiscover moreGoogle Play StoreDiscover moreMicrosoft StoreDiscover moreSony PlayStation StoreDiscover moreBadooDiscover moreBokuDiscover moreDundleDiscover moreEasyParkDiscover moreChubb Insurance12SpotifyDiscover moreTerms of ServiceNew regulatory requirements for value-added services. Find out the measures taken at Sunrise.After a process of several years, the Federal Supreme Court of Switzerland recently affirmed the judgment of the Federal Administrative Court in the case of FINMA v. Swisscom by deciding that, under certain circumstances, value-added services represent payment services and consequently fall under the Anti-Money-Laundering Act (AMLA).Specifically, the payment services in question are a system by which a customer of a telecommunications service provider places the order for invoicing and for forwarding payment to a value-added service provider. As a consequence, the telecommunications service provider functions as a financial intermediary. In this way, funds originating from illegal sources can enter this para-banking system as well.Sunrise is therefore forced to introduce a transaction limit of CHF 5,000.– per contractual partner per year on value-added services such as 090x numbers, Premium SMS services, and Sunrise Pay and to monitor the cash flows running through the relevant providers. The measures to be taken apply equally to all telecommunications service providers and competitors of Sunrise in Switzerland.In order to ensure legal requirements are met, Sunrise will implement the following measures - foreseeably by August 1, 2020:Private customers, sole proprietors and micro-businesses:Value-added services including Premium SMS services and Sunrise Pay are available as usual, but are automatically blocked after sales of CHF 5,000.– per customer (person or company) are reached.Business customers:Value-added services, including Premium SMS services and Sunrise Pay, are generally blocked and are no longer available to employees of SMEs and large customers. Due to the size of the customer and the required manual blocking, compliance with the minor threshold cannot be guaranteed.We ask for your understanding.Questions and answers on this topicWhich services are affected?Language value-added services:090x numbers: Paid hotlines for information, consultation, support, or for participating in discussion forums, contests, etc.Data value-added services (Premium SMS):SMS/MMS Business numbers: Paid SMS/MMS for buying public transport tickets, ringtones, mobile games, or for vending machine purchases.Sunrise Pay: Apple Store, Google Playstore, or other online shops where digital products are purchased and billed using a Sunrise mobile subscription or prepaid credit.Which business customers are affected by the general block?All business customers of any legal form are included in the general blocking of value-added services, with the exception of individual and micro-enterprises, where manual blocking via the individual connections can be guaranteed due to the minor threshold.How is the transaction limit calculated?The transaction limit of CHF 5,000.–/year refers to the contract holder and is not calculated per phone number. A transaction limit is reached when a contract holder reaches the limit amount across all his numbers (including numbers at Sunrise, Yallo and Lebara). The sales of all value-added services or the sales of value-added services from all providers are cumulative.What happens when the transaction limit is reached?Shortly before the annual transaction limit of CHF 5,000.– is reached, the customer is informed that he will be blocked from further consumption of these services. If the customer reaches the annual transaction limit, the value-added services will be blocked until the end of the year for which that particular transaction limit is calculated.Frequently asked questions about Sunrise PayHow can I control my subscriptions and payments?In your monthly Sunrise bill.What is the purchase limit?The limits are CHF 150.- per purchase and 400.- per month.Why is Sunrise Pay safe?Your login is made through a PIN authentication. Plus, you are notified when:You make your first purchase with any of the available partners.You reach the limits of CHF 150.- per purchase or CHF 400.- during a one-month period.Where can I manage my balance?InMy Sunrise.Where can I manage my spending limit and enable/disable Sunrise Pay?InMy Sunrise.Sunrise onAbout SunriseCompanyAbout usMediaInvestor RelationsSustainabilityJobs & CareersLocationsDirect accessWhy Sunrise?Combo discountMy SunriseNetwork coverage mapMy billSwitching to SunriseBlogSunrise CommunityDiscover SunrisePromotions and dealsconnect mobile and 5G network testDevicesWorld of AppleAward winning digital TVRoaming - use your mobile phone abroadSunrise affiliate program (German)Recommend SunriseContactSales hotline: 0800 707 504Other contact optionsShop finderSunrise on©2025Sunrise GmbHSitemapData privacyLegal mattersImprintSitemapData privacyLegal mattersImprint©2025Sunrise GmbH"
        }
    },
    {
        "url": "https://www.sunrise.ch/en/residential/mobile/international/roaming-world.html",
        "data": {
            "title": "International calls - Country groups | Sunrise",
            "description": "",
            "body": "International calls - Country groups | SunrisePrivateBusinessPropertiesHelpShop finderSunrise MomentsSunrise mailSunrise cockpitENInternet & TVSUBSCRIPTIONSInternetInternet & TVData SIM / Extra SIMSAVE NOWSamsung TV giftedMySports – 6 months for freeHappy Women's Day: AirPods Max giftedRecommend Sunrise and earn up to 220.–MORE INFORMATIONSmart WiFi Extender​Sunrise TVSports PackagesConnect AppTV App & IPTVLandline TelephonyCyber SecuritySpeed UpgradeSunrise PayMobileSUBSCRIPTIONSMobileSunrise Young – for everyone under 27Data SIM / Extra SIMPrepaidRoamingOptionsSAVE NOWSwiss Travel+ mobile subscriptionHappy Women's Day: AirPods Max giftedRecommend Sunrise and earn up to 220.–MORE INFORMATION5G NetworkWi-Fi CallingCyber SecurityChange my Sunrise subscriptionSunrise PayCombi subscriptionDevicesDEVICESSmartphonesWorld of AppleWorld of SamsungTabletsSmartwatchesAccessoriesHOME & ENTERTAINMENTTVs & projectorsComputersGamingHIGHLIGHTSNew: iPhone 16eFlex Premium BundleSmart UpgradeFlex UpgradeBuybackSunrise PayYoungTop DealsSales HotlineMy SunriseENMy SunriseInternet & TVSubscriptionsInternetInternet & TVData SIM / Extra SIMSave nowSamsung TV giftedMySports – 6 months for freeHappy Women's Day: AirPods Max giftedRecommend Sunrise and earn up to 220.–More InformationSmart WiFi Extender​Sunrise TVSports PackagesConnect AppTV App & IPTVLandline TelephonyCyber SecuritySpeed UpgradeSunrise PayMobileSubscriptionsMobileSunrise Young – for everyone under 27Data SIM / Extra SIMPrepaidRoamingOptionsSave nowSwiss Travel+ mobile subscriptionHappy Women's Day: AirPods Max giftedRecommend Sunrise and earn up to 220.–More Information5G NetworkWi-Fi CallingCyber SecurityChange my Sunrise subscriptionSunrise PayCombi subscriptionDevicesDevicesSmartphonesWorld of AppleWorld of SamsungTabletsSmartwatchesAccessoriesHome & EntertainmentTVs & projectorsComputersGamingHighlightsNew: iPhone 16eFlex Premium BundleSmart UpgradeFlex UpgradeBuybackSunrise PayYoungTop DealsPrivateBusinessPropertiesHelpShop finderSunrise MomentsSunrise mailSunrise cockpitInternational callsCOUNTRY GROUPSWhen calling abroad, the countries of the world are divided into groups. In addition, there are two groups for calls to satellite phones.Country groupsCountry group 1Åland Islands, Austria, Belgium, Canada, Denmark, Finland, France, Germany, Guernsey, Isle of Man, Italy, Jersey, Liechtenstein, Netherlands, Norway, Spain, Svalbard and Jan Mayen, Sweden, United Kingdom, United States (incl. Hawai and Alaska), Vatican City.Overseas territories of the countries listed are excluded, particularly:The Netherlands: excluding Bonaire, Sint Eustasius, Saba, Aruba, Curacao, Sint MaartenFrance: excluding French Guiana, Guadeloupe, Martinique, Mayotte, Réunion, Saint Martin, Saint Barthélemy, Saint-Pierre and Miquelon, Wallis and Futuna, French Polynesia, New CaledoniaUSA: excluding American Virgin Islands, American Samoa, GuamUnited Kingdom: excluding Anguilla, Bermuda, British Virgin Islands, Falkland Islands, Gibraltar, Cayman Islands, Montserrat, Pictairn, St. Helena, Ascension, Tristan da Cunha, South Georgia, Sandwich Islands, Turks and Caicos IslandsCountry group 2Andorra, Australia, Christmas Island, Cyprus, Faeroe Islands, Gibraltar, Greece, Iceland, Ireland, Israel, Luxembourg, Malta, Monaco, New Zealand, Portugal, San MarinoCountry group 3Albania, Belarus, Bosnia-Herzegovina, Bulgaria, Croatia, Czech Republic, Estonia, Hong Kong, Hungary, Japan, Kosovo, Latvia, Lithuania, Moldova, Montenegro, North Macedonia, Poland, Romania, Russia, Serbia, Singapore, Slovakia, Slovenia, Turkey, UkraineCountry group 4Algeria, Argentina, Brazil, Chile, China, Dominican Republic, East Timor, Egypt, Indonesia, Libya, Malaysia, Mexico, Morocco, Philippines, Puerto Rico, South Africa, South Korea, Taiwan, Thailand, Tunisia, US Virgin IslandsCountry group 5Angola, Armenia, Azerbaijan, Bahrain, Bangladesh, Belize, Benin, Bhutan, Bolivia, Botswana, Brunei, Burkina Faso, Burundi, Cameroon, Central African Republic, Colombia, Congo, Brazzaville, Congo, Democratic Republic, Costa Rica, Djibouti, Ecuador, El Salvador, Equatorial Guinea, French Guiana, Gabon, Gambia, Georgia, Ghana, Greenland, Grenada, Guadeloupe, Guatemala, Guinea, Honduras, India, Iran, Jamaica, Jordan, Kazakhstan, Kenya, Kuwait, Kyrgyzstan, Lebanon, Lesotho, Liberia, Martinique, Mauritania, Mongolia, Mozambique, Nepal, Nicaragua, Niger, Nigeria, Oman, Pakistan, Palestine, Papua New Guinea, Paraguay, Peru, Qatar, Rwanda, Saint Barthélemy, Saint Martin, Saudi Arabia, Sierra Leone, Sri Lanka, Syria*, Tajikistan, Tanzania, Trinidad and Tobago, Turkmenistan, Uganda, United Arab Emirates, Uruguay, Uzbekistan, Venezuela, Zambia, Zimbabwe*Currently no roaming partner availableCountry group 6Afghanistan, American Samoa, Anguilla, Antigua and Barbuda, Aruba, Bahamas, Barbados, Bermuda, Bonaire, British Indian Ocean Territory*, Cambodia, Cape Verde Islands, Cayman Islands, Chad, Cocos Islands*, Comoros**, Cook Islands, Cuba, Curaçao, Diego Garcia*, Dominica, Eritrea*, Ethiopia, Falkland Islands*, Federated States of Micronesia*, Fiji, French Polynesia, Guam, Guinea-Bissau, Guyana, Haiti, Heard Island and McDonald Islands, Iraq, Ivory Coast, Kiribati, Laos, Macau, Madagascar, Malawi, Maldives, Mali, Marshall Islands, Mauritius, Mayotte, Montserrat, Myanmar, Namibia, Nauru, New Caledonia, Niue*, Norfolk Island, North Korea, Northern Mariana Islands*, Palau*, Panama, Pitcairn Islands*, Réunion, Saba, Saint Helena, Ascension and Tristan da Cunha, Saint Kitts and Nevis, Saint-Pierre and Miquelon, Samoa, Santa Lucia, São Tomé and Principe, Senegal, Seychelles, Sint Eustatius, Sint Maarten, Solomon Islands, Somalia**, South Georgia and the South Sandwich Islands, South Sudan, St. Vincent and the Grenadines, Sudan, Suriname, Swaziland, Togo, Tokelau, Tonga, Turks and Caicos Islands, Tuvalu, Vanuatu, Vietnam, Virgin Islands (GB), Wallis and Futuna, Yemen*Currently no roaming partner available**No roaming data possibleSatellitesGroup 7Inmarsat Mini M: 0087076; 0087176; 0087276; 0087376; 0087476; 0087576; 0087676; 0087776; 0087876; 0087976; 0087077*Iridium: 00881*Inmarsat B: 0087030; 0087130; 0087230 0087330 0087430 0087530 0087630 0087730 0087830 0087930 0087031 0087131 0087231 0087331 0087431 0087531 0087631 0087731 0087831 0087931 0087032 0087132 0087232 0087332 0087432 0087532 0087632 0087732 0087832 0087932*0087033 0087133 0087233 0087333 0087433 0087533 0087633 0087733 0087833 0087933 0087034 0087134 0087234 0087334 0087434 0087534 0087634 0087734 0087834 0087934 0087035 0087135 0087235 0087335 0087435 0087535 0087635 0087735 0087835 0087935 0087036 0087136*0087236 0087336 0087436 0087536 0087636 0087736 0087836 0087936 0087037 0087137 0087237 0087337 0087437 0087537 0087637 0087737 0087837 0087937 0087038 0087138 0087238 0087338 0087438 0087538 0087638 0087738 0087838 0087938*Inmarsat M: 0087061 0087161 0087261 0087361 0087461 0087561 0087661 0087761 0087861 0087961 0087062 0087162 0087262 0087362 0087462 0087562 0087662 0087762 0087862 0087962 0087063 0087163 0087263 0087363 0087463 0087563 0087663 0087763 0087863 0087963*0087064 0087164 0087264 0087364 0087464 0087564 0087664 0087764 0087864 0087964 0087065 0087165 0087265 0087365 0087465 0087565 0087665 0087765 0087865 0087965 0087066 0087166 0087266 0087366 0087466 0087566 0087666 0087766 0087866 0087966 0087067 0087167*0087267: 0087367; 0087467; 0087567; 0087667; 0087767; 0087867; 0087967; 0087068; 0087168; 0087268; 0087368; 0087468; 0087568; 0087668; 0087768; 0087868; 0087968; 0087069; 0087169; 0087269; 0087369; 0087469; 0087569; 0087669; 0087769; 0087869; 0087969*EMSAT: 00882**Currently no roaming partner availableGroup 8Inmarsat A: 008711 008701 008751 008761 008771 008781 008791 008721 008731 008741*Inmarsat Aero: 008705 008715 008725 008735 008745 008755 008765 008775 008785 008795 008708 008718 008728 008738 008748 008758 008768 008778 008788 008798*Inmarsat B HSD: 0087039 0087139 0087239 0087339 0087439 0087539 0087639 0087739 0087839 0087939*Inmarsat M HSD: 0087060 0087160 0087260 0087360 0087460 0087560 0087660 0087760 0087860 0087960**Currently no roaming partner availableAdditional options & standard ratesInternational optionsBenefit from reduced prices on calling abroad from Switzerland with additional options from Sunrise.To the optionsStandard rates for private customersFor international calls from Switzerland to other countries.View ratesStandard rates for business customersFor international calls from Switzerland to other countries.View ratesStill have questions?Go to Help CenterSunrise onAbout SunriseCompanyAbout usMediaInvestor RelationsSustainabilityJobs & CareersLocationsDirect accessWhy Sunrise?Combo discountMy SunriseNetwork coverage mapMy billSwitching to SunriseBlogSunrise CommunityDiscover SunrisePromotions and dealsconnect mobile and 5G network testDevicesWorld of AppleAward winning digital TVRoaming - use your mobile phone abroadSunrise affiliate program (German)Recommend SunriseContactSales hotline: 0800 707 504Other contact optionsShop finderSunrise on©2025Sunrise GmbHSitemapData privacyLegal mattersImprintSitemapData privacyLegal mattersImprint©2025Sunrise GmbH"
        }
    },
    {
        "url": "https://www.sunrise.ch/en/mobile/options",
        "data": {
            "title": "Additional options for your mobile subscription | Sunrise ",
            "description": "Looking to optimize your Sunrise mobile subscription? Find out all the additional options we have on offer.",
            "body": "Additional options for your mobile subscription | SunrisePrivateBusinessPropertiesHelpShop finderSunrise MomentsSunrise mailSunrise cockpitENInternet & TVSUBSCRIPTIONSInternetInternet & TVData SIM / Extra SIMSAVE NOWSamsung TV giftedMySports – 6 months for freeHappy Women's Day: AirPods Max giftedRecommend Sunrise and earn up to 220.–MORE INFORMATIONSmart WiFi Extender​Sunrise TVSports PackagesConnect AppTV App & IPTVLandline TelephonyCyber SecuritySpeed UpgradeSunrise PayMobileSUBSCRIPTIONSMobileSunrise Young – for everyone under 27Data SIM / Extra SIMPrepaidRoamingOptionsSAVE NOWSwiss Travel+ mobile subscriptionHappy Women's Day: AirPods Max giftedRecommend Sunrise and earn up to 220.–MORE INFORMATION5G NetworkWi-Fi CallingCyber SecurityChange my Sunrise subscriptionSunrise PayCombi subscriptionDevicesDEVICESSmartphonesWorld of AppleWorld of SamsungTabletsSmartwatchesAccessoriesHOME & ENTERTAINMENTTVs & projectorsComputersGamingHIGHLIGHTSNew: iPhone 16eFlex Premium BundleSmart UpgradeFlex UpgradeBuybackSunrise PayYoungTop DealsSales HotlineMy SunriseENMy SunriseInternet & TVSubscriptionsInternetInternet & TVData SIM / Extra SIMSave nowSamsung TV giftedMySports – 6 months for freeHappy Women's Day: AirPods Max giftedRecommend Sunrise and earn up to 220.–More InformationSmart WiFi Extender​Sunrise TVSports PackagesConnect AppTV App & IPTVLandline TelephonyCyber SecuritySpeed UpgradeSunrise PayMobileSubscriptionsMobileSunrise Young – for everyone under 27Data SIM / Extra SIMPrepaidRoamingOptionsSave nowSwiss Travel+ mobile subscriptionHappy Women's Day: AirPods Max giftedRecommend Sunrise and earn up to 220.–More Information5G NetworkWi-Fi CallingCyber SecurityChange my Sunrise subscriptionSunrise PayCombi subscriptionDevicesDevicesSmartphonesWorld of AppleWorld of SamsungTabletsSmartwatchesAccessoriesHome & EntertainmentTVs & projectorsComputersGamingHighlightsNew: iPhone 16eFlex Premium BundleSmart UpgradeFlex UpgradeBuybackSunrise PayYoungTop DealsPrivateBusinessPropertiesHelpShop finderSunrise MomentsSunrise mailSunrise cockpitAdditional options for your mobile subscriptionInternationalBenefit from reduced prices on calling abroad from Switzerland with additional options from Sunrise. Call your friends or family abroad from Switzerland.RoamingSurf, make calls and SMS abroadLearn moreInternational unlimited EU+/USA/CANCall your friends or family abroad from SwitzerlandLearn moreMy countryCarefree calls to the country of your choiceLearn moreInternationalMake calls from Switzerland to any country in the world at reduced per-minute pricesLearn moreSpeed and FlexibilityLearn more about the Sunrise speed booster options, extra SIM, and Sunrise Pay.Speed BoosterContinue surfing at full speed until the end of the monthLearn moreExtra SIMAlways and everywhere connectedLearn moreSunrise PayConvenient and secure payment via your phone bill or with your prepaid creditLearn moreInsurance and securityBetter safe surfing: There are many dangers lurking online. Sunrise offers optimum protection against these risks.Cyber securityYour complete online protection keeps you safe from phishing, ransomware, hacking and much more.Learn moreInsuranceOptimal, comprehensive protection against damage and theftLearn moreMobile IDSecure login on numerous online portalsLearn moreExtras for your SmartphoneAccessoriesAccessories with a down payment starting at CHF 1.00Learn moreBuybackReceive credit for your old smartphone or tabletLearn moreEntertainmentApple MusicOver 100 million songsLearn moreSunrise onAbout SunriseCompanyAbout usMediaInvestor RelationsSustainabilityJobs & CareersLocationsDirect accessWhy Sunrise?Combo discountMy SunriseNetwork coverage mapMy billSwitching to SunriseBlogSunrise CommunityDiscover SunrisePromotions and dealsconnect mobile and 5G network testDevicesWorld of AppleAward winning digital TVRoaming - use your mobile phone abroadSunrise affiliate program (German)Recommend SunriseContactSales hotline: 0800 707 504Other contact optionsShop finderSunrise on©2025Sunrise GmbHSitemapData privacyLegal mattersImprintSitemapData privacyLegal mattersImprint©2025Sunrise GmbH"
        }
    },
    {
        "url": "https://www.salt.ch/en/mobile/plans/surf-unlimited",
        "data": {
            "title": "Salt. | Surf - Mobile Data Plan - Unlimited",
            "description": "Salt. - Surf - Mobile Data Plan - Unlimited",
            "body": "Salt. | Surf - Mobile Data Plan - UnlimitedSkip to main contentSurf Unlimited:The ultimate internet subscription for Switzerland.Stay connected without limits anywhere in the country.DaysHoursMinutesSeconds0000ONLINE ONLYLifetime discount17.95/month-50%Instead of35.95Order nowSurf UnlimitedSurfUnlimited17.95/monthInstead of35.95Order nowIn SwitzerlandUnlimited Internet 5G.Do you need help ordering?0800 667 667Why Salt?Outstanding mobile networkEnjoy Salt’s fast and reliable network, officially ranked outstanding in this year’s Connect test.First-class serviceManage your subscriptions in MyAccount or Salt App, or get in touch with our excellent customer care.Premium offers at our best priceOrder online to profit from our Top Deals with lifelong discounts.Why choose Salt’s Surf Unlimited mobile data plan?Want to stay connected to your favorite devices 24/7? The Surf Unlimited mobile data plan is made for you. With this plan, enjoy an unlimited ultra-fast 5G internet connection across Switzerland. Whether you want to play online, binge-watch your favorite series, scroll through TikTok, or simply browse the web, the Surf Unlimited plan offers total freedom for a seamless connection without restrictions. Smartphone, tablet, smartwatch—use all your connected devices without limits thanks to Surf Unlimited.Details of the offerOffer conditionsThis offer is validuntil 17.03.2024 for a new Surf Unlimited mobile subscription for 17.95/month instead of 35.95/month.Discount: discount applied lifetime for online orders only.Minimum contract duration: 24 months.Activation fees:CHF 59.95, SIM card included.Additional information:possibility to send SMS: 0.49/SMS Usage is blocked as soon as the data allowance is consumed or if you are abroad. Mobile data in Switzerland up to max. 500 GB per month, then speed reduction to 256 kbit/s.Getin touchwith SaltSalt My AccountLoginHelpVisit our help centerSalt StoresVisit our shopsPhone Sales SupportTalk to our sales experts"
        }
    },
    {
        "url": "https://www.salt.ch/en/mobile/plans/surf",
        "data": {
            "title": "Data plans Surf - Order online | Salt.",
            "description": "Salt. - Surf - Mobile Data Plans",
            "body": "Data plans Surf - Order online | Salt.Skip to main contentMobilePlansSurfStay connected wherever you go with our Mobile Data subscriptions.Combine our Surf subscriptions with your favorite device and stay connected to Salt's outstanding network.DaysHoursMinutesSeconds0000Surf 5 GBThe optimal for CHIn Switzerland5 GB Internet 5G.In Switzerland5 GB Internet 5G.9.95/monthOrder nowProduct DetailsDaysHoursMinutesSeconds0000Surf 50 GBThe ideal for CHIn Switzerland50 GB Internet 5G.In Switzerland50 GB Internet 5G.24.95/monthOrder nowProduct DetailsDaysHoursMinutesSeconds000050% DISCOUNTSurf UnlimitedThe ultimate for CHIn SwitzerlandUnlimited Internet 5G.In SwitzerlandUnlimited Internet 5G.ONLINE ONLYLifetime discount17.95/month-50%Instead of35.95Order nowProduct DetailsDo you need help ordering?0800 667 667Connect, Stream and Surf on the Go.Enjoy your Surf plan at 5G maximum speed on all your favorite devices.TabletsDISCOVERMobile Wi-FiDISCOVERWhy Salt?Outstanding mobile networkEnjoy Salt’s fast and reliable network, officially ranked outstanding in this year’s Connect test.First-class serviceManage your subscriptions in MyAccount or Salt App, or get in touch with our excellent customer care.Premium offers at our best priceOrder online to profit from our Top Deals with lifelong discounts.Why choose Salt’s Surf mobile data plans?Our Surf mobile subscriptions are specifically designed for internet usage on your connected devices, such as tablets, laptops, and smartwatches. By surfing on our outstanding network, you can enjoy an ultra-fast 5G connection and reliable coverage, everywhere in Switzerland. Whether you're an occasional user or a streamer, our Surf plans meet your needs. With subscriptions ranging from 5 GB per month to unlimited usage, you’ll find the perfect match to your digital lifestyle while enjoying unmatched network quality.How to choose the right Surf plan for you?To find the perfect Surf plan, start by evaluating your mobile internet usage. For moderate activities like browsing the web and sending emails, the Surf 5 GB plan is ideal. If you’re a streamer who enjoys watching videos and playing online games, the Surf Unlimited plan is made for you. For varied usage, the Surf 50 GB plan is an excellent alternative, offering approximately more than 800 hours of music streaming or over 150 hours of video streaming.Getin touchwith SaltSalt My AccountLoginHelpVisit our help centerSalt StoresVisit our shopsPhone Sales SupportTalk to our sales expertsCall usOur sales experts will help you tofind the best deal.Mo-Fr 9-18 (toll free)0800 667 667"
        }
    },
    {
        "url": "https://www.salt.ch/en/mobile/plans/swiss-xxl?packages=RCSWISSXXLWEB",
        "data": {
            "title": "Salt. | Swiss XXL",
            "description": "Salt. - Swiss XXL",
            "body": "Salt. | Swiss XXLSkip to main contentMobilePlansSwiss XXLSwiss XXL:The exclusive mobile subscriptionfor peace of mind in CH and Europe.Enjoy data, calls and SMS worry-free with our subscription for smart travelers.Swiss XXL offer is valid until Thursday!DaysHoursMinutesSeconds0000ONLINE ONLYLifetime discount27.95/month-65%Instead of83.95Order nowFactsheet (PDF)Swiss XXLSwissXXL27.95/monthInstead of83.95Order nowIn SwitzerlandUnlimited internet at maximum speed 5G (up to 1,7 Gbit/s).Unlimited calls & SMS.In Salt EUROPE zoneBeyond 4 GB, a Data DayPass (4.95/day) is automatically activated for 24 hours allowing unlimited access to the Internet, including 1 GB at high speed. Once these data has been used up, the speed is reduced to 128 kbit/s. Further detailshere.List of countries included in the subscriptionhere.4 GB highspeed Internet.100 min calls.Unlimited SMS.Do you need help ordering?0800 667 667Why Salt?Outstanding mobile networkEnjoy Salt’s fast and reliable network, officially ranked outstanding in this year’s Connect test.First-class serviceManage your subscriptions in MyAccount or Salt App, or get in touch with our excellent customer care.Keep your numberSelect to keep your number when you order online and we will take care of the rest.Choose your preferred SIM type for your plan.With Salt Mobile, you have the flexibility to choose between a physical SIM or an eSIM, offering you a seamless mobile experience. Having an eSIM gives you, for example, the possibility to use two phone numbers on the same smartphone and effortlessly switch between your professional and personal lines. When you use an eSIM, you dont have to worry about inserting or removing your SIM card, and it is even more secure as you can remotely deactivate it in case of losing it or being stolen.How do I select an eSIM for my mobile subscription?It is simple, just order your favorite subscription online and select your preferred SIM type in the \"order summary\" step of the order process. After you finish your order, we will send you an eSIM voucher via post to activate it via QR code. Say hello to simplicity!Add the subscription of your choice to your basket.Complete your personal information in the eshop.In your order summary, select either a physical SIM or an eSIM.Unlimited Connectivity Nationwide.With the Swiss XXL mobile subscription, enjoy unlimited calls, SMS, and internet throughout Switzerland, to stay connected at any time, anywhere in the country, thanks to outstanding network coverage.Share you adventures in Europe!In Europe, enjoy 100 minutes of calls and unlimited SMS to stay connected with your loved ones, even abroad. With its 4 GB of data, the Swiss XXL plan allows you to travel while sharing your adventures with your friends on Instagram, to discover the visited country using Google Maps while keeping track of your expenses on your banking app.Details of the offerOffer conditionsThis offer is valid until10.03.2025 for a new Swiss XXL mobile subscription for 27.95/month instead of 83.95/month.Discount: discount applied lifetime for online orders only.Minimum contract duration: 24 months.Activation fees:CHF 59.95, SIM card included.Additional roaming data:Data DayPassavailable to use internet while abroad in the Salt EUROPE zone or TRAVEL zone.Getin touchwith SaltSalt My AccountLoginHelpVisit our help centerSalt StoresVisit our shopsPhone Sales SupportTalk to our sales experts"
        }
    },
    {
        "url": "https://www.salt.ch/en/mobile/plans/swiss-xxl",
        "data": {
            "title": "Salt. | Swiss XXL",
            "description": "Salt. - Swiss XXL",
            "body": "Salt. | Swiss XXLSkip to main contentMobilePlansSwiss XXLSwiss XXL:The exclusive mobile subscriptionfor peace of mind in CH and Europe.Enjoy data, calls and SMS worry-free with our subscription for smart travelers.Swiss XXL offer is valid until Thursday!DaysHoursMinutesSeconds0000ONLINE ONLYLifetime discount27.95/month-65%Instead of83.95Order nowFactsheet (PDF)Swiss XXLSwissXXL27.95/monthInstead of83.95Order nowIn SwitzerlandUnlimited internet at maximum speed 5G (up to 1,7 Gbit/s).Unlimited calls & SMS.In Salt EUROPE zoneBeyond 4 GB, a Data DayPass (4.95/day) is automatically activated for 24 hours allowing unlimited access to the Internet, including 1 GB at high speed. Once these data has been used up, the speed is reduced to 128 kbit/s. Further detailshere.List of countries included in the subscriptionhere.4 GB highspeed Internet.100 min calls.Unlimited SMS.Do you need help ordering?0800 667 667Why Salt?Outstanding mobile networkEnjoy Salt’s fast and reliable network, officially ranked outstanding in this year’s Connect test.First-class serviceManage your subscriptions in MyAccount or Salt App, or get in touch with our excellent customer care.Keep your numberSelect to keep your number when you order online and we will take care of the rest.Choose your preferred SIM type for your plan.With Salt Mobile, you have the flexibility to choose between a physical SIM or an eSIM, offering you a seamless mobile experience. Having an eSIM gives you, for example, the possibility to use two phone numbers on the same smartphone and effortlessly switch between your professional and personal lines. When you use an eSIM, you dont have to worry about inserting or removing your SIM card, and it is even more secure as you can remotely deactivate it in case of losing it or being stolen.How do I select an eSIM for my mobile subscription?It is simple, just order your favorite subscription online and select your preferred SIM type in the \"order summary\" step of the order process. After you finish your order, we will send you an eSIM voucher via post to activate it via QR code. Say hello to simplicity!Add the subscription of your choice to your basket.Complete your personal information in the eshop.In your order summary, select either a physical SIM or an eSIM.Unlimited Connectivity Nationwide.With the Swiss XXL mobile subscription, enjoy unlimited calls, SMS, and internet throughout Switzerland, to stay connected at any time, anywhere in the country, thanks to outstanding network coverage.Share you adventures in Europe!In Europe, enjoy 100 minutes of calls and unlimited SMS to stay connected with your loved ones, even abroad. With its 4 GB of data, the Swiss XXL plan allows you to travel while sharing your adventures with your friends on Instagram, to discover the visited country using Google Maps while keeping track of your expenses on your banking app.Details of the offerOffer conditionsThis offer is valid until10.03.2025 for a new Swiss XXL mobile subscription for 27.95/month instead of 83.95/month.Discount: discount applied lifetime for online orders only.Minimum contract duration: 24 months.Activation fees:CHF 59.95, SIM card included.Additional roaming data:Data DayPassavailable to use internet while abroad in the Salt EUROPE zone or TRAVEL zone.Getin touchwith SaltSalt My AccountLoginHelpVisit our help centerSalt StoresVisit our shopsPhone Sales SupportTalk to our sales experts"
        }
    },
    {
        "url": "https://www.salt.ch/en/mobile/smartphones/pixel9pro256gb",
        "data": {
            "title": "Salt. | Pixel 9 Pro 256 GB",
            "description": "",
            "body": "Salt. | Pixel 9 Pro 256 GBSkip to main contentMobilesmartphonesPixel 9 Pro 256 GBPixel 9 Pro 256 GBGOOGLECapacity :256 Gb512 GbColors :- Any -hazelobsidianChoose the offer that best suits you :Pixel 9 Pro 256 GB13.54/per monthfor 24 monthStart Max40.95/monthStart MaxIn Switzerland:5GB highspeed Internet (4G+)Unlimited calls & SMS/MMSBUYPixel 9 Pro 256 GB13.54/per monthfor 24 monthStart Max40.95/monthStart MaxIn Switzerland:5GB highspeed Internet (4G+)Unlimited calls & SMS/MMSBUYPixel 9 Pro 256 GB10.54/per monthfor 24 monthSwiss 10GB50.95/monthSwiss 10GBIn Switzerland:10 GB highspeed Internet (4G+ & 5G)Unlimited calls, SMS/MMSBUYPixel 9 Pro 256 GB10.54/per monthfor 24 monthSwiss 10GB50.95/monthSwiss 10GBIn Switzerland:10 GB highspeed Internet (4G+ & 5G)Unlimited calls, SMS/MMSBUYPixel 9 Pro 256 GB0instead of949Swiss Max69.4971.95/monthSwiss MaxIn Switzerland:Everything unlimitedIn Europe:1GB InternetBUYPixel 9 Pro 256 GB0instead of949Swiss Max69.4971.95/monthSwiss MaxIn Switzerland:Everything unlimitedIn Europe:1GB InternetBUYPixel 9 Pro 256 GB0instead of949Swiss XXL74.4981.95/monthSwiss XXLIn Switzerland:Everything unlimitedIn Europe:4GB Internet100 min of calls & unlimited SMSBUYPixel 9 Pro 256 GB0instead of949Swiss XXL74.4981.95/monthSwiss XXLIn Switzerland:Everything unlimitedIn Europe:4GB Internet100 min of calls & unlimited SMSBUYPixel 9 Pro 256 GB4.54/per monthfor 24 monthEurope Max82.95/monthEurope MaxIn Switzerland:Everything unlimitedIn Europe:Unlimited InternetUnlimited calls & SMS to CH and within the visited countryUnlimited calls & SMS/MMSto CH and within the country visitedBUYPixel 9 Pro 256 GB4.54/per monthfor 24 monthEurope Max82.95/monthEurope MaxIn Switzerland:Everything unlimitedIn Europe:Unlimited InternetUnlimited calls & SMS to CH and within the visited countryUnlimited calls & SMS/MMSto CH and within the country visitedBUYPixel 9 Pro 256 GB0instead of949Europe XL85.4992.95/monthEurope XLIn Switzerland:Everything unlimitedIn/to Europe:Everything unlimitedBUYPixel 9 Pro 256 GB0instead of949Europe XL85.4992.95/monthEurope XLIn Switzerland:Everything unlimitedIn/to Europe:Everything unlimitedBUYPixel 9 Pro 256 GB0instead of949Europe XXL94.49102.95/monthEurope XXLIn Switzerland:Everything unlimitedIn/to Europe:Everything unlimitedBUYPixel 9 Pro 256 GB0instead of949Europe XXL94.49102.95/monthEurope XXLIn Switzerland:Everything unlimitedIn/to Europe:Everything unlimitedBUYPixel 9 Pro 256 GB0instead of949Travel Max99.49102.95/monthTravel MaxIn Switzerland:Everything unlimitedIn/to & Europe:Everything unlimitedIn/to 30 top travel destinations:Unlimited internet and 10 hours of calls & SMS to CH and within the TRAVEL zoneBUYPixel 9 Pro 256 GB0instead of949Travel Max99.49102.95/monthTravel MaxIn Switzerland:Everything unlimitedIn/to & Europe:Everything unlimitedIn/to 30 top travel destinations:Unlimited internet and 10 hours of calls & SMS to CH and within the TRAVEL zoneBUYDevice specificationsWeight (in g)199 gProcessorGoogle Tensor G4Sim cardDual-SIM (Nano & eSIM)Battery information4700 mAh, 45W USBC chargingSize and description1280 à— 2856 LTPO-OLED, 495 ppiCamera50 MP wide + 48 MP ultrawide + 48 MP 5x optical zoomBluetoothBluetooth v 5.3"
        }
    },
    {
        "url": "https://www.salt.ch/en/mobile/plans/surf-50gb",
        "data": {
            "title": "Salt. | Surf - Mobile Data Plan - 50GB",
            "description": "",
            "body": "Salt. | Surf - Mobile Data Plan - 50GBSkip to main contentSurf 50 GB:the ideal mobile internet subscription for Switzerland.Enjoy high-speed connectivity across the country.DaysHoursMinutesSeconds000024.95/monthOrder nowSurf 50GBSurf50GB24.95/monthOrder nowIn Switzerland50 GB Internet 5G.Do you need help ordering?0800 667 667Why Salt?Outstanding mobile networkEnjoy Salt’s fast and reliable network, officially ranked outstanding in this year’s Connect test.First-class serviceManage your subscriptions in MyAccount or Salt App, or get in touch with our excellent customer care.Premium offers at our best priceOrder online to profit from our Top Deals with lifelong discounts.Why choose Salt’s Surf 50 GB mobile data plan?Discover the Surf 50 GB mobile data plan and enjoy ultra-fast 5G connectivity on all your favorite devices. This plan gives you great freedom for all your digital activities: stream videos from your tablet, browse your favorite social media on your smartphone, and surf the web without worrying about running out of data. Whether you're on vacation, on a business trip, or simply traveling around Switzerland, the Surf 50 GB plan will keep you connected throughout your journey.Details of the offerOffer conditionsMinimum contract duration: 24 month.Activation fees:CHF 59.95, SIM card included.Additional information:possibility to send SMS: 0.49/SMS Usage is blocked as soon as the data allowance is consumed or if you are abroad.Getin touchwith SaltSalt My AccountLoginHelpVisit our help centerSalt StoresVisit our shopsPhone Sales SupportTalk to our sales experts"
        }
    },
    {
        "url": "https://www.salt.ch/en/mobile/smartphones?productFamily=APPLE",
        "data": {
            "title": "All our Smartphones and subscriptions - Order online | Salt.",
            "description": "All smartphones, best offers, Salt Store",
            "body": "All our Smartphones and subscriptions - Order online | Salt.Skip to main contentMobileSmartphonesORDER0800 667 667All smartphones.For more information please call us on0800 667 667or visit your nearestSalt store.Sell your old device withSalt's BuyBack program.APPLEGOOGLEOPPO ONEPLUSSAMSUNGTCLGetin touchwith SaltSalt My AccountLoginHelpVisit our help centerSalt StoresVisit our shopsPhone Sales SupportTalk to our sales expertsCall usOur sales experts will help you tofind the best deal.Mo-Fr 9-18 (toll free)0800 667 667"
        }
    },
    {
        "url": "https://www.salt.ch/en/mobile/tablets",
        "data": {
            "title": "All our Tablets - Order online | Salt.",
            "description": "Salt. - Tablets",
            "body": "All our Tablets - Order online | Salt.Skip to main contentMobileTabletsAll tablets.With Surf subscriptions.APPLELENOVOSAMSUNGWhySaltMobile?QualityBest universal provider in Switzerland.Coverage99.9% coverage of the swiss population.ServiceFirst-Class Service.PricePremium offers at our best price.Call usOur sales experts will help you tofind the best deal.Mo-Fr 9-18 (toll free)0800 667 667"
        }
    },
    {
        "url": "https://www.salt.ch/en/mobile/plans/surf-5-gb",
        "data": {
            "title": "Salt. | Surf - Mobile Data Plan - 5GB",
            "description": "Salt. - Surf - Mobile Data Plan - 5GB",
            "body": "Salt. | Surf - Mobile Data Plan - 5GBSkip to main contentSurf 5 GB:The optimal internet mobile subscription for Switzerland.Enjoy 5 GB of internet accross CH.DaysHoursMinutesSeconds00009.95/monthOrder nowSurf 5 GBSurf5 GB9.95/monthOrder nowIn Switzerland5 GB Internet 5G.Do you need help ordering?0800 667 667Why Salt?Outstanding mobile networkEnjoy Salt’s fast and reliable network, officially ranked outstanding in this year’s Connect test.First-class serviceManage your subscriptions in MyAccount or Salt App, or get in touch with our excellent customer care.Premium offers at our best priceOrder online to profit from our Top Deals with lifelong discounts.Why choose Salt’s Surf 5 GB mobile data plan?Discover the Surf 5 GB mobile data plan, ideal for moderate internet use on a budget. With 5 GB of data, this plan allows you to browse the web and use your favorite apps, perfect for users who don’t need a lot of data but want to stay reachable at all times. With Salt’s outstanding network, enjoy fast and reliable 5G connectivity throughout Switzerland, ensuring a seamless experience while on the move.Details of the offerOffer conditionsMinimum contract duration: 24 months.Activation fees:CHF 59.95, SIM card included.Additional information:possibility to send SMS: 0.49/SMS Usage is blocked as soon as the data allowance is consumed or if you are abroad.Getin touchwith SaltSalt My AccountLoginHelpVisit our help centerSalt StoresVisit our shopsPhone Sales SupportTalk to our sales experts"
        }
    },
    {
        "url": "https://www.salt.ch/en/mobile/plans/europe-data",
        "data": {
            "title": "Salt. | Europe Data",
            "description": "Salt. - Europe Data",
            "body": "Salt. | Europe DataSkip to main contentMobilePlansEurope DataEurope Data:The mobile subscriptionconnected to Europe.Unlimited Internet across the EUROPE zone.DaysHoursMinutesSeconds0000ONLINE ONLYLifetime discount32.95/month-65%Instead of94.95Order nowFactsheet (PDF)EuropeEuropeData32.95/monthInstead of94.95Order nowIn SwitzerlandUnlimited Internet at maximum speed 5G (up to 1,7 Gbit/s). Unlimited calls & SMS.In Salt EUROPE zoneBeyond 20 GB, the speed is reduced to 128 kbit/s.List of countries included in the subscriptionhere.Unlimited internet incl. 20GB at highspeedDo you need help ordering?0800 667 667Why Salt?Outstanding mobile networkEnjoy Salt’s fast and reliable network, officially ranked outstanding in this year’s Connect test.First-class serviceManage your subscriptions in MyAccount or Salt App, or get in touch with our excellent customer care.Keep your numberSelect to keep your number when you order online and we will take care of the rest.Choose your preferred SIM type for your plan.With Salt Mobile, you have the flexibility to choose between a physical SIM or an eSIM, offering you a seamless mobile experience. Having an eSIM gives you, for example, the possibility to use two phone numbers on the same smartphone and effortlessly switch between your professional and personal lines. When you use an eSIM, you dont have to worry about inserting or removing your SIM card, and it is even more secure as you can remotely deactivate it in case of losing it or being stolen.How do I select an eSIM for my mobile subscription?It is simple, just order your favorite subscription online and select your preferred SIM type in the \"order summary\" step of the order process. After you finish your order, we will send you an eSIM voucher via post to activate it via QR code. Say hello to simplicity!Add the subscription of your choice to your basket.Complete your personal information in the eshop.In your order summary, select either a physical SIM or an eSIM.Discover Europe Data mobile subscription, your travel companion in Switzerland and Europe.With the Europe Data plan, enjoy unlimited calls, SMS, and internet in Switzerland to stay in touch with your loved ones and listen to your favourite music on Spotify while browsing social media.With Europe Data, live and share unforgettable adventures, and stay connected with the world around you.Enjoy unlimited internet including 20 GB of high-speed while travelling across Europe and stay connected wherever you are, without worrying about data roaming fees.Details of the offerOffer ConditionsThis offer is validuntil 10.03.2025 for a new Europe Data mobile subscription for 32.95/month instead of 94.95/month. Subject to a possible extension.Discount:discount applied lifetime for online orders only.Minimum contract duration:12 months.Activation fees:CHF 59.95, SIM card included.Included roaming data:Data in the Salt EUROPE zone up to a maximum of 20 GB per month, then speed reduction to 128 Kbits/s. In majority of Europe, list of countries onsalt.ch.Additional roaming data:Data DayPassavailable to use internet while abroad in TRAVEL zone.Getin touchwith SaltSalt My AccountLoginHelpVisit our help centerSalt StoresVisit our shopsPhone Sales SupportTalk to our sales experts"
        }
    },
    {
        "url": "https://www.salt.ch/en/mobile/plans/europe-xl?packages=RCEUROPEXLWEB",
        "data": {
            "title": "Salt. | Europe XL",
            "description": "Salt. - Europe XL",
            "body": "Salt. | Europe XLSkip to main contentMobilePlansEurope XLEurope XL:The online exclusive mobile subscription in and to Europe.Explore and stay connected with the EUROPE zone worry-free.Europe XL offer is valid until Monday!DaysHoursMinutesSeconds0000ONLINE ONLYLifetime discount34.95/month-60%Instead of94.95Order nowFactsheet (PDF)Europe XLEuropeXL34.95/monthInstead of94.95Order nowIn SwitzerlandUnlimited Internet at maximum speed 5G (up to 1,7 Gbit/s). Unlimited calls & SMS.From CH to Salt EUROPE zoneList of 30 countries included in the subscriptionhere.Unlimited calls & SMS to 30 countries.In Salt EUROPE zoneBeyond 10 GB, the speed is reduced to 128 kbit/s.Unlimited Internet incl. 10GB at highspeed in 30 countries. Unlimited calls & SMS in 30 countries.Do you need help ordering?0800 667 667Why Salt?Outstanding mobile networkEnjoy Salt’s fast and reliable network, officially ranked outstanding in this year’s Connect test.First-class serviceManage your subscriptions in MyAccount or Salt App, or get in touch with our excellent customer care.Keep your numberSelect to keep your number when you order online and we will take care of the rest.Choose your preferred SIM type for your plan.With Salt Mobile, you have the flexibility to choose between a physical SIM or an eSIM, offering you a seamless mobile experience. Having an eSIM gives you, for example, the possibility to use two phone numbers on the same smartphone and effortlessly switch between your professional and personal lines. When you use an eSIM, you dont have to worry about inserting or removing your SIM card, and it is even more secure as you can remotely deactivate it in case of losing it or being stolen.How do I select an eSIM for my mobile subscription?It is simple, just order your favorite subscription online and select your preferred SIM type in the \"order summary\" step of the order process. After you finish your order, we will send you an eSIM voucher via post to activate it via QR code. Say hello to simplicity!Add the subscription of your choice to your basket.Complete your personal information in the eshop.In your order summary, select either a physical SIM or an eSIM.Do you travel regularly and want to subscribe to a mobile plan with no restrictions ?Discover Europe XL subscription, the ideal solution to stay connected with the world around you. Enjoy an unlimited plan including unlimited calls, SMS, and internet both in Switzerland and across Europe. Call and send SMS to your loved ones in Europe from Switzerland. With Europe XL, share photos and videos with your loved ones, listen to your favorite music on Spotify, and play online games without worrying about data limits.Enjoy our online only exclusive mobile subscription.From Switzerland, Europe XL allows you to make unlimited calls to Europe while enjoying outstanding network quality and excellent value for money. Our Europe XL mobile subscription, available exclusively online, ensures you access to quality services at a competitive price. With Europe XL, travelling and staying in touch with your relatives around Europe has never been easier !Details of the offerOffer conditionsThis offer is validuntil 10.03.2025 for a new Europe XL mobile subscription for 34.95/month instead of 94.95/month. Subject to a possible extension.Discount: discount applied lifetime for online orders only.Minimum contract duration: 12 months.Activation fees:CHF 59.95, SIM card included.Included roaming data:Data in the Salt EUROPE zone up to a maximum of 10GB per month, then speed reduction to 128 Kbits/s. In majority of Europe, list of countries onsalt.ch.Additional roaming data:Data DayPassavailable to use internet while abroad in the TRAVEL zone.Getin touchwith SaltSalt My AccountLoginHelpVisit our help centerSalt StoresVisit our shopsPhone Sales SupportTalk to our sales experts"
        }
    },
    {
        "url": "https://www.salt.ch/en/mobile/smartwatches",
        "data": {
            "title": "All our Smartwatches - Order online | Salt.",
            "description": "Smartwatches, 0800 667 667, Salt store",
            "body": "All our Smartwatches - Order online | Salt.Skip to main contentMobileSmartwatchesSmartwatchesFor more information please call us on0800 667 667or visit your nearestSalt store.APPLEHUAWEISAMSUNGTCL*More infoWatch Connect optionGetin touchwith SaltSalt My AccountLoginHelpVisit our help centerSalt StoresVisit our shopsPhone Sales SupportTalk to our sales experts"
        }
    },
    {
        "url": "https://www.salt.ch/en/mobile/plans/all-subscriptions",
        "data": {
            "title": "Phone subscriptions and plans - Order online | Salt.",
            "description": "Salt. - Mobile Plans and Offers",
            "body": "Phone subscriptions and plans - Order online | Salt.Skip to main contentORDER ONLINE0800 667 667Europe XL offer is valid until Monday!DaysHoursMinutesSeconds0000Our best mobile subscriptionson our outstanding mobile network.Discover our premium mobile plans with unlimited calls and texts, along with our fast and reliable mobile internet connection. Combine them with our exceptional Internet & TV!Mobile DealsMobile MaxMobile DigitalMobile DataStart Max offer is valid until Monday!DaysHoursMinutesSeconds000064% DISCOUNTStart MaxThe ideal starter packIn Switzerland5 GB Internet at maximum speed 5G.Unlimited calls & SMS.In Switzerland5 GB Internet at maximum speed 5G.Unlimited calls & SMS.eSIM availableeSIM availableONLINE ONLYLifetime discount14.95/month64%Instead of41.95Order nowProduct DetailsSwiss XXL offer is valid until Thursday!DaysHoursMinutesSeconds000065% DISCOUNTSwiss XXLThe exclusive for CH and EuropeIn SwitzerlandUnlimited Internet at maximum speed 5G.Unlimited calls & SMS.In SwitzerlandUnlimited Internet at maximum speed 5G.Unlimited calls & SMS.In Salt EUROPE zone4 GB Internet.100 min calls.Unlimited SMS.In Salt EUROPE zone4 GB Internet.100 min calls.Unlimited SMS.30 countries included:Andorra, Austria, Belgium, Cyprus, Czech Republic, Denmark*, Faroe Islands, Finland, France* (including Corsica), Germany, Gibraltar, Greece, Hungary, Iceland, Ireland, Italy, Luxembourg, Malta, Monaco, Netherlands*, Norway* (including Svalbard), Poland, Portugal (including Madeira and the Azores), Romania, San Marino, Slovakia, Spain (including the Canary Islands and the Balearic Islands), Sweden, United Kingdom* (excluding the Channel Islands: Jersey, Guernsey, Isle of Man), Vatican City.*Overseas territories are not included.eSIM availableeSIM availableONLINE ONLYLifetime discount27.95/month-65%Instead of83.95Order nowProduct DetailsDaysHoursMinutesSeconds000065% DISCOUNTEurope DataUnlimited data in EuropeIn SwitzerlandUnlimited Internet at maximum speed 5G.Unlimited calls & SMS.In SwitzerlandUnlimited Internet at maximum speed 5G.Unlimited calls & SMS.In Salt EUROPE zoneUnlimited internet incl. 20GB at highspeed.In Salt EUROPE zoneUnlimited internet incl. 20GB at highspeed.30 countries included:Andorra, Austria, Belgium, Cyprus, Czech Republic, Denmark*, Faroe Islands, Finland, France* (including Corsica), Germany, Gibraltar, Greece, Hungary, Iceland, Ireland, Italy, Luxembourg, Malta, Monaco, Netherlands*, Norway* (including Svalbard), Poland, Portugal (including Madeira and the Azores), Romania, San Marino, Slovakia, Spain (including the Canary Islands and the Balearic Islands), Sweden, United Kingdom* (excluding the Channel Islands: Jersey, Guernsey, Isle of Man), Vatican City.*Overseas territories are not included.eSIM availableeSIM availableONLINE ONLYLifetime discount32.95/month-65%Instead of94.95Order nowProduct DetailsEurope XL offer is valid until Monday!DaysHoursMinutesSeconds0000💎 ONLINE EXCLUSIVE -60%Europe XLAlways connected in and to EuropeIn SwitzerlandUnlimited Internet at maximum speed 5G.Unlimited calls & SMS.In SwitzerlandUnlimited Internet at maximum speed 5G.Unlimited calls & SMS.From CH to Salt EUROPE zoneUnlimited calls & SMS.From CH to Salt EUROPE zoneUnlimited calls & SMS.30 countries included:Andorra, Austria, Belgium, Cyprus, Czech Republic, Denmark*, Faroe Islands, Finland, France* (including Corsica), Germany, Gibraltar, Greece, Hungary, Iceland, Ireland, Italy, Luxembourg, Malta, Monaco, Netherlands*, Norway* (including Svalbard), Poland, Portugal (including Madeira and the Azores), Romania, San Marino, Slovakia, Spain (including the Canary Islands and the Balearic Islands), Sweden, United Kingdom* (excluding the Channel Islands: Jersey, Guernsey, Isle of Man), Vatican City.*Overseas territories are not includedIn Salt EUROPE zoneUnlimited Internet incl. 10GB at highspeed.Unlimited Calls & SMS.In Salt EUROPE zoneUnlimited Internet incl. 10GB at highspeed.Unlimited Calls & SMS.30 countries included:Andorra, Austria, Belgium, Cyprus, Czech Republic, Denmark*, Faroe Islands, Finland, France* (including Corsica), Germany, Gibraltar, Greece, Hungary, Iceland, Ireland, Italy, Luxembourg, Malta, Monaco, Netherlands*, Norway* (including Svalbard), Poland, Portugal (including Madeira and the Azores), Romania, San Marino, Slovakia, Spain (including the Canary Islands and the Balearic Islands), Sweden, United Kingdom* (excluding the Channel Islands: Jersey, Guernsey, Isle of Man), Vatican City.*Overseas territories are not includedeSIM availableeSIM availableONLINE ONLYLifetime discount34.95/month-60%Instead of94.95Order nowProduct DetailsDaysHoursMinutesSeconds000047% DISCOUNTEurope MaxThe unlimited connection in EuropeIn SwitzerlandUnlimited Internet at maximum speed 5G.Unlimited calls & SMS.In SwitzerlandUnlimited Internet at maximum speed 5G.Unlimited calls & SMS.In Salt EUROPE zoneUnlimited internet incl. 40GB at highspeed.Unlimited calls & SMS to Switzerland and within the visited country.In Salt EUROPE zoneUnlimited internet incl. 40GB at highspeed.Unlimited calls & SMS to Switzerland and within the visited country.30 countries included:Andorra, Austria, Belgium, Cyprus, Czech Republic, Denmark*, Faroe Islands, Finland, France* (including Corsica), Germany, Gibraltar, Greece, Hungary, Iceland, Ireland, Italy, Luxembourg, Malta, Monaco, Netherlands*, Norway* (including Svalbard), Poland, Portugal (including Madeira and the Azores), Romania, San Marino, Slovakia, Spain (including the Canary Islands and the Balearic Islands), Sweden, United Kingdom* (excluding the Channel Islands: Jersey, Guernsey, Isle of Man), Vatican City.*Overseas territories are not includedeSIM availableeSIM availableONLINE ONLYLifetime discount44.95/month-47%Instead of84.95Order nowProduct DetailsStart Max offer is valid until Monday!DaysHoursMinutesSeconds000064% DISCOUNTStart MaxThe ideal starter packIn Switzerland5 GB Internet at maximum speed 5G.Unlimited calls & SMS.In Switzerland5 GB Internet at maximum speed 5G.Unlimited calls & SMS.eSIM availableeSIM availableONLINE ONLYLifetime discount14.95/month64%Instead of41.95Order nowProduct DetailsDaysHoursMinutesSeconds000047% DISCOUNTEurope MaxThe unlimited connection in EuropeIn SwitzerlandUnlimited Internet at maximum speed 5G.Unlimited calls & SMS.In SwitzerlandUnlimited Internet at maximum speed 5G.Unlimited calls & SMS.In Salt EUROPE zoneUnlimited internet incl. 40GB at highspeed.Unlimited calls & SMS to Switzerland and within the visited country.In Salt EUROPE zoneUnlimited internet incl. 40GB at highspeed.Unlimited calls & SMS to Switzerland and within the visited country.30 countries included:Andorra, Austria, Belgium, Cyprus, Czech Republic, Denmark*, Faroe Islands, Finland, France* (including Corsica), Germany, Gibraltar, Greece, Hungary, Iceland, Ireland, Italy, Luxembourg, Malta, Monaco, Netherlands*, Norway* (including Svalbard), Poland, Portugal (including Madeira and the Azores), Romania, San Marino, Slovakia, Spain (including the Canary Islands and the Balearic Islands), Sweden, United Kingdom* (excluding the Channel Islands: Jersey, Guernsey, Isle of Man), Vatican City.*Overseas territories are not includedeSIM availableeSIM availableONLINE ONLYLifetime discount44.95/month-47%Instead of84.95Order nowProduct DetailsSwiss Max offer  is valid until Thursday!DaysHoursMinutesSeconds0000Swiss MaxThe favourite for CHIn SwitzerlandUnlimited Internet at maximum speed 5G.Unlimited calls & SMS.In SwitzerlandUnlimited Internet at maximum speed 5G.Unlimited calls & SMS.In Salt EUROPE zone1 GB internet.In Salt EUROPE zone1 GB internet.30 countries included:Andorra, Austria, Belgium, Cyprus, Czech Republic, Denmark*, Faroe Islands, Finland, France* (including Corsica), Germany, Gibraltar, Greece, Hungary, Iceland, Ireland, Italy, Luxembourg, Malta, Monaco, Netherlands*, Norway* (including Svalbard), Poland, Portugal (including Madeira and the Azores), Romania, San Marino, Slovakia, Spain (including the Canary Islands and the Balearic Islands), Sweden, United Kingdom* (excluding the Channel Islands: Jersey, Guernsey, Isle of Man), Vatican City.*Overseas territories are not includedeSIM availableeSIM available72.95/monthOrder nowProduct DetailsDaysHoursMinutesSeconds000046% DISCOUNTTravel MaxFirst-class for travelling the worldIn SwitzerlandUnlimited Internet at maximum speed 5G.Unlimited calls & SMS.In SwitzerlandUnlimited Internet at maximum speed 5G.Unlimited calls & SMS.In/to Salt EUROPE zoneUnlimited Internet incl. 40GB at highspeed.Unlimited calls & SMS.In/to Salt EUROPE zoneUnlimited Internet incl. 40GB at highspeed.Unlimited calls & SMS.30 countries included:Andorra, Austria, Belgium, Cyprus, Czech Republic, Denmark*, Faroe Islands, Finland, France* (including Corsica), Germany, Gibraltar, Greece, Hungary, Iceland, Ireland, Italy, Luxembourg, Malta, Monaco, Netherlands*, Norway* (including Svalbard), Poland, Portugal (including Madeira and the Azores), Romania, San Marino, Slovakia, Spain (including the Canary Islands and the Balearic Islands), Sweden, United Kingdom* (excluding the Channel Islands: Jersey, Guernsey, Isle of Man), Vatican City.*Overseas territories are not includedIn/to TRAVEL zoneUnlimited internet incl. 5GB at highspeed.10 hours of calls & SMS to Switzerland and within 30 top travel destinations.In/to TRAVEL zoneUnlimited internet incl. 5GB at highspeed.10 hours of calls & SMS to Switzerland and within 30 top travel destinations.30 countries included:Argentina, Australia*, Bangladesh, Brazil, Bulgaria, Canada, Chile, China*, Colombia, Croatia, Dominican Republic, Estonia, Hong Kong, India, Japan, Latvia, Lithuania, Malaysia, Mexico, New Zealand*, Peru, Qatar, Republic of South Africa, Saudi Arabia, Singapore, Slovenia, Taiwan, Thailand, Türkiye, United Arab Emirates, United States of America* (including Alaska and Hawaii).*Overseas territories are not includedeSIM availableeSIM available104.95/monthOrder nowProduct DetailsDaysHoursMinutesSeconds000065% DISCOUNTEurope DataUnlimited data in EuropeIn SwitzerlandUnlimited Internet at maximum speed 5G.Unlimited calls & SMS.In SwitzerlandUnlimited Internet at maximum speed 5G.Unlimited calls & SMS.In Salt EUROPE zoneUnlimited internet incl. 20GB at highspeed.In Salt EUROPE zoneUnlimited internet incl. 20GB at highspeed.30 countries included:Andorra, Austria, Belgium, Cyprus, Czech Republic, Denmark*, Faroe Islands, Finland, France* (including Corsica), Germany, Gibraltar, Greece, Hungary, Iceland, Ireland, Italy, Luxembourg, Malta, Monaco, Netherlands*, Norway* (including Svalbard), Poland, Portugal (including Madeira and the Azores), Romania, San Marino, Slovakia, Spain (including the Canary Islands and the Balearic Islands), Sweden, United Kingdom* (excluding the Channel Islands: Jersey, Guernsey, Isle of Man), Vatican City.*Overseas territories are not included.eSIM availableeSIM availableONLINE ONLYLifetime discount32.95/month-65%Instead of94.95Order nowProduct DetailsSwiss XXL offer is valid until Thursday!DaysHoursMinutesSeconds000065% DISCOUNTSwiss XXLThe exclusive for CH and EuropeIn SwitzerlandUnlimited Internet at maximum speed 5G.Unlimited calls & SMS.In SwitzerlandUnlimited Internet at maximum speed 5G.Unlimited calls & SMS.In Salt EUROPE zone4 GB Internet.100 min calls.Unlimited SMS.In Salt EUROPE zone4 GB Internet.100 min calls.Unlimited SMS.30 countries included:Andorra, Austria, Belgium, Cyprus, Czech Republic, Denmark*, Faroe Islands, Finland, France* (including Corsica), Germany, Gibraltar, Greece, Hungary, Iceland, Ireland, Italy, Luxembourg, Malta, Monaco, Netherlands*, Norway* (including Svalbard), Poland, Portugal (including Madeira and the Azores), Romania, San Marino, Slovakia, Spain (including the Canary Islands and the Balearic Islands), Sweden, United Kingdom* (excluding the Channel Islands: Jersey, Guernsey, Isle of Man), Vatican City.*Overseas territories are not included.eSIM availableeSIM availableONLINE ONLYLifetime discount27.95/month-65%Instead of83.95Order nowProduct DetailsEurope XL offer is valid until Monday!DaysHoursMinutesSeconds0000💎 ONLINE EXCLUSIVE -60%Europe XLAlways connected in and to EuropeIn SwitzerlandUnlimited Internet at maximum speed 5G.Unlimited calls & SMS.In SwitzerlandUnlimited Internet at maximum speed 5G.Unlimited calls & SMS.From CH to Salt EUROPE zoneUnlimited calls & SMS.From CH to Salt EUROPE zoneUnlimited calls & SMS.30 countries included:Andorra, Austria, Belgium, Cyprus, Czech Republic, Denmark*, Faroe Islands, Finland, France* (including Corsica), Germany, Gibraltar, Greece, Hungary, Iceland, Ireland, Italy, Luxembourg, Malta, Monaco, Netherlands*, Norway* (including Svalbard), Poland, Portugal (including Madeira and the Azores), Romania, San Marino, Slovakia, Spain (including the Canary Islands and the Balearic Islands), Sweden, United Kingdom* (excluding the Channel Islands: Jersey, Guernsey, Isle of Man), Vatican City.*Overseas territories are not includedIn Salt EUROPE zoneUnlimited Internet incl. 10GB at highspeed.Unlimited Calls & SMS.In Salt EUROPE zoneUnlimited Internet incl. 10GB at highspeed.Unlimited Calls & SMS.30 countries included:Andorra, Austria, Belgium, Cyprus, Czech Republic, Denmark*, Faroe Islands, Finland, France* (including Corsica), Germany, Gibraltar, Greece, Hungary, Iceland, Ireland, Italy, Luxembourg, Malta, Monaco, Netherlands*, Norway* (including Svalbard), Poland, Portugal (including Madeira and the Azores), Romania, San Marino, Slovakia, Spain (including the Canary Islands and the Balearic Islands), Sweden, United Kingdom* (excluding the Channel Islands: Jersey, Guernsey, Isle of Man), Vatican City.*Overseas territories are not includedeSIM availableeSIM availableONLINE ONLYLifetime discount34.95/month-60%Instead of94.95Order nowProduct DetailsDaysHoursMinutesSeconds0000Swiss 10GBThe clever choice for CHIn Switzerland10 GB highspeed Internet 5G.Unlimited calls & SMS.In Switzerland10 GB highspeed Internet 5G.Unlimited calls & SMS.eSIM availableeSIM available51.95/monthOrder nowProduct DetailsDaysHoursMinutesSeconds0000SmartLimitless surfing in CHIn SwitzerlandUnlimited Internet at maximum speed 5G.Unlimited calls & SMS.In SwitzerlandUnlimited Internet at maximum speed 5G.Unlimited calls & SMS.eSIM availableeSIM available62.95/monthOrder nowProduct DetailsDaysHoursMinutesSeconds0000Europe XXLThe premium in/to EuropeIn SwitzerlandUnlimited Internet at maximum speed 5G.Unlimited calls & SMS.In SwitzerlandUnlimited Internet at maximum speed 5G.Unlimited calls & SMS.From CH to Salt EUROPE zoneUnlimited calls & SMS.From CH to Salt EUROPE zoneUnlimited calls & SMS.30 countries included:Andorra, Austria, Belgium, Cyprus, Czech Republic, Denmark*, Faroe Islands, Finland, France* (including Corsica), Germany, Gibraltar, Greece, Hungary, Iceland, Ireland, Italy, Luxembourg, Malta, Monaco, Netherlands*, Norway* (including Svalbard), Poland, Portugal (including Madeira and the Azores), Romania, San Marino, Slovakia, Spain (including the Canary Islands and the Balearic Islands), Sweden, United Kingdom* (excluding the Channel Islands: Jersey, Guernsey, Isle of Man), Vatican City.*Overseas territories are not includedIn Salt EUROPE zoneUnlimited Internet incl. 40GB at highspeed.Unlimited calls & SMS.In Salt EUROPE zoneUnlimited Internet incl. 40GB at highspeed.Unlimited calls & SMS.30 countries included:Andorra, Austria, Belgium, Cyprus, Czech Republic, Denmark*, Faroe Islands, Finland, France* (including Corsica), Germany, Gibraltar, Greece, Hungary, Iceland, Ireland, Italy, Luxembourg, Malta, Monaco, Netherlands*, Norway* (including Svalbard), Poland, Portugal (including Madeira and the Azores), Romania, San Marino, Slovakia, Spain (including the Canary Islands and the Balearic Islands), Sweden, United Kingdom* (excluding the Channel Islands: Jersey, Guernsey, Isle of Man), Vatican City.*Overseas territories are not includedeSIM availableeSIM available104.95/monthOrder nowProduct DetailsDaysHoursMinutesSeconds0000Surf 5 GBThe optimal for CHIn Switzerland5 GB Internet 5G.In Switzerland5 GB Internet 5G.9.95/monthOrder nowProduct DetailsDaysHoursMinutesSeconds000050% DISCOUNTSurf UnlimitedThe ultimate for CHIn SwitzerlandUnlimited Internet 5G.In SwitzerlandUnlimited Internet 5G.ONLINE ONLYLifetime discount17.95/month-50%Instead of35.95Order nowProduct DetailsDaysHoursMinutesSeconds0000Surf 50 GBThe ideal for CHIn Switzerland50 GB Internet 5G.In Switzerland50 GB Internet 5G.24.95/monthOrder nowProduct DetailsDo you need help ordering?0800 667 667Why Salt?Outstandingmobile networkEnjoy Salt’s fast and reliable network, officially ranked outstanding in this year’s Connect test.First-classserviceManage your subscriptions in MyAccount or Salt App, or get in touch with our excellent customer care.Premium offersat our best priceOrder online to profit from our Top Deals with lifelong discounts.Do all Salt mobile plans include unlimited internet?At Salt, unlimited internet at maximum 5G speed is a key feature of many of our mobile subscriptions. Some plans, like Swiss Max, offer unlimited internet in Switzerland, ideal for users who want to stay constantly connected at the highest speed. Other plans, such as Swiss 10GB, offer a large amount of data, sufficient for most users. For travel in Europe, enjoy our Europe Data and Europe Max subscriptions with unlimited Internet and up to 20 GB or 40 GB of high-speed data. With Salt, you benefit from an outstanding network and great flexible when choosing your subscription.Can Salt mobile plans be used abroad?Most of our mobile plans are perfectly suited for use abroad. Whether you're on a business trip or vacation, stay connected while traveling. For example, the Europe XL plan offers unlimited internet in 30 European countries, including 10GB of high-speed data. We have various mobile plans designed to meet your specific needs, whether in Switzerland or abroad. With Salt, travel confidently, wherever you are.Switching to Salt is easy!OrderOrder Online and select to keep your number. Salt takes care of the cancellation at the current operator.New SIMKeep the SIM card aside until the transfer date. This date is communicated by SMS.TransferInsert the Salt SIM card at the transfer date & enjoy Salt's outstanding network.Discover our dedicated business offers to match your company's needs.Join Salt Business to enjoy premium quality at top prices.Discover our mobile, internet, and fixed telephony solutions for your business.Discover our mobile, internet, and fixed telephony solutions for your business.DISCOVEROur best network & Awards.Our outstanding networkThe 2025 result marks the highest test score Salt has ever achieved.LEARN MOREOur 99.9%coverage99.9% coverage of the swiss population.LEARN MOREBilanz Best Universal ProviderSalt ranked Best Universal Provider for Residential and SME customers.LEARN MOREGetin touchwith SaltSalt My AccountLoginHelpVisit our help centerSalt StoresVisit our shopsPhone Sales SupportTalk to our sales expertsCall usOur sales experts will help you tofind the best deal.Mo-Fr 9-18 (toll free)0800 667 667"
        }
    },
    {
        "url": "https://www.salt.ch/en/mobile/smartphones/iphone16pro128gb",
        "data": {
            "title": "Salt. | iPhone 16 Pro 128 GB",
            "description": "",
            "body": "Salt. | iPhone 16 Pro 128 GBSkip to main contentMobilesmartphonesiPhone 16 Pro 128 GBiPhone 16 Pro 128 GBAPPLECapacity :128 Gb256 Gb512 Gb1024 GbColors :- Any -black titaniumdesert titaniumnatural titaniumwhite titaniumChoose the offer that best suits you :iPhone 16 Pro 128 GB17.71/per monthfor 24 monthStart Max40.95/monthStart MaxIn Switzerland:5GB highspeed Internet (4G+)Unlimited calls & SMS/MMSBUYiPhone 16 Pro 128 GB17.71/per monthfor 24 monthStart Max40.95/monthStart MaxIn Switzerland:5GB highspeed Internet (4G+)Unlimited calls & SMS/MMSBUYiPhone 16 Pro 128 GB17.71/per monthfor 24 monthStart Max40.95/monthStart MaxIn Switzerland:5GB highspeed Internet (4G+)Unlimited calls & SMS/MMSBUYiPhone 16 Pro 128 GB17.71/per monthfor 24 monthStart Max40.95/monthStart MaxIn Switzerland:5GB highspeed Internet (4G+)Unlimited calls & SMS/MMSBUYiPhone 16 Pro 128 GB14.71/per monthfor 24 monthSwiss 10GB50.95/monthSwiss 10GBIn Switzerland:10 GB highspeed Internet (4G+ & 5G)Unlimited calls, SMS/MMSBUYiPhone 16 Pro 128 GB14.71/per monthfor 24 monthSwiss 10GB50.95/monthSwiss 10GBIn Switzerland:10 GB highspeed Internet (4G+ & 5G)Unlimited calls, SMS/MMSBUYiPhone 16 Pro 128 GB14.71/per monthfor 24 monthSwiss 10GB50.95/monthSwiss 10GBIn Switzerland:10 GB highspeed Internet (4G+ & 5G)Unlimited calls, SMS/MMSBUYiPhone 16 Pro 128 GB14.71/per monthfor 24 monthSwiss 10GB50.95/monthSwiss 10GBIn Switzerland:10 GB highspeed Internet (4G+ & 5G)Unlimited calls, SMS/MMSBUYiPhone 16 Pro 128 GB1.71/per monthfor 24 monthSwiss Max71.95/monthSwiss MaxIn Switzerland:Everything unlimitedIn Europe:1GB InternetBUYiPhone 16 Pro 128 GB1.71/per monthfor 24 monthSwiss Max71.95/monthSwiss MaxIn Switzerland:Everything unlimitedIn Europe:1GB InternetBUYiPhone 16 Pro 128 GB1.71/per monthfor 24 monthSwiss Max71.95/monthSwiss MaxIn Switzerland:Everything unlimitedIn Europe:1GB InternetBUYiPhone 16 Pro 128 GB1.71/per monthfor 24 monthSwiss Max71.95/monthSwiss MaxIn Switzerland:Everything unlimitedIn Europe:1GB InternetBUYiPhone 16 Pro 128 GB0instead of1049Swiss XXL78.6681.95/monthSwiss XXLIn Switzerland:Everything unlimitedIn Europe:4GB Internet100 min of calls & unlimited SMSBUYiPhone 16 Pro 128 GB0instead of1049Swiss XXL78.6681.95/monthSwiss XXLIn Switzerland:Everything unlimitedIn Europe:4GB Internet100 min of calls & unlimited SMSBUYiPhone 16 Pro 128 GB0instead of1049Swiss XXL78.6681.95/monthSwiss XXLIn Switzerland:Everything unlimitedIn Europe:4GB Internet100 min of calls & unlimited SMSBUYiPhone 16 Pro 128 GB0instead of1049Swiss XXL78.6681.95/monthSwiss XXLIn Switzerland:Everything unlimitedIn Europe:4GB Internet100 min of calls & unlimited SMSBUYiPhone 16 Pro 128 GB8.71/per monthfor 24 monthEurope Max82.95/monthEurope MaxIn Switzerland:Everything unlimitedIn Europe:Unlimited InternetUnlimited calls & SMS to CH and within the visited countryUnlimited calls & SMS/MMSto CH and within the country visitedBUYiPhone 16 Pro 128 GB8.71/per monthfor 24 monthEurope Max82.95/monthEurope MaxIn Switzerland:Everything unlimitedIn Europe:Unlimited InternetUnlimited calls & SMS to CH and within the visited countryUnlimited calls & SMS/MMSto CH and within the country visitedBUYiPhone 16 Pro 128 GB8.71/per monthfor 24 monthEurope Max82.95/monthEurope MaxIn Switzerland:Everything unlimitedIn Europe:Unlimited InternetUnlimited calls & SMS to CH and within the visited countryUnlimited calls & SMS/MMSto CH and within the country visitedBUYiPhone 16 Pro 128 GB8.71/per monthfor 24 monthEurope Max82.95/monthEurope MaxIn Switzerland:Everything unlimitedIn Europe:Unlimited InternetUnlimited calls & SMS to CH and within the visited countryUnlimited calls & SMS/MMSto CH and within the country visitedBUYiPhone 16 Pro 128 GB0instead of1049Europe XL89.6692.95/monthEurope XLIn Switzerland:Everything unlimitedIn/to Europe:Everything unlimitedBUYiPhone 16 Pro 128 GB0instead of1049Europe XL89.6692.95/monthEurope XLIn Switzerland:Everything unlimitedIn/to Europe:Everything unlimitedBUYiPhone 16 Pro 128 GB0instead of1049Europe XL89.6692.95/monthEurope XLIn Switzerland:Everything unlimitedIn/to Europe:Everything unlimitedBUYiPhone 16 Pro 128 GB0instead of1049Europe XL89.6692.95/monthEurope XLIn Switzerland:Everything unlimitedIn/to Europe:Everything unlimitedBUYiPhone 16 Pro 128 GB0instead of1049Europe XXL98.66102.95/monthEurope XXLIn Switzerland:Everything unlimitedIn/to Europe:Everything unlimitedBUYiPhone 16 Pro 128 GB0instead of1049Europe XXL98.66102.95/monthEurope XXLIn Switzerland:Everything unlimitedIn/to Europe:Everything unlimitedBUYiPhone 16 Pro 128 GB0instead of1049Europe XXL98.66102.95/monthEurope XXLIn Switzerland:Everything unlimitedIn/to Europe:Everything unlimitedBUYiPhone 16 Pro 128 GB0instead of1049Europe XXL98.66102.95/monthEurope XXLIn Switzerland:Everything unlimitedIn/to Europe:Everything unlimitedBUYiPhone 16 Pro 128 GB0.71/per monthfor 24 monthTravel Max102.95/monthTravel MaxIn Switzerland:Everything unlimitedIn/to & Europe:Everything unlimitedIn/to 30 top travel destinations:Unlimited internet and 10 hours of calls & SMS to CH and within the TRAVEL zoneBUYiPhone 16 Pro 128 GB0.71/per monthfor 24 monthTravel Max102.95/monthTravel MaxIn Switzerland:Everything unlimitedIn/to & Europe:Everything unlimitedIn/to 30 top travel destinations:Unlimited internet and 10 hours of calls & SMS to CH and within the TRAVEL zoneBUYiPhone 16 Pro 128 GB0.71/per monthfor 24 monthTravel Max102.95/monthTravel MaxIn Switzerland:Everything unlimitedIn/to & Europe:Everything unlimitedIn/to 30 top travel destinations:Unlimited internet and 10 hours of calls & SMS to CH and within the TRAVEL zoneBUYiPhone 16 Pro 128 GB0.71/per monthfor 24 monthTravel Max102.95/monthTravel MaxIn Switzerland:Everything unlimitedIn/to & Europe:Everything unlimitedIn/to 30 top travel destinations:Unlimited internet and 10 hours of calls & SMS to CH and within the TRAVEL zoneBUYDevice specificationsOperating systemiOS 18Size (in mm)6.3-inch Super Retina XDR all-screen OLED displayWeight (in g)199gProcessorApple A18 (3nm)Sim cardDual SIM (Nano &amp; eSIM), supports Dual eSIMBattery informationVideo playback up to 27h ; Audio up to 85hSize and description2622 x 1206BluetoothBluetooth 5.3Wi-FiWi-Fi 6Technology 5G"
        }
    },
    {
        "url": "https://www.salt.ch/en/mobile/plans/start-max",
        "data": {
            "title": "Salt. | Start Max",
            "description": "Salt. - Start Max",
            "body": "Salt. | Start MaxSkip to main contentMobilePlansStart MaxStart Max:The practical mobile subscription for Switzerland.Explore Unlimited calls and SMS, 5 GB internet in CH.Start Max offer is valid until Monday!DaysHoursMinutesSeconds0000ONLINE ONLYLifetime discount14.95/month64%Instead of41.95Order nowFactsheet (PDF)Start MaxStartMax14.95/monthInstead of41.95Order nowIn SwitzerlandBeyond 5 GB, the Internet connection is blocked by default. To continue surfing, our Data Packs are availablehere.5 GB Internet at maximum speed 5G (up to 1,7 Gbit/s). Unlimited calls & SMS.Do you need help ordering?0800 667 667Why Salt?Outstanding mobile networkEnjoy Salt’s fast and reliable network, officially ranked outstanding in this year’s Connect test.First-class serviceManage your subscriptions in MyAccount or Salt App, or get in touch with our excellent customer care.Keep your numberSelect to keep your number when you order online and we will take care of the rest.Choose your preferred SIM type for your plan.With Salt Mobile, you have the flexibility to choose between a physical SIM or an eSIM, offering you a seamless mobile experience. Having an eSIM gives you, for example, the possibility to use two phone numbers on the same smartphone and effortlessly switch between your professional and personal lines. When you use an eSIM, you dont have to worry about inserting or removing your SIM card, and it is even more secure as you can remotely deactivate it in case of losing it or being stolen.How do I select an eSIM for my mobile subscription?It is simple, just order your favorite subscription online and select your preferred SIM type in the \"order summary\" step of the order process. After you finish your order, we will send you an eSIM voucher via post to activate it via QR code. Say hello to simplicity!Add the subscription of your choice to your basket.Complete your personal information in the eshop.In your order summary, select either a physical SIM or an eSIM.Stay connected across Switzerland.Discover the Start Max mobile subscription, designed for those who want to stay connected on a budget. With unlimited calls and SMS in Switzerland, you can communicate with your friends and family anywhere in the country.5 GB for your everyday needs.The Start Max mobile subscription includes 5 GB of Internet, so you can check your e-mails, surf the internet and use your usual applications. Start Max is ideal for users who don't need a lot of data, but want to remain reachable at any time.Details of the offerOffer conditionsThis offer is valid until17.03.2025 for a new Start Max mobile subscription for 14.95/month instead of 41.95/month.Discount: discount applied lifetime for online orders only.Minimum contract duration: 12 months.Activation fees: CHF 59.95, SIM card included.Additional roaming data: Data DayPass available to use internet while abroad in the EUROPE or TRAVEL zone.Getin touchwith SaltSalt My AccountLoginHelpVisit our help centerSalt StoresVisit our shopsPhone Sales SupportTalk to our sales experts"
        }
    },
    {
        "url": "https://www.salt.ch/en/mobile/plans/europe-xl",
        "data": {
            "title": "Salt. | Europe XL",
            "description": "Salt. - Europe XL",
            "body": "Salt. | Europe XLSkip to main contentMobilePlansEurope XLEurope XL:The online exclusive mobile subscription in and to Europe.Explore and stay connected with the EUROPE zone worry-free.Europe XL offer is valid until Monday!DaysHoursMinutesSeconds0000ONLINE ONLYLifetime discount34.95/month-60%Instead of94.95Order nowFactsheet (PDF)Europe XLEuropeXL34.95/monthInstead of94.95Order nowIn SwitzerlandUnlimited Internet at maximum speed 5G (up to 1,7 Gbit/s). Unlimited calls & SMS.From CH to Salt EUROPE zoneList of 30 countries included in the subscriptionhere.Unlimited calls & SMS to 30 countries.In Salt EUROPE zoneBeyond 10 GB, the speed is reduced to 128 kbit/s.Unlimited Internet incl. 10GB at highspeed in 30 countries. Unlimited calls & SMS in 30 countries.Do you need help ordering?0800 667 667Why Salt?Outstanding mobile networkEnjoy Salt’s fast and reliable network, officially ranked outstanding in this year’s Connect test.First-class serviceManage your subscriptions in MyAccount or Salt App, or get in touch with our excellent customer care.Keep your numberSelect to keep your number when you order online and we will take care of the rest.Choose your preferred SIM type for your plan.With Salt Mobile, you have the flexibility to choose between a physical SIM or an eSIM, offering you a seamless mobile experience. Having an eSIM gives you, for example, the possibility to use two phone numbers on the same smartphone and effortlessly switch between your professional and personal lines. When you use an eSIM, you dont have to worry about inserting or removing your SIM card, and it is even more secure as you can remotely deactivate it in case of losing it or being stolen.How do I select an eSIM for my mobile subscription?It is simple, just order your favorite subscription online and select your preferred SIM type in the \"order summary\" step of the order process. After you finish your order, we will send you an eSIM voucher via post to activate it via QR code. Say hello to simplicity!Add the subscription of your choice to your basket.Complete your personal information in the eshop.In your order summary, select either a physical SIM or an eSIM.Do you travel regularly and want to subscribe to a mobile plan with no restrictions ?Discover Europe XL subscription, the ideal solution to stay connected with the world around you. Enjoy an unlimited plan including unlimited calls, SMS, and internet both in Switzerland and across Europe. Call and send SMS to your loved ones in Europe from Switzerland. With Europe XL, share photos and videos with your loved ones, listen to your favorite music on Spotify, and play online games without worrying about data limits.Enjoy our online only exclusive mobile subscription.From Switzerland, Europe XL allows you to make unlimited calls to Europe while enjoying outstanding network quality and excellent value for money. Our Europe XL mobile subscription, available exclusively online, ensures you access to quality services at a competitive price. With Europe XL, travelling and staying in touch with your relatives around Europe has never been easier !Details of the offerOffer conditionsThis offer is validuntil 10.03.2025 for a new Europe XL mobile subscription for 34.95/month instead of 94.95/month. Subject to a possible extension.Discount: discount applied lifetime for online orders only.Minimum contract duration: 12 months.Activation fees:CHF 59.95, SIM card included.Included roaming data:Data in the Salt EUROPE zone up to a maximum of 10GB per month, then speed reduction to 128 Kbits/s. In majority of Europe, list of countries onsalt.ch.Additional roaming data:Data DayPassavailable to use internet while abroad in the TRAVEL zone.Getin touchwith SaltSalt My AccountLoginHelpVisit our help centerSalt StoresVisit our shopsPhone Sales SupportTalk to our sales experts"
        }
    },
    {
        "url": "https://www.salt.ch/mobile/devices",
        "data": {
            "title": "All our devices - Order online | Salt.",
            "description": "Salt. - Devices",
            "body": "All our devices - Order online | Salt.Skip to main contentMobileDevicesORDER ONLINE0800 667 667All devicesWe have a wide range of smartphones, smartwatches, tablets & gaming consoles to help you make the most of your mobile subscription.SMARTPHONESTABLETSSMART WATCHESGAMING CONSOLESLAPTOPSMOBILE WI-FIDo you need help ordering?0800 667 667Why Salt?Outstandingmobile networkEnjoy Salt’s fast and reliable network, officially ranked outstanding in this year’s Connect test.First-classserviceManage your subscriptions in MyAccount or Salt App, or get in touch with our excellent customer care.Premium offersat our best priceOrder online to profit from our Top Deals with lifelong discounts.Sell your old device with Salt and Revendo.Get cashback and do something good.SELL YOUR DEVICE NOW!Getin touchwith SaltSalt My AccountLoginHelpVisit our help centerSalt StoresVisit our shopsPhone Sales SupportTalk to our sales experts"
        }
    },
    {
        "url": "https://www.salt.ch/en/mobile/smartphones/galaxys25ultra512gb",
        "data": {
            "title": "Salt. | Galaxy S25 Ultra 512 GB",
            "description": "",
            "body": "Salt. | Galaxy S25 Ultra 512 GBSkip to main contentMobilesmartphonesGalaxy S25 Ultra 512 GBGalaxy S25 Ultra 512 GBSAMSUNGCapacity :256 Gb512 GbColors :- Any -blackbluegraysilverChoose the offer that best suits you :Galaxy S25 Ultra 512 GB765instead of1299Start Max40.95/monthStart MaxIn Switzerland:5GB highspeed Internet (4G+)Unlimited calls & SMS/MMSBUYGalaxy S25 Ultra 512 GB765instead of1299Start Max40.95/monthStart MaxIn Switzerland:5GB highspeed Internet (4G+)Unlimited calls & SMS/MMSBUYGalaxy S25 Ultra 512 GB765instead of1299Start Max40.95/monthStart MaxIn Switzerland:5GB highspeed Internet (4G+)Unlimited calls & SMS/MMSBUYGalaxy S25 Ultra 512 GB765instead of1299Start Max40.95/monthStart MaxIn Switzerland:5GB highspeed Internet (4G+)Unlimited calls & SMS/MMSBUYGalaxy S25 Ultra 512 GB693instead of1299Swiss 10GB50.95/monthSwiss 10GBIn Switzerland:10 GB highspeed Internet (4G+ & 5G)Unlimited calls, SMS/MMSBUYGalaxy S25 Ultra 512 GB693instead of1299Swiss 10GB50.95/monthSwiss 10GBIn Switzerland:10 GB highspeed Internet (4G+ & 5G)Unlimited calls, SMS/MMSBUYGalaxy S25 Ultra 512 GB693instead of1299Swiss 10GB50.95/monthSwiss 10GBIn Switzerland:10 GB highspeed Internet (4G+ & 5G)Unlimited calls, SMS/MMSBUYGalaxy S25 Ultra 512 GB693instead of1299Swiss 10GB50.95/monthSwiss 10GBIn Switzerland:10 GB highspeed Internet (4G+ & 5G)Unlimited calls, SMS/MMSBUYGalaxy S25 Ultra 512 GB15.88/per monthfor 24 monthSwiss Max71.95/monthSwiss MaxIn Switzerland:Everything unlimitedIn Europe:1GB InternetBUYGalaxy S25 Ultra 512 GB15.88/per monthfor 24 monthSwiss Max71.95/monthSwiss MaxIn Switzerland:Everything unlimitedIn Europe:1GB InternetBUYGalaxy S25 Ultra 512 GB15.88/per monthfor 24 monthSwiss Max71.95/monthSwiss MaxIn Switzerland:Everything unlimitedIn Europe:1GB InternetBUYGalaxy S25 Ultra 512 GB15.88/per monthfor 24 monthSwiss Max71.95/monthSwiss MaxIn Switzerland:Everything unlimitedIn Europe:1GB InternetBUYGalaxy S25 Ultra 512 GB10.88/per monthfor 24 monthSwiss XXL81.95/monthSwiss XXLIn Switzerland:Everything unlimitedIn Europe:4GB Internet100 min of calls & unlimited SMSBUYGalaxy S25 Ultra 512 GB10.88/per monthfor 24 monthSwiss XXL81.95/monthSwiss XXLIn Switzerland:Everything unlimitedIn Europe:4GB Internet100 min of calls & unlimited SMSBUYGalaxy S25 Ultra 512 GB10.88/per monthfor 24 monthSwiss XXL81.95/monthSwiss XXLIn Switzerland:Everything unlimitedIn Europe:4GB Internet100 min of calls & unlimited SMSBUYGalaxy S25 Ultra 512 GB10.88/per monthfor 24 monthSwiss XXL81.95/monthSwiss XXLIn Switzerland:Everything unlimitedIn Europe:4GB Internet100 min of calls & unlimited SMSBUYGalaxy S25 Ultra 512 GB22.88/per monthfor 24 monthEurope Max82.95/monthEurope MaxIn Switzerland:Everything unlimitedIn Europe:Unlimited InternetUnlimited calls & SMS to CH and within the visited countryUnlimited calls & SMS/MMSto CH and within the country visitedBUYGalaxy S25 Ultra 512 GB22.88/per monthfor 24 monthEurope Max82.95/monthEurope MaxIn Switzerland:Everything unlimitedIn Europe:Unlimited InternetUnlimited calls & SMS to CH and within the visited countryUnlimited calls & SMS/MMSto CH and within the country visitedBUYGalaxy S25 Ultra 512 GB22.88/per monthfor 24 monthEurope Max82.95/monthEurope MaxIn Switzerland:Everything unlimitedIn Europe:Unlimited InternetUnlimited calls & SMS to CH and within the visited countryUnlimited calls & SMS/MMSto CH and within the country visitedBUYGalaxy S25 Ultra 512 GB22.88/per monthfor 24 monthEurope Max82.95/monthEurope MaxIn Switzerland:Everything unlimitedIn Europe:Unlimited InternetUnlimited calls & SMS to CH and within the visited countryUnlimited calls & SMS/MMSto CH and within the country visitedBUYGalaxy S25 Ultra 512 GB10.88/per monthfor 24 monthEurope XL92.95/monthEurope XLIn Switzerland:Everything unlimitedIn/to Europe:Everything unlimitedBUYGalaxy S25 Ultra 512 GB10.88/per monthfor 24 monthEurope XL92.95/monthEurope XLIn Switzerland:Everything unlimitedIn/to Europe:Everything unlimitedBUYGalaxy S25 Ultra 512 GB10.88/per monthfor 24 monthEurope XL92.95/monthEurope XLIn Switzerland:Everything unlimitedIn/to Europe:Everything unlimitedBUYGalaxy S25 Ultra 512 GB10.88/per monthfor 24 monthEurope XL92.95/monthEurope XLIn Switzerland:Everything unlimitedIn/to Europe:Everything unlimitedBUYGalaxy S25 Ultra 512 GB14.88/per monthfor 24 monthTravel Max102.95/monthTravel MaxIn Switzerland:Everything unlimitedIn/to & Europe:Everything unlimitedIn/to 30 top travel destinations:Unlimited internet and 10 hours of calls & SMS to CH and within the TRAVEL zoneBUYGalaxy S25 Ultra 512 GB9.88/per monthfor 24 monthEurope XXL102.95/monthEurope XXLIn Switzerland:Everything unlimitedIn/to Europe:Everything unlimitedBUYGalaxy S25 Ultra 512 GB14.88/per monthfor 24 monthTravel Max102.95/monthTravel MaxIn Switzerland:Everything unlimitedIn/to & Europe:Everything unlimitedIn/to 30 top travel destinations:Unlimited internet and 10 hours of calls & SMS to CH and within the TRAVEL zoneBUYGalaxy S25 Ultra 512 GB9.88/per monthfor 24 monthEurope XXL102.95/monthEurope XXLIn Switzerland:Everything unlimitedIn/to Europe:Everything unlimitedBUYGalaxy S25 Ultra 512 GB14.88/per monthfor 24 monthTravel Max102.95/monthTravel MaxIn Switzerland:Everything unlimitedIn/to & Europe:Everything unlimitedIn/to 30 top travel destinations:Unlimited internet and 10 hours of calls & SMS to CH and within the TRAVEL zoneBUYGalaxy S25 Ultra 512 GB9.88/per monthfor 24 monthEurope XXL102.95/monthEurope XXLIn Switzerland:Everything unlimitedIn/to Europe:Everything unlimitedBUYGalaxy S25 Ultra 512 GB14.88/per monthfor 24 monthTravel Max102.95/monthTravel MaxIn Switzerland:Everything unlimitedIn/to & Europe:Everything unlimitedIn/to 30 top travel destinations:Unlimited internet and 10 hours of calls & SMS to CH and within the TRAVEL zoneBUYGalaxy S25 Ultra 512 GB9.88/per monthfor 24 monthEurope XXL102.95/monthEurope XXLIn Switzerland:Everything unlimitedIn/to Europe:Everything unlimitedBUYDevice specifications"
        }
    },
    {
        "url": "https://www.salt.ch/en/mobile/plans/europe-max",
        "data": {
            "title": "Salt. | Europe Max",
            "description": "Salt. - Europe Max",
            "body": "Salt. | Europe MaxSkip to main contentMobilePlansEurope MaxEurope Max:The unlimited mobile subscriptionfor travelling Europe.Boundless, worry-free connectivity across the EUROPE zone!DaysHoursMinutesSeconds0000ONLINE ONLYLifetime discount44.95/month-47%Instead of84.95Order nowFactsheet (PDF)Europe MaxEuropeMax44.95/monthInstead of84.95Order nowIn SwitzerlandUnlimited Internet at maximum speed 5G (up to 1,7 Gbit/s). Unlimited calls & SMS.In Salt EUROPE zoneBeyond 40 GB, the speed is reduced to 128 kbit/s.List of 30 countries included in the subscriptionhere.Unlimited Internet incl. 40GB at highspeed. Unlimited calls & SMS to Switzerland and within the visited country.Do you need help ordering?0800 667 667Why Salt?Outstanding mobile networkEnjoy Salt’s fast and reliable network, officially ranked outstanding in this year’s Connect test.First-class serviceManage your subscriptions in MyAccount or Salt App, or get in touch with our excellent customer care.Keep your numberSelect to keep your number when you order online and we will take care of the rest.Discover Europe without limits.With the Europe Max mobile subscription, enjoy a complete plan including unlimited calls, SMS, and internet in Switzerland and across Europe, to stay connected without limits during your travels.Your travel companion.Whether you are on a business trip or on holiday, the Europe Max plan will accompany you in all your adventures. Discover new horizons, watch your favourite movies on Netflix, and host live streams on Twitch and TikTok with your community thanks to unlimited internet connection, including 40 GB of high-speed. Travellers, streamers, binge-watchers, the Europe Max plan is made for you!Details of the offerOffer conditionsThis offer is valid until17.03.2025 for a new Europe Max mobile subscription for 44.95/month instead of 84.95/month.Minimum contract duration: 12 months.Activation fees: CHF 59.95, SIM card included.Included roaming data:Data in the Salt EUROPE zone up to a maximum of 40GB per month, then speed reduction to 128 Kbits/s. In majority of Europe, list of countries onsalt.ch.Additional roaming data:Data DayPassavailable to use internet while abroad in the TRAVEL zone.Getin touchwith SaltSalt My AccountLoginHelpVisit our help centerSalt StoresVisit our shopsPhone Sales SupportTalk to our sales experts"
        }
    },
    {
        "url": "https://www.vodafone.al/eshop/pajisjet-aksesoret/telefonat-celular/c-120022/",
        "data": {
            "title": "Telefonat celular | Vodafone",
            "description": "No description found",
            "body": "Telefonat celular | VodafonePersonaleBiznesiPortalAa+Aa-AlbanianChange to EnglishMobileRoamingRoaming KudoRoaming në  Ballkanin PerëndimorVodafone UnlimitedVodafone NextPaketaBorn FreePse VodafoneFiks & TvGiga TVGigaFibraGigafibra me parapagesëGiga Wi -FiGigaNetShtëpia JonëeShopTelefona 📱AksesorëOutlet PromoMy VodafoneRreth NeshPërballojmë kostot e jetesësVodafone MoreFito me VodafoneSill nje MikRiciklimi i BateriveSwitch to GreenNdikimi i InflacionitSuportMenuAlbanianChange to EnglishMobileMobileRoamingRoaming KudoRoaming në  Ballkanin PerëndimorVodafone UnlimitedVodafone NextPaketaPaketaBorn FreePse VodafoneFiks & TvGiga TVGigaFibraGigaFibraGigafibra me parapagesëGiga Wi -FiGigaNetShtëpia JonëShtëpia JonëeShopeShopTelefona 📱AksesorëOutlet PromoMy VodafoneMy VodafoneRreth NeshPërballojmë kostot e jetesësVodafone MoreFito me VodafoneSill nje MikRiciklimi i BateriveSwitch to GreenNdikimi i InflacionitSuportSuportBiznesiFaqja kryesoreeShopeShopTelefonat celularTelefona 📱AksesorëOutlet PromoKrahaso produktetKrahaso produktetKrahasoKrahasoFiltërFiltrat[{@class=gr.vodafone.rest.dto.RefinementDTO, dimensionName=product.priceProductSKURange, displayName=Cmimi, refinements=[{@class=gr.vodafone.rest.dto.RefinementItemDTO, count=19, disabled=false, displayName=null, label=deri në 20.000 Lekë, selected=false, url=vf_priceSkuRange=0-20.000}, {@class=gr.vodafone.rest.dto.RefinementItemDTO, count=13, disabled=false, displayName=null, label=20.000-50.000 Lekë, selected=false, url=vf_priceSkuRange=20.001-50.000}, {@class=gr.vodafone.rest.dto.RefinementItemDTO, count=8, disabled=false, displayName=null, label=50.000-70.000 Lekë, selected=false, url=vf_priceSkuRange=50.001-70.000}, {@class=gr.vodafone.rest.dto.RefinementItemDTO, count=31, disabled=false, displayName=null, label=mbi 70.000 Lekë, selected=false, url=vf_priceSkuRange=70.000-}]}, {@class=gr.vodafone.rest.dto.RefinementDTO, dimensionName=product.brand, displayName=Brandi, refinements=[{@class=gr.vodafone.rest.dto.RefinementItemDTO, count=36, disabled=false, displayName=null, label=Samsung, selected=false, url=vf_brand=Samsung}, {@class=gr.vodafone.rest.dto.RefinementItemDTO, count=15, disabled=false, displayName=null, label=Apple, selected=false, url=vf_brand=Apple}, {@class=gr.vodafone.rest.dto.RefinementItemDTO, count=7, disabled=false, displayName=null, label=Xiaomi, selected=false, url=vf_brand=Xiaomi}, {@class=gr.vodafone.rest.dto.RefinementItemDTO, count=5, disabled=false, displayName=null, label=Alcatel, selected=false, url=vf_brand=Alcatel}, {@class=gr.vodafone.rest.dto.RefinementItemDTO, count=1, disabled=false, displayName=null, label=TCL, selected=false, url=vf_brand=TCL}, {@class=gr.vodafone.rest.dto.RefinementItemDTO, count=1, disabled=false, displayName=null, label=MLS, selected=false, url=vf_brand=MLS}]}, {@class=gr.vodafone.rest.dto.RefinementDTO, dimensionName=product.backCamera, displayName=Kamera Primare, refinements=[{@class=gr.vodafone.rest.dto.RefinementItemDTO, count=32, disabled=false, displayName=null, label=0-8, selected=false, url=vf_backCamera=0-8}, {@class=gr.vodafone.rest.dto.RefinementItemDTO, count=10, disabled=false, displayName=null, label=8MP - 12MP, selected=false, url=vf_backCamera=8MP - 12MP}, {@class=gr.vodafone.rest.dto.RefinementItemDTO, count=51, disabled=false, displayName=null, label=mbi 12MP, selected=false, url=vf_backCamera=πάνω από 12MP}]}, {@class=gr.vodafone.rest.dto.RefinementDTO, dimensionName=sku.storage, displayName=Memoria e pajisjes, refinements=[{@class=gr.vodafone.rest.dto.RefinementItemDTO, count=1, disabled=false, displayName=null, label=8 GB - 16 GB, selected=false, url=vf_storage=8-16}, {@class=gr.vodafone.rest.dto.RefinementItemDTO, count=13, disabled=false, displayName=null, label=32 GB - 64 GB, selected=false, url=vf_storage=32-64}, {@class=gr.vodafone.rest.dto.RefinementItemDTO, count=55, disabled=false, displayName=null, label=128 GB - 256 GB, selected=false, url=vf_storage=128-256}]}, {@class=gr.vodafone.rest.dto.RefinementDTO, dimensionName=product.screenSize, displayName=Përmasat e ekranit, refinements=[{@class=gr.vodafone.rest.dto.RefinementItemDTO, count=1, disabled=false, displayName=null, label=deri në 4,5, selected=false, url=vf_screenSize=0-4_5}, {@class=gr.vodafone.rest.dto.RefinementItemDTO, count=2, disabled=false, displayName=null, label=4,5 - 5, selected=false, url=vf_screenSize=4_5-5}, {@class=gr.vodafone.rest.dto.RefinementItemDTO, count=60, disabled=false, displayName=null, label=mbi 5, selected=false, url=vf_screenSize=5-}]}, {@class=gr.vodafone.rest.dto.RefinementDTO, dimensionName=product.ramCapacity, displayName=Kapaciteti i RAM, refinements=[{@class=gr.vodafone.rest.dto.RefinementItemDTO, count=2, disabled=false, displayName=null, label=deri në 2 GB, selected=false, url=vf_ram=0-2}, {@class=gr.vodafone.rest.dto.RefinementItemDTO, count=19, disabled=false, displayName=null, label=2 GB - 4 GB, selected=false, url=vf_ram=2-4}, {@class=gr.vodafone.rest.dto.RefinementItemDTO, count=38, disabled=false, displayName=null, label=mbi 4 GB, selected=false, url=vf_ram=4-}]}, {@class=gr.vodafone.rest.dto.RefinementDTO, dimensionName=product.onOffer, displayName=Në ofertë, refinements=[{@class=gr.vodafone.rest.dto.RefinementItemDTO, count=52, disabled=false, displayName=null, label=Po, selected=false, url=vf_offer=true}, {@class=gr.vodafone.rest.dto.RefinementItemDTO, count=13, disabled=false, displayName=null, label=Jo, selected=false, url=vf_offer=false}]}, {@class=gr.vodafone.rest.dto.RefinementDTO, dimensionName=product.talkPhone, displayName=Talkphone, refinements=[{@class=gr.vodafone.rest.dto.RefinementItemDTO, count=64, disabled=false, displayName=null, label=Jo, selected=false, url=vf_talkPhone=false}]}]FiltërFiltratCmimideri në 20.000 Lekë(19)20.000-50.000 Lekë(13)50.000-70.000 Lekë(8)mbi 70.000 Lekë(31)BrandiSamsung(36)Apple(15)Xiaomi(7)Alcatel(5)TCL(1)MLS(1)Më shumëMë pakKamera Primare0-8(32)8MP - 12MP(10)mbi 12MP(51)Memoria e pajisjes8 GB - 16 GB(1)32 GB - 64 GB(13)128 GB - 256 GB(55)Përmasat e ekranitderi në 4,5(1)4,5 - 5(2)mbi 5(60)Kapaciteti i RAMderi në 2 GB(2)2 GB - 4 GB(19)mbi 4 GB(38)Në ofertëPo(52)Jo(13)TalkphoneJo(64)RelevanteCmimi në rritjeCmimi në zbritjeArdhje të rejaMë populloretRenditRelevanteCmimi në rritjeCmimi në zbritjeArdhje të rejaMë populloret{\"MLS_Rocky_4G\":\"6900.0\",\"Alcatel1S2021\":\"10990.0\",\"SamsungGalaxyA16Black\":\"20990.0\",\"SamsungA13\":\"12990.0\",\"SamsungGalaxyA04s\":\"12890.0\",\"XiaomiRedmiNote11S\":\"15990.0\",\"Alcatel3080G\":\"1990.0\",\"AppleiPhone16Plus\":\"114990.0\",\"SamsungGalaxyS24Ultra\":\"104900.0\",\"SamsungS23Ultra\":\"79990.0\",\"SamsungA35\":\"25990.0\",\"IPhone14ProMax\":\"89990.0\"}{\"MLS_Rocky_4G\":{},\"Alcatel1S2021\":{},\"SamsungGalaxyA16Black\":{},\"SamsungA13\":{},\"SamsungGalaxyA04s\":{},\"XiaomiRedmiNote11S\":{},\"Alcatel3080G\":{},\"AppleiPhone16Plus\":{},\"SamsungGalaxyS24Ultra\":{},\"SamsungS23Ultra\":{},\"SamsungA35\":{},\"IPhone14ProMax\":{}}MLS Rocky 4G-50%MLS Rocky 4G13,900 Lekë6,900 LekëBli taniKrahasoCheckbox not tickedAlcatel 1S 2021-12%Alcatel 1S 202112,500 Lekë10,990 LekëNuk ka gjëndjeBli taniKrahasoCheckbox not tickedSamsung Galaxy A16 5GSamsung Galaxy A16 5G20,990 LekëNuk ka gjëndjeBli taniKrahasoCheckbox not tickedSamsung Galaxy A13-43%Samsung Galaxy A1322,900 Lekë12,990 LekëNuk ka gjëndjeBli taniKrahasoCheckbox not tickedSamsung Galaxy A04s-31%Samsung Galaxy A04s18,900 Lekë12,890 LekëNuk ka gjëndjeBli taniKrahasoCheckbox not tickedXiaomi Redmi Note 11S-51%Xiaomi Redmi Note 11S32,900 Lekë15,990 LekëBli taniBli taniKrahasoCheckbox not tickedAlcatel 3080G-55%Alcatel 3080G4,500 Lekë1,990 LekëBli taniKrahasoCheckbox not tickedApple iPhone 16 Plus-5%Apple iPhone 16 Plus121,990 Lekë114,990 LekëBli taniKrahasoCheckbox not tickedSamsung Galaxy S24 Ultra-8%Samsung Galaxy S24 Ultra114,990 Lekë104,900 LekëBli taniKrahasoCheckbox not tickedSamsung Galaxy S23 Ultra-21%Samsung Galaxy S23 Ultra101,900 Lekë79,990 LekëBli taniKrahasoCheckbox not tickedSamsung Galaxy A35-34%Samsung Galaxy A3539,900 Lekë25,990 LekëNuk ka gjëndjeBli taniKrahasoCheckbox not tickedApple iPhone 14 Pro Max-49%Apple iPhone 14 Pro Max179,900 Lekë89,990 LekëBli taniKrahasoCheckbox not tickedMë shumë (12 nga 65)1236social-youtubesocial-facebooksocial-twittersocial-instagramFondacioni Vodafone AlbaniaVodafone AlbaniaRreth VodafoneKarrieraFondacioni Vodafone AlbaniaPër MedianLajmërimeQëllimi YnëMë të kërkuaratPaketa 30 DitoreRoaming KudoInternetTarifa Vodafone me parapagesëTelefonia Fikse rezidencialeSuportAksesi për pajtimtarët me aftësi të kufizuaraKonfigurimeShërbime dhe AppsRoamingVizito Faqen e BiznesitVodafone AlbaniaRreth VodafoneKarrieraFondacioni Vodafone AlbaniaPër MedianLajmërimeQëllimi YnëMë të kërkuaratPaketa 30 DitoreRoaming KudoInternetTarifa Vodafone me parapagesëTelefonia Fikse rezidencialeSuportAksesi për pajtimtarët me aftësi të kufizuaraKonfigurimeShërbime dhe AppsRoamingVizito Faqen e Biznesitdata-js='_dialog'Site mapKushte & AfateInformacion i përgjithshëm ligjorPolitika e CookiesPortali i Privatësisë© 2025 Vodafone Albania. Adresa: Autostrada Tiranë-Durrës, Rr. \"Pavarësia\", Nr.61, Kashar, Tiranë, Shqipëri.Të lutem prit"
        }
    },
    {
        "url": "https://www.vodafone.al/paketa-dhe-oferta/paketat/",
        "data": {
            "title": "Paketat Vodafone",
            "description": "No description found",
            "body": "Paketat VodafonePersonaleBiznesiPortalAa+Aa-AlbanianChange to EnglishMobileRoamingRoaming KudoRoaming në  Ballkanin PerëndimorVodafone UnlimitedVodafone NextPaketaBorn FreePse VodafoneFiks & TvGiga TVGigaFibraGigafibra me parapagesëGiga Wi -FiGigaNetShtëpia JonëeShopTelefona 📱AksesorëOutlet PromoMy VodafoneRreth NeshPërballojmë kostot e jetesësVodafone MoreFito me VodafoneSill nje MikRiciklimi i BateriveSwitch to GreenNdikimi i InflacionitSuportMenuAlbanianChange to EnglishMobileMobileRoamingRoaming KudoRoaming në  Ballkanin PerëndimorVodafone UnlimitedVodafone NextPaketaPaketaBorn FreePse VodafoneFiks & TvGiga TVGigaFibraGigaFibraGigafibra me parapagesëGiga Wi -FiGigaNetShtëpia JonëShtëpia JonëeShopeShopTelefona 📱AksesorëOutlet PromoMy VodafoneMy VodafoneRreth NeshPërballojmë kostot e jetesësVodafone MoreFito me VodafoneSill nje MikRiciklimi i BateriveSwitch to GreenNdikimi i InflacionitSuportSuportBiznesiPaketaPaketa 30 ditoreVodafone BasicVodafone Basic600 Lekë50Minuta Kombëtare50MB InternetMë ShumëVodafone GoVodafone Go1,100 Lekë300Minuta Kombëtare300SMS Kombëtare2GB InternetMë ShumëVodafone RunVodafone Run1,600 Lekë2000Minuta Kombëtare2000SMS Kombëtare10GB InternetMë ShumëVodafone FlyVodafone Fly2,100 Lekë3000Minuta Kombëtare10Minuta NdërKombëtare3000SMS Kombëtare20GB InternetMë ShumëPaketa Ditore / JavoreTourist PackTourist Pack2500 Lekë1000Minuta Kombëtare40GB Internet21 DitëKohëzgjatjaMë ShumëTourist Giga PackTourist Giga Pack2900 LekëPa Limit*Minuta Kombëtare100GB Internet21 DitëKohëzgjatjaMë ShumëPaketa 10 DitorePaketa 10 Ditore700 Lekë300Minuta Kombëtare1.5GB Internet3000SMS brenda rrjetit30SMS KombëtareMë ShumëPaketa 3 DitorePaketa 3 Ditore300 Lekë300Minuta Kombëtare300MB Internet3000SMS brenda rrjetit30SMS KombëtareMë ShumëPaketa Shtesë5 GB Internet5 GB Internet700 Lekë5GB InternetMë Shumë6 GB Internet6 GB Internet800 Lekë6GB InternetMë Shumë100 Minuta Kombëtare100 Minuta Kombëtare150 Lekë100Minuta KombëtareMë Shumë20 Minuta Ndërkombëtare20 Minuta Ndërkombëtare300 Lekë20Minuta NdërkombëtareMë Shumë40 Minuta Ndërkombëtare40 Minuta Ndërkombëtare500 Lekë40Minuta NdërkombëtareMoresocial-youtubesocial-facebooksocial-twittersocial-instagramFondacioni Vodafone AlbaniaVodafone AlbaniaRreth VodafoneKarrieraFondacioni Vodafone AlbaniaPër MedianLajmërimeQëllimi YnëMë të kërkuaratPaketa 30 DitoreRoaming KudoInternetTarifa Vodafone me parapagesëTelefonia Fikse rezidencialeSuportAksesi për pajtimtarët me aftësi të kufizuaraKonfigurimeShërbime dhe AppsRoamingVizito Faqen e BiznesitVodafone AlbaniaRreth VodafoneKarrieraFondacioni Vodafone AlbaniaPër MedianLajmërimeQëllimi YnëMë të kërkuaratPaketa 30 DitoreRoaming KudoInternetTarifa Vodafone me parapagesëTelefonia Fikse rezidencialeSuportAksesi për pajtimtarët me aftësi të kufizuaraKonfigurimeShërbime dhe AppsRoamingVizito Faqen e Biznesitdata-js='_dialog'Site mapKushte & AfateInformacion i përgjithshëm ligjorPolitika e CookiesPortali i Privatësisë© 2025 Vodafone Albania. Adresa: Autostrada Tiranë-Durrës, Rr. \"Pavarësia\", Nr.61, Kashar, Tiranë, Shqipëri.Të lutem prit"
        }
    }
]